earlephilhower/arduino-pico/boards.txt
adafruit_metro.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
adafruit_metro.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
adafruit_metro.menu.exceptions.Enabled=Enabled
adafruit_metro.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
adafruit_metro.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
adafruit_metro.menu.dbgport.Disabled=Disabled
adafruit_metro.menu.dbgport.Disabled.build.debug_port=
adafruit_metro.menu.dbgport.Serial=Serial
adafruit_metro.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_metro.menu.dbgport.Serial1=Serial1
adafruit_metro.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_metro.menu.dbgport.Serial2=Serial2
adafruit_metro.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_metro.menu.dbglvl.None=None
adafruit_metro.menu.dbglvl.None.build.debug_level=
adafruit_metro.menu.dbglvl.Core=Core
adafruit_metro.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_metro.menu.dbglvl.SPI=SPI
adafruit_metro.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_metro.menu.dbglvl.Wire=Wire
adafruit_metro.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_metro.menu.dbglvl.Bluetooth=Bluetooth
adafruit_metro.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
adafruit_metro.menu.dbglvl.All=All
adafruit_metro.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
adafruit_metro.menu.dbglvl.NDEBUG=NDEBUG
adafruit_metro.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_metro.menu.usbstack.picosdk=Pico SDK
adafruit_metro.menu.usbstack.picosdk.build.usbstack_flags=
adafruit_metro.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_metro.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_metro.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
adafruit_metro.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_metro.menu.usbstack.nousb=No USB
adafruit_metro.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
adafruit_metro.menu.ipbtstack.ipv4only=IPv4 Only
adafruit_metro.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
adafruit_metro.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
adafruit_metro.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
adafruit_metro.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
adafruit_metro.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
adafruit_metro.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
adafruit_metro.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
adafruit_metro.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_metro.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
adafruit_metro.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
adafruit_metro.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_metro.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
adafruit_metro.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
adafruit_metro.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_metro.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
adafruit_metro.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
adafruit_metro.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_metro.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
adafruit_metro.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
adafruit_metro.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_metro.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
adafruit_metro.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
adafruit_metro.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_metro.menu.boot2.boot2_w25q080_2_padded_checksum=W25Q080 QSPI /2
adafruit_metro.menu.boot2.boot2_w25q080_2_padded_checksum.build.boot2=boot2_w25q080_2_padded_checksum
adafruit_metro.menu.boot2.boot2_w25q080_4_padded_checksum=W25Q080 QSPI /4
adafruit_metro.menu.boot2.boot2_w25q080_4_padded_checksum.build.boot2=boot2_w25q080_4_padded_checksum
adafruit_metro.menu.uploadmethod.default=Default (UF2)
adafruit_metro.menu.uploadmethod.default.build.ram_length=256k
adafruit_metro.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_metro.menu.uploadmethod.default.upload.maximum_data_size=262144
adafruit_metro.menu.uploadmethod.default.upload.tool=uf2conv
adafruit_metro.menu.uploadmethod.default.upload.tool.default=uf2conv
adafruit_metro.menu.uploadmethod.default.upload.tool.network=uf2conv-network
adafruit_metro.menu.uploadmethod.picotool=Picotool
adafruit_metro.menu.uploadmethod.picotool.build.ram_length=256k
adafruit_metro.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
adafruit_metro.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
adafruit_metro.menu.uploadmethod.picotool.upload.maximum_data_size=262144
adafruit_metro.menu.uploadmethod.picotool.upload.tool=picotool
adafruit_metro.menu.uploadmethod.picotool.upload.tool.default=picotool
adafruit_metro.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
adafruit_metro.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
adafruit_metro.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_metro.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
adafruit_metro.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
adafruit_metro.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
adafruit_metro.menu.uploadmethod.picodebug=Pico-Debug
adafruit_metro.menu.uploadmethod.picodebug.build.ram_length=240k
adafruit_metro.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
adafruit_metro.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
adafruit_metro.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
adafruit_metro.menu.uploadmethod.picodebug.upload.tool=picodebug
adafruit_metro.menu.uploadmethod.picodebug.upload.tool.default=picodebug

