earlephilhower/arduino-pico/boards.txt
bridgetek_idm2040-7a.menu.dbgport.Serial2=Serial2
bridgetek_idm2040-7a.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
bridgetek_idm2040-7a.menu.dbglvl.None=None
bridgetek_idm2040-7a.menu.dbglvl.None.build.debug_level=
bridgetek_idm2040-7a.menu.dbglvl.Core=Core
bridgetek_idm2040-7a.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
bridgetek_idm2040-7a.menu.dbglvl.SPI=SPI
bridgetek_idm2040-7a.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
bridgetek_idm2040-7a.menu.dbglvl.Wire=Wire
bridgetek_idm2040-7a.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
bridgetek_idm2040-7a.menu.dbglvl.Bluetooth=Bluetooth
bridgetek_idm2040-7a.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
bridgetek_idm2040-7a.menu.dbglvl.All=All
bridgetek_idm2040-7a.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
bridgetek_idm2040-7a.menu.dbglvl.NDEBUG=NDEBUG
bridgetek_idm2040-7a.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
bridgetek_idm2040-7a.menu.usbstack.picosdk=Pico SDK
bridgetek_idm2040-7a.menu.usbstack.picosdk.build.usbstack_flags=
bridgetek_idm2040-7a.menu.usbstack.tinyusb=Adafruit TinyUSB
bridgetek_idm2040-7a.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
bridgetek_idm2040-7a.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
bridgetek_idm2040-7a.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
bridgetek_idm2040-7a.menu.usbstack.nousb=No USB
bridgetek_idm2040-7a.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
bridgetek_idm2040-7a.menu.ipbtstack.ipv4only=IPv4 Only
bridgetek_idm2040-7a.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
bridgetek_idm2040-7a.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
bridgetek_idm2040-7a.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
bridgetek_idm2040-7a.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
bridgetek_idm2040-7a.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
bridgetek_idm2040-7a.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
bridgetek_idm2040-7a.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
bridgetek_idm2040-7a.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
bridgetek_idm2040-7a.menu.uploadmethod.default=Default (UF2)
bridgetek_idm2040-7a.menu.uploadmethod.default.build.ram_length=256k
bridgetek_idm2040-7a.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
bridgetek_idm2040-7a.menu.uploadmethod.default.upload.maximum_data_size=262144
bridgetek_idm2040-7a.menu.uploadmethod.default.upload.tool=uf2conv
bridgetek_idm2040-7a.menu.uploadmethod.default.upload.tool.default=uf2conv
bridgetek_idm2040-7a.menu.uploadmethod.default.upload.tool.network=uf2conv-network
bridgetek_idm2040-7a.menu.uploadmethod.picotool=Picotool
bridgetek_idm2040-7a.menu.uploadmethod.picotool.build.ram_length=256k
bridgetek_idm2040-7a.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
bridgetek_idm2040-7a.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
bridgetek_idm2040-7a.menu.uploadmethod.picotool.upload.maximum_data_size=262144
bridgetek_idm2040-7a.menu.uploadmethod.picotool.upload.tool=picotool
bridgetek_idm2040-7a.menu.uploadmethod.picotool.upload.tool.default=picotool
bridgetek_idm2040-7a.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
bridgetek_idm2040-7a.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
bridgetek_idm2040-7a.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
bridgetek_idm2040-7a.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
bridgetek_idm2040-7a.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
bridgetek_idm2040-7a.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
bridgetek_idm2040-7a.menu.uploadmethod.picodebug=Pico-Debug
bridgetek_idm2040-7a.menu.uploadmethod.picodebug.build.ram_length=240k
bridgetek_idm2040-7a.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
bridgetek_idm2040-7a.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
bridgetek_idm2040-7a.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
bridgetek_idm2040-7a.menu.uploadmethod.picodebug.upload.tool=picodebug
bridgetek_idm2040-7a.menu.uploadmethod.picodebug.upload.tool.default=picodebug

