earlephilhower/arduino-pico/boards.txt
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
degz_suibo.menu.uploadmethod.picodebug=Pico-Debug
degz_suibo.menu.uploadmethod.picodebug.build.ram_length=240k
degz_suibo.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
degz_suibo.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
degz_suibo.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
degz_suibo.menu.uploadmethod.picodebug.upload.tool=picodebug
degz_suibo.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# DeRuiLab FlyBoard2040Core
# -----------------------------------
flyboard2040_core.name=DeRuiLab FlyBoard2040Core
flyboard2040_core.vid.0=0x2e8a
flyboard2040_core.pid.0=0x008a
flyboard2040_core.vid.1=0x2e8a
flyboard2040_core.pid.1=0x018a
flyboard2040_core.vid.2=0x2e8a
flyboard2040_core.pid.2=0x408a
flyboard2040_core.vid.3=0x2e8a
flyboard2040_core.pid.3=0x418a
flyboard2040_core.vid.4=0x2e8a
flyboard2040_core.pid.4=0x808a
flyboard2040_core.vid.5=0x2e8a
flyboard2040_core.pid.5=0x818a
flyboard2040_core.vid.6=0x2e8a
flyboard2040_core.pid.6=0xc08a
flyboard2040_core.vid.7=0x2e8a
flyboard2040_core.pid.7=0xc18a
flyboard2040_core.upload_port.0.vid=0x2e8a
flyboard2040_core.upload_port.0.pid=0x008a
flyboard2040_core.upload_port.1.vid=0x2e8a
flyboard2040_core.upload_port.1.pid=0x018a
flyboard2040_core.upload_port.2.vid=0x2e8a
flyboard2040_core.upload_port.2.pid=0x408a
flyboard2040_core.upload_port.3.vid=0x2e8a
flyboard2040_core.upload_port.3.pid=0x418a
flyboard2040_core.upload_port.4.vid=0x2e8a
flyboard2040_core.upload_port.4.pid=0x808a
flyboard2040_core.upload_port.5.vid=0x2e8a
flyboard2040_core.upload_port.5.pid=0x818a
flyboard2040_core.upload_port.6.vid=0x2e8a
flyboard2040_core.upload_port.6.pid=0xc08a
flyboard2040_core.upload_port.7.vid=0x2e8a
flyboard2040_core.upload_port.7.pid=0xc18a
flyboard2040_core.build.usbvid=-DUSBD_VID=0x2e8a
flyboard2040_core.build.usbpid=-DUSBD_PID=0x008a
flyboard2040_core.build.usbpwr=-DUSBD_MAX_POWER_MA=500
flyboard2040_core.build.board=FLYBOARD2040_CORE
flyboard2040_core.build.mcu=cortex-m0plus
flyboard2040_core.build.variant=flyboard2040_core
flyboard2040_core.upload.maximum_size=4194304
flyboard2040_core.upload.wait_for_upload_port=true
flyboard2040_core.upload.erase_cmd=
flyboard2040_core.serial.disableDTR=false
flyboard2040_core.serial.disableRTS=false
flyboard2040_core.build.f_cpu=125000000
flyboard2040_core.build.led=
flyboard2040_core.build.core=rp2040
flyboard2040_core.build.ldscript=memmap_default.ld
flyboard2040_core.build.boot2=boot2_w25q080_2_padded_checksum
flyboard2040_core.build.usb_manufacturer="DeRuiLab"
flyboard2040_core.build.usb_product="FlyBoard2040Core"
flyboard2040_core.menu.flash.4194304_0=4MB (no FS)
flyboard2040_core.menu.flash.4194304_0.upload.maximum_size=4190208
flyboard2040_core.menu.flash.4194304_0.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_0.build.flash_length=4190208
flyboard2040_core.menu.flash.4194304_0.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_0.build.fs_start=272625664
flyboard2040_core.menu.flash.4194304_0.build.fs_end=272625664
flyboard2040_core.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
flyboard2040_core.menu.flash.4194304_65536.upload.maximum_size=4124672
flyboard2040_core.menu.flash.4194304_65536.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_65536.build.flash_length=4124672
flyboard2040_core.menu.flash.4194304_65536.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_65536.build.fs_start=272560128
flyboard2040_core.menu.flash.4194304_65536.build.fs_end=272625664
flyboard2040_core.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
flyboard2040_core.menu.flash.4194304_131072.upload.maximum_size=4059136
flyboard2040_core.menu.flash.4194304_131072.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_131072.build.flash_length=4059136
flyboard2040_core.menu.flash.4194304_131072.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_131072.build.fs_start=272494592
flyboard2040_core.menu.flash.4194304_131072.build.fs_end=272625664
flyboard2040_core.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
flyboard2040_core.menu.flash.4194304_262144.upload.maximum_size=3928064
flyboard2040_core.menu.flash.4194304_262144.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_262144.build.flash_length=3928064
flyboard2040_core.menu.flash.4194304_262144.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_262144.build.fs_start=272363520
flyboard2040_core.menu.flash.4194304_262144.build.fs_end=272625664
flyboard2040_core.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
flyboard2040_core.menu.flash.4194304_524288.upload.maximum_size=3665920
flyboard2040_core.menu.flash.4194304_524288.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_524288.build.flash_length=3665920
flyboard2040_core.menu.flash.4194304_524288.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_524288.build.fs_start=272101376
flyboard2040_core.menu.flash.4194304_524288.build.fs_end=272625664
flyboard2040_core.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
flyboard2040_core.menu.flash.4194304_1048576.upload.maximum_size=3141632
flyboard2040_core.menu.flash.4194304_1048576.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_1048576.build.flash_length=3141632
flyboard2040_core.menu.flash.4194304_1048576.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_1048576.build.fs_start=271577088
flyboard2040_core.menu.flash.4194304_1048576.build.fs_end=272625664
flyboard2040_core.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
flyboard2040_core.menu.flash.4194304_2097152.upload.maximum_size=2093056
flyboard2040_core.menu.flash.4194304_2097152.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_2097152.build.flash_length=2093056
flyboard2040_core.menu.flash.4194304_2097152.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_2097152.build.fs_start=270528512
flyboard2040_core.menu.flash.4194304_2097152.build.fs_end=272625664
flyboard2040_core.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
flyboard2040_core.menu.flash.4194304_3145728.upload.maximum_size=1044480
flyboard2040_core.menu.flash.4194304_3145728.build.flash_total=4194304
flyboard2040_core.menu.flash.4194304_3145728.build.flash_length=1044480
flyboard2040_core.menu.flash.4194304_3145728.build.eeprom_start=272625664
flyboard2040_core.menu.flash.4194304_3145728.build.fs_start=269479936
flyboard2040_core.menu.flash.4194304_3145728.build.fs_end=272625664
flyboard2040_core.menu.freq.133=133 MHz
flyboard2040_core.menu.freq.133.build.f_cpu=133000000L
flyboard2040_core.menu.freq.50=50 MHz
flyboard2040_core.menu.freq.50.build.f_cpu=50000000L
flyboard2040_core.menu.freq.100=100 MHz
flyboard2040_core.menu.freq.100.build.f_cpu=100000000L
flyboard2040_core.menu.freq.120=120 MHz
flyboard2040_core.menu.freq.120.build.f_cpu=120000000L
flyboard2040_core.menu.freq.125=125 MHz
flyboard2040_core.menu.freq.125.build.f_cpu=125000000L
flyboard2040_core.menu.freq.128=128 MHz
flyboard2040_core.menu.freq.128.build.f_cpu=128000000L
flyboard2040_core.menu.freq.150=150 MHz (Overclock)
flyboard2040_core.menu.freq.150.build.f_cpu=150000000L
flyboard2040_core.menu.freq.175=175 MHz (Overclock)
flyboard2040_core.menu.freq.175.build.f_cpu=175000000L
flyboard2040_core.menu.freq.200=200 MHz (Overclock)
flyboard2040_core.menu.freq.200.build.f_cpu=200000000L
flyboard2040_core.menu.freq.225=225 MHz (Overclock)
flyboard2040_core.menu.freq.225.build.f_cpu=225000000L
flyboard2040_core.menu.freq.240=240 MHz (Overclock)
flyboard2040_core.menu.freq.240.build.f_cpu=240000000L
flyboard2040_core.menu.freq.250=250 MHz (Overclock)
flyboard2040_core.menu.freq.250.build.f_cpu=250000000L
flyboard2040_core.menu.freq.275=275 MHz (Overclock)
flyboard2040_core.menu.freq.275.build.f_cpu=275000000L
flyboard2040_core.menu.freq.300=300 MHz (Overclock)
flyboard2040_core.menu.freq.300.build.f_cpu=300000000L
flyboard2040_core.menu.opt.Small=Small (-Os) (standard)
flyboard2040_core.menu.opt.Small.build.flags.optimize=-Os
flyboard2040_core.menu.opt.Optimize=Optimize (-O)
flyboard2040_core.menu.opt.Optimize.build.flags.optimize=-O
flyboard2040_core.menu.opt.Optimize2=Optimize More (-O2)
flyboard2040_core.menu.opt.Optimize2.build.flags.optimize=-O2
flyboard2040_core.menu.opt.Optimize3=Optimize Even More (-O3)
flyboard2040_core.menu.opt.Optimize3.build.flags.optimize=-O3
flyboard2040_core.menu.opt.Fast=Fast (-Ofast) (maybe slower)
flyboard2040_core.menu.opt.Fast.build.flags.optimize=-Ofast
flyboard2040_core.menu.opt.Debug=Debug (-Og)
flyboard2040_core.menu.opt.Debug.build.flags.optimize=-Og
flyboard2040_core.menu.rtti.Disabled=Disabled
flyboard2040_core.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
flyboard2040_core.menu.rtti.Enabled=Enabled
flyboard2040_core.menu.rtti.Enabled.build.flags.rtti=
flyboard2040_core.menu.stackprotect.Disabled=Disabled
flyboard2040_core.menu.stackprotect.Disabled.build.flags.stackprotect=
flyboard2040_core.menu.stackprotect.Enabled=Enabled
flyboard2040_core.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
flyboard2040_core.menu.exceptions.Disabled=Disabled
flyboard2040_core.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
flyboard2040_core.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
flyboard2040_core.menu.exceptions.Enabled=Enabled
flyboard2040_core.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
flyboard2040_core.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
flyboard2040_core.menu.dbgport.Disabled=Disabled
flyboard2040_core.menu.dbgport.Disabled.build.debug_port=
flyboard2040_core.menu.dbgport.Serial=Serial
flyboard2040_core.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
flyboard2040_core.menu.dbgport.Serial1=Serial1
flyboard2040_core.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
flyboard2040_core.menu.dbgport.Serial2=Serial2
flyboard2040_core.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
flyboard2040_core.menu.dbglvl.None=None
flyboard2040_core.menu.dbglvl.None.build.debug_level=
flyboard2040_core.menu.dbglvl.Core=Core
flyboard2040_core.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
flyboard2040_core.menu.dbglvl.SPI=SPI
flyboard2040_core.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
flyboard2040_core.menu.dbglvl.Wire=Wire
flyboard2040_core.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
flyboard2040_core.menu.dbglvl.Bluetooth=Bluetooth
flyboard2040_core.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
flyboard2040_core.menu.dbglvl.All=All
flyboard2040_core.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
flyboard2040_core.menu.dbglvl.NDEBUG=NDEBUG
flyboard2040_core.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
flyboard2040_core.menu.usbstack.picosdk=Pico SDK
flyboard2040_core.menu.usbstack.picosdk.build.usbstack_flags=
flyboard2040_core.menu.usbstack.tinyusb=Adafruit TinyUSB
flyboard2040_core.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
flyboard2040_core.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
flyboard2040_core.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
flyboard2040_core.menu.usbstack.nousb=No USB
flyboard2040_core.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
flyboard2040_core.menu.ipbtstack.ipv4only=IPv4 Only
flyboard2040_core.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
flyboard2040_core.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
flyboard2040_core.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
flyboard2040_core.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
flyboard2040_core.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
flyboard2040_core.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
flyboard2040_core.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
flyboard2040_core.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
flyboard2040_core.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
flyboard2040_core.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
flyboard2040_core.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
flyboard2040_core.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
flyboard2040_core.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
flyboard2040_core.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
flyboard2040_core.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
flyboard2040_core.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
flyboard2040_core.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
flyboard2040_core.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
flyboard2040_core.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
flyboard2040_core.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
flyboard2040_core.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
flyboard2040_core.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
flyboard2040_core.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
flyboard2040_core.menu.uploadmethod.default=Default (UF2)
flyboard2040_core.menu.uploadmethod.default.build.ram_length=256k
flyboard2040_core.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
flyboard2040_core.menu.uploadmethod.default.upload.maximum_data_size=262144
flyboard2040_core.menu.uploadmethod.default.upload.tool=uf2conv
flyboard2040_core.menu.uploadmethod.default.upload.tool.default=uf2conv
flyboard2040_core.menu.uploadmethod.default.upload.tool.network=uf2conv-network
flyboard2040_core.menu.uploadmethod.picotool=Picotool
flyboard2040_core.menu.uploadmethod.picotool.build.ram_length=256k
flyboard2040_core.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
flyboard2040_core.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
flyboard2040_core.menu.uploadmethod.picotool.upload.maximum_data_size=262144
flyboard2040_core.menu.uploadmethod.picotool.upload.tool=picotool
flyboard2040_core.menu.uploadmethod.picotool.upload.tool.default=picotool
flyboard2040_core.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
flyboard2040_core.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
flyboard2040_core.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
flyboard2040_core.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
flyboard2040_core.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
flyboard2040_core.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
flyboard2040_core.menu.uploadmethod.picodebug=Pico-Debug
flyboard2040_core.menu.uploadmethod.picodebug.build.ram_length=240k
flyboard2040_core.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
flyboard2040_core.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
flyboard2040_core.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
flyboard2040_core.menu.uploadmethod.picodebug.upload.tool=picodebug
flyboard2040_core.menu.uploadmethod.picodebug.upload.tool.default=picodebug

