earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# ElectronicCats HunterCat NFC RP2040
# -----------------------------------
electroniccats_huntercat_nfc.name=ElectronicCats HunterCat NFC RP2040
electroniccats_huntercat_nfc.vid.0=0x2E8A
electroniccats_huntercat_nfc.pid.0=0x1037
electroniccats_huntercat_nfc.vid.1=0x2E8A
electroniccats_huntercat_nfc.pid.1=0x1137
electroniccats_huntercat_nfc.vid.2=0x2E8A
electroniccats_huntercat_nfc.pid.2=0x5037
electroniccats_huntercat_nfc.vid.3=0x2E8A
electroniccats_huntercat_nfc.pid.3=0x5137
electroniccats_huntercat_nfc.vid.4=0x2E8A
electroniccats_huntercat_nfc.pid.4=0x9037
electroniccats_huntercat_nfc.vid.5=0x2E8A
electroniccats_huntercat_nfc.pid.5=0x9137
electroniccats_huntercat_nfc.vid.6=0x2E8A
electroniccats_huntercat_nfc.pid.6=0xd037
electroniccats_huntercat_nfc.vid.7=0x2E8A
electroniccats_huntercat_nfc.pid.7=0xd137
electroniccats_huntercat_nfc.upload_port.0.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.0.pid=0x1037
electroniccats_huntercat_nfc.upload_port.1.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.1.pid=0x1137
electroniccats_huntercat_nfc.upload_port.2.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.2.pid=0x5037
electroniccats_huntercat_nfc.upload_port.3.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.3.pid=0x5137
electroniccats_huntercat_nfc.upload_port.4.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.4.pid=0x9037
electroniccats_huntercat_nfc.upload_port.5.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.5.pid=0x9137
electroniccats_huntercat_nfc.upload_port.6.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.6.pid=0xd037
electroniccats_huntercat_nfc.upload_port.7.vid=0x2E8A
electroniccats_huntercat_nfc.upload_port.7.pid=0xd137
electroniccats_huntercat_nfc.build.usbvid=-DUSBD_VID=0x2E8A
electroniccats_huntercat_nfc.build.usbpid=-DUSBD_PID=0x1037
electroniccats_huntercat_nfc.build.usbpwr=-DUSBD_MAX_POWER_MA=500
electroniccats_huntercat_nfc.build.board=ELECTRONICCATS_HUNTERCAT_NFC
electroniccats_huntercat_nfc.build.mcu=cortex-m0plus
electroniccats_huntercat_nfc.build.variant=electroniccats_huntercat_nfc
electroniccats_huntercat_nfc.upload.maximum_size=2097152
electroniccats_huntercat_nfc.upload.wait_for_upload_port=true
electroniccats_huntercat_nfc.upload.erase_cmd=
electroniccats_huntercat_nfc.serial.disableDTR=false
electroniccats_huntercat_nfc.serial.disableRTS=false
electroniccats_huntercat_nfc.build.f_cpu=125000000
electroniccats_huntercat_nfc.build.led=
electroniccats_huntercat_nfc.build.core=rp2040
electroniccats_huntercat_nfc.build.ldscript=memmap_default.ld
electroniccats_huntercat_nfc.build.boot2=boot2_w25q080_2_padded_checksum
electroniccats_huntercat_nfc.build.usb_manufacturer="ElectronicCats"
electroniccats_huntercat_nfc.build.usb_product="HunterCat NFC RP2040"
electroniccats_huntercat_nfc.menu.flash.2097152_0=2MB (no FS)
electroniccats_huntercat_nfc.menu.flash.2097152_0.upload.maximum_size=2093056
electroniccats_huntercat_nfc.menu.flash.2097152_0.build.flash_total=2097152
electroniccats_huntercat_nfc.menu.flash.2097152_0.build.flash_length=2093056
electroniccats_huntercat_nfc.menu.flash.2097152_0.build.eeprom_start=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_0.build.fs_start=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_0.build.fs_end=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
electroniccats_huntercat_nfc.menu.flash.2097152_65536.upload.maximum_size=2027520
electroniccats_huntercat_nfc.menu.flash.2097152_65536.build.flash_total=2097152
electroniccats_huntercat_nfc.menu.flash.2097152_65536.build.flash_length=2027520
electroniccats_huntercat_nfc.menu.flash.2097152_65536.build.eeprom_start=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_65536.build.fs_start=270462976
electroniccats_huntercat_nfc.menu.flash.2097152_65536.build.fs_end=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
electroniccats_huntercat_nfc.menu.flash.2097152_131072.upload.maximum_size=1961984
electroniccats_huntercat_nfc.menu.flash.2097152_131072.build.flash_total=2097152
electroniccats_huntercat_nfc.menu.flash.2097152_131072.build.flash_length=1961984
electroniccats_huntercat_nfc.menu.flash.2097152_131072.build.eeprom_start=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_131072.build.fs_start=270397440
electroniccats_huntercat_nfc.menu.flash.2097152_131072.build.fs_end=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
electroniccats_huntercat_nfc.menu.flash.2097152_262144.upload.maximum_size=1830912
electroniccats_huntercat_nfc.menu.flash.2097152_262144.build.flash_total=2097152
electroniccats_huntercat_nfc.menu.flash.2097152_262144.build.flash_length=1830912
electroniccats_huntercat_nfc.menu.flash.2097152_262144.build.eeprom_start=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_262144.build.fs_start=270266368
electroniccats_huntercat_nfc.menu.flash.2097152_262144.build.fs_end=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
electroniccats_huntercat_nfc.menu.flash.2097152_524288.upload.maximum_size=1568768
electroniccats_huntercat_nfc.menu.flash.2097152_524288.build.flash_total=2097152
electroniccats_huntercat_nfc.menu.flash.2097152_524288.build.flash_length=1568768
electroniccats_huntercat_nfc.menu.flash.2097152_524288.build.eeprom_start=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_524288.build.fs_start=270004224
electroniccats_huntercat_nfc.menu.flash.2097152_524288.build.fs_end=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
electroniccats_huntercat_nfc.menu.flash.2097152_1048576.upload.maximum_size=1044480
electroniccats_huntercat_nfc.menu.flash.2097152_1048576.build.flash_total=2097152
electroniccats_huntercat_nfc.menu.flash.2097152_1048576.build.flash_length=1044480
electroniccats_huntercat_nfc.menu.flash.2097152_1048576.build.eeprom_start=270528512
electroniccats_huntercat_nfc.menu.flash.2097152_1048576.build.fs_start=269479936
electroniccats_huntercat_nfc.menu.flash.2097152_1048576.build.fs_end=270528512
electroniccats_huntercat_nfc.menu.freq.133=133 MHz
electroniccats_huntercat_nfc.menu.freq.133.build.f_cpu=133000000L
electroniccats_huntercat_nfc.menu.freq.50=50 MHz
electroniccats_huntercat_nfc.menu.freq.50.build.f_cpu=50000000L
electroniccats_huntercat_nfc.menu.freq.100=100 MHz
electroniccats_huntercat_nfc.menu.freq.100.build.f_cpu=100000000L
electroniccats_huntercat_nfc.menu.freq.120=120 MHz
electroniccats_huntercat_nfc.menu.freq.120.build.f_cpu=120000000L
electroniccats_huntercat_nfc.menu.freq.125=125 MHz
electroniccats_huntercat_nfc.menu.freq.125.build.f_cpu=125000000L
electroniccats_huntercat_nfc.menu.freq.128=128 MHz
electroniccats_huntercat_nfc.menu.freq.128.build.f_cpu=128000000L
electroniccats_huntercat_nfc.menu.freq.150=150 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.150.build.f_cpu=150000000L
electroniccats_huntercat_nfc.menu.freq.175=175 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.175.build.f_cpu=175000000L
electroniccats_huntercat_nfc.menu.freq.200=200 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.200.build.f_cpu=200000000L
electroniccats_huntercat_nfc.menu.freq.225=225 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.225.build.f_cpu=225000000L
electroniccats_huntercat_nfc.menu.freq.240=240 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.240.build.f_cpu=240000000L
electroniccats_huntercat_nfc.menu.freq.250=250 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.250.build.f_cpu=250000000L
electroniccats_huntercat_nfc.menu.freq.275=275 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.275.build.f_cpu=275000000L
electroniccats_huntercat_nfc.menu.freq.300=300 MHz (Overclock)
electroniccats_huntercat_nfc.menu.freq.300.build.f_cpu=300000000L
electroniccats_huntercat_nfc.menu.opt.Small=Small (-Os) (standard)
electroniccats_huntercat_nfc.menu.opt.Small.build.flags.optimize=-Os
electroniccats_huntercat_nfc.menu.opt.Optimize=Optimize (-O)
electroniccats_huntercat_nfc.menu.opt.Optimize.build.flags.optimize=-O
electroniccats_huntercat_nfc.menu.opt.Optimize2=Optimize More (-O2)
electroniccats_huntercat_nfc.menu.opt.Optimize2.build.flags.optimize=-O2
electroniccats_huntercat_nfc.menu.opt.Optimize3=Optimize Even More (-O3)
electroniccats_huntercat_nfc.menu.opt.Optimize3.build.flags.optimize=-O3
electroniccats_huntercat_nfc.menu.opt.Fast=Fast (-Ofast) (maybe slower)
electroniccats_huntercat_nfc.menu.opt.Fast.build.flags.optimize=-Ofast
electroniccats_huntercat_nfc.menu.opt.Debug=Debug (-Og)
electroniccats_huntercat_nfc.menu.opt.Debug.build.flags.optimize=-Og
electroniccats_huntercat_nfc.menu.rtti.Disabled=Disabled
electroniccats_huntercat_nfc.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
electroniccats_huntercat_nfc.menu.rtti.Enabled=Enabled
electroniccats_huntercat_nfc.menu.rtti.Enabled.build.flags.rtti=
electroniccats_huntercat_nfc.menu.stackprotect.Disabled=Disabled
electroniccats_huntercat_nfc.menu.stackprotect.Disabled.build.flags.stackprotect=
electroniccats_huntercat_nfc.menu.stackprotect.Enabled=Enabled
electroniccats_huntercat_nfc.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
electroniccats_huntercat_nfc.menu.exceptions.Disabled=Disabled
electroniccats_huntercat_nfc.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
electroniccats_huntercat_nfc.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
electroniccats_huntercat_nfc.menu.exceptions.Enabled=Enabled
electroniccats_huntercat_nfc.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
electroniccats_huntercat_nfc.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
electroniccats_huntercat_nfc.menu.dbgport.Disabled=Disabled
electroniccats_huntercat_nfc.menu.dbgport.Disabled.build.debug_port=
electroniccats_huntercat_nfc.menu.dbgport.Serial=Serial
electroniccats_huntercat_nfc.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
electroniccats_huntercat_nfc.menu.dbgport.Serial1=Serial1
electroniccats_huntercat_nfc.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
electroniccats_huntercat_nfc.menu.dbgport.Serial2=Serial2
electroniccats_huntercat_nfc.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
electroniccats_huntercat_nfc.menu.dbglvl.None=None
electroniccats_huntercat_nfc.menu.dbglvl.None.build.debug_level=
electroniccats_huntercat_nfc.menu.dbglvl.Core=Core
electroniccats_huntercat_nfc.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
electroniccats_huntercat_nfc.menu.dbglvl.SPI=SPI
electroniccats_huntercat_nfc.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
electroniccats_huntercat_nfc.menu.dbglvl.Wire=Wire
electroniccats_huntercat_nfc.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
electroniccats_huntercat_nfc.menu.dbglvl.Bluetooth=Bluetooth
electroniccats_huntercat_nfc.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
electroniccats_huntercat_nfc.menu.dbglvl.All=All
electroniccats_huntercat_nfc.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
electroniccats_huntercat_nfc.menu.dbglvl.NDEBUG=NDEBUG
electroniccats_huntercat_nfc.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
electroniccats_huntercat_nfc.menu.usbstack.picosdk=Pico SDK
electroniccats_huntercat_nfc.menu.usbstack.picosdk.build.usbstack_flags=
electroniccats_huntercat_nfc.menu.usbstack.tinyusb=Adafruit TinyUSB
electroniccats_huntercat_nfc.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
electroniccats_huntercat_nfc.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
electroniccats_huntercat_nfc.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
electroniccats_huntercat_nfc.menu.usbstack.nousb=No USB
electroniccats_huntercat_nfc.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4only=IPv4 Only
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
electroniccats_huntercat_nfc.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
electroniccats_huntercat_nfc.menu.uploadmethod.default=Default (UF2)
electroniccats_huntercat_nfc.menu.uploadmethod.default.build.ram_length=256k
electroniccats_huntercat_nfc.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
electroniccats_huntercat_nfc.menu.uploadmethod.default.upload.maximum_data_size=262144
electroniccats_huntercat_nfc.menu.uploadmethod.default.upload.tool=uf2conv
electroniccats_huntercat_nfc.menu.uploadmethod.default.upload.tool.default=uf2conv
electroniccats_huntercat_nfc.menu.uploadmethod.default.upload.tool.network=uf2conv-network
electroniccats_huntercat_nfc.menu.uploadmethod.picotool=Picotool
electroniccats_huntercat_nfc.menu.uploadmethod.picotool.build.ram_length=256k
electroniccats_huntercat_nfc.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
electroniccats_huntercat_nfc.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
electroniccats_huntercat_nfc.menu.uploadmethod.picotool.upload.maximum_data_size=262144
electroniccats_huntercat_nfc.menu.uploadmethod.picotool.upload.tool=picotool
electroniccats_huntercat_nfc.menu.uploadmethod.picotool.upload.tool.default=picotool
electroniccats_huntercat_nfc.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
electroniccats_huntercat_nfc.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
electroniccats_huntercat_nfc.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
electroniccats_huntercat_nfc.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
electroniccats_huntercat_nfc.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
electroniccats_huntercat_nfc.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
electroniccats_huntercat_nfc.menu.uploadmethod.picodebug=Pico-Debug
electroniccats_huntercat_nfc.menu.uploadmethod.picodebug.build.ram_length=240k
electroniccats_huntercat_nfc.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
electroniccats_huntercat_nfc.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
electroniccats_huntercat_nfc.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
electroniccats_huntercat_nfc.menu.uploadmethod.picodebug.upload.tool=picodebug
electroniccats_huntercat_nfc.menu.uploadmethod.picodebug.upload.tool.default=picodebug

