earlephilhower/arduino-pico/boards.txt
challenger_2040_wifi6_ble.menu.dbglvl.Core=Core
challenger_2040_wifi6_ble.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
challenger_2040_wifi6_ble.menu.dbglvl.SPI=SPI
challenger_2040_wifi6_ble.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
challenger_2040_wifi6_ble.menu.dbglvl.Wire=Wire
challenger_2040_wifi6_ble.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
challenger_2040_wifi6_ble.menu.dbglvl.Bluetooth=Bluetooth
challenger_2040_wifi6_ble.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
challenger_2040_wifi6_ble.menu.dbglvl.All=All
challenger_2040_wifi6_ble.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
challenger_2040_wifi6_ble.menu.dbglvl.NDEBUG=NDEBUG
challenger_2040_wifi6_ble.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
challenger_2040_wifi6_ble.menu.usbstack.picosdk=Pico SDK
challenger_2040_wifi6_ble.menu.usbstack.picosdk.build.usbstack_flags=
challenger_2040_wifi6_ble.menu.usbstack.tinyusb=Adafruit TinyUSB
challenger_2040_wifi6_ble.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
challenger_2040_wifi6_ble.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
challenger_2040_wifi6_ble.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
challenger_2040_wifi6_ble.menu.usbstack.nousb=No USB
challenger_2040_wifi6_ble.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4only=IPv4 Only
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
challenger_2040_wifi6_ble.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi6_ble.menu.uploadmethod.default=Default (UF2)
challenger_2040_wifi6_ble.menu.uploadmethod.default.build.ram_length=256k
challenger_2040_wifi6_ble.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2040_wifi6_ble.menu.uploadmethod.default.upload.maximum_data_size=262144
challenger_2040_wifi6_ble.menu.uploadmethod.default.upload.tool=uf2conv
challenger_2040_wifi6_ble.menu.uploadmethod.default.upload.tool.default=uf2conv
challenger_2040_wifi6_ble.menu.uploadmethod.default.upload.tool.network=uf2conv-network
challenger_2040_wifi6_ble.menu.uploadmethod.picotool=Picotool
challenger_2040_wifi6_ble.menu.uploadmethod.picotool.build.ram_length=256k
challenger_2040_wifi6_ble.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
challenger_2040_wifi6_ble.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
challenger_2040_wifi6_ble.menu.uploadmethod.picotool.upload.maximum_data_size=262144
challenger_2040_wifi6_ble.menu.uploadmethod.picotool.upload.tool=picotool
challenger_2040_wifi6_ble.menu.uploadmethod.picotool.upload.tool.default=picotool
challenger_2040_wifi6_ble.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
challenger_2040_wifi6_ble.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
challenger_2040_wifi6_ble.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2040_wifi6_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
challenger_2040_wifi6_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
challenger_2040_wifi6_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
challenger_2040_wifi6_ble.menu.uploadmethod.picodebug=Pico-Debug
challenger_2040_wifi6_ble.menu.uploadmethod.picodebug.build.ram_length=240k
challenger_2040_wifi6_ble.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
challenger_2040_wifi6_ble.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
challenger_2040_wifi6_ble.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
challenger_2040_wifi6_ble.menu.uploadmethod.picodebug.upload.tool=picodebug
challenger_2040_wifi6_ble.menu.uploadmethod.picodebug.upload.tool.default=picodebug

