earlephilhower/arduino-pico/boards.txt
challenger_2040_uwb.menu.uploadmethod.default.upload.tool=uf2conv
challenger_2040_uwb.menu.uploadmethod.default.upload.tool.default=uf2conv
challenger_2040_uwb.menu.uploadmethod.default.upload.tool.network=uf2conv-network
challenger_2040_uwb.menu.uploadmethod.picotool=Picotool
challenger_2040_uwb.menu.uploadmethod.picotool.build.ram_length=256k
challenger_2040_uwb.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
challenger_2040_uwb.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
challenger_2040_uwb.menu.uploadmethod.picotool.upload.maximum_data_size=262144
challenger_2040_uwb.menu.uploadmethod.picotool.upload.tool=picotool
challenger_2040_uwb.menu.uploadmethod.picotool.upload.tool.default=picotool
challenger_2040_uwb.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
challenger_2040_uwb.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
challenger_2040_uwb.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2040_uwb.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
challenger_2040_uwb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
challenger_2040_uwb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
challenger_2040_uwb.menu.uploadmethod.picodebug=Pico-Debug
challenger_2040_uwb.menu.uploadmethod.picodebug.build.ram_length=240k
challenger_2040_uwb.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
challenger_2040_uwb.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
challenger_2040_uwb.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
challenger_2040_uwb.menu.uploadmethod.picodebug.upload.tool=picodebug
challenger_2040_uwb.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# iLabs Connectivity 2040 LTE/WiFi/BLE
# -----------------------------------
connectivity_2040_lte_wifi_ble.name=iLabs Connectivity 2040 LTE/WiFi/BLE
connectivity_2040_lte_wifi_ble.vid.0=0x2e8a
connectivity_2040_lte_wifi_ble.pid.0=0x107b
connectivity_2040_lte_wifi_ble.vid.1=0x2e8a
connectivity_2040_lte_wifi_ble.pid.1=0x117b
connectivity_2040_lte_wifi_ble.vid.2=0x2e8a
connectivity_2040_lte_wifi_ble.pid.2=0x507b
connectivity_2040_lte_wifi_ble.vid.3=0x2e8a
connectivity_2040_lte_wifi_ble.pid.3=0x517b
connectivity_2040_lte_wifi_ble.vid.4=0x2e8a
connectivity_2040_lte_wifi_ble.pid.4=0x907b
connectivity_2040_lte_wifi_ble.vid.5=0x2e8a
connectivity_2040_lte_wifi_ble.pid.5=0x917b
connectivity_2040_lte_wifi_ble.vid.6=0x2e8a
connectivity_2040_lte_wifi_ble.pid.6=0xd07b
connectivity_2040_lte_wifi_ble.vid.7=0x2e8a
connectivity_2040_lte_wifi_ble.pid.7=0xd17b
connectivity_2040_lte_wifi_ble.upload_port.0.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.0.pid=0x107b
connectivity_2040_lte_wifi_ble.upload_port.1.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.1.pid=0x117b
connectivity_2040_lte_wifi_ble.upload_port.2.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.2.pid=0x507b
connectivity_2040_lte_wifi_ble.upload_port.3.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.3.pid=0x517b
connectivity_2040_lte_wifi_ble.upload_port.4.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.4.pid=0x907b
connectivity_2040_lte_wifi_ble.upload_port.5.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.5.pid=0x917b
connectivity_2040_lte_wifi_ble.upload_port.6.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.6.pid=0xd07b
connectivity_2040_lte_wifi_ble.upload_port.7.vid=0x2e8a
connectivity_2040_lte_wifi_ble.upload_port.7.pid=0xd17b
connectivity_2040_lte_wifi_ble.build.usbvid=-DUSBD_VID=0x2e8a
connectivity_2040_lte_wifi_ble.build.usbpid=-DUSBD_PID=0x107b
connectivity_2040_lte_wifi_ble.build.usbpwr=-DUSBD_MAX_POWER_MA=500
connectivity_2040_lte_wifi_ble.build.board=CONNECTIVITY_2040_LTE_WIFI_BLE_RP2040
connectivity_2040_lte_wifi_ble.build.mcu=cortex-m0plus
connectivity_2040_lte_wifi_ble.build.variant=connectivity_2040_lte_wifi_ble
connectivity_2040_lte_wifi_ble.upload.maximum_size=8388608
connectivity_2040_lte_wifi_ble.upload.wait_for_upload_port=true
connectivity_2040_lte_wifi_ble.upload.erase_cmd=
connectivity_2040_lte_wifi_ble.serial.disableDTR=false
connectivity_2040_lte_wifi_ble.serial.disableRTS=false
connectivity_2040_lte_wifi_ble.build.f_cpu=125000000
connectivity_2040_lte_wifi_ble.build.led=
connectivity_2040_lte_wifi_ble.build.core=rp2040
connectivity_2040_lte_wifi_ble.build.ldscript=memmap_default.ld
connectivity_2040_lte_wifi_ble.build.boot2=boot2_w25q080_2_padded_checksum
connectivity_2040_lte_wifi_ble.build.usb_manufacturer="iLabs"
connectivity_2040_lte_wifi_ble.build.usb_product="Connectivity 2040 LTE/WiFi/BLE"
connectivity_2040_lte_wifi_ble.build.extra_flags=-DWIFIESPAT2
connectivity_2040_lte_wifi_ble.menu.flash.8388608_0=8MB (no FS)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_0.upload.maximum_size=8384512
connectivity_2040_lte_wifi_ble.menu.flash.8388608_0.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_0.build.flash_length=8384512
connectivity_2040_lte_wifi_ble.menu.flash.8388608_0.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_0.build.fs_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_0.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_65536.upload.maximum_size=8318976
connectivity_2040_lte_wifi_ble.menu.flash.8388608_65536.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_65536.build.flash_length=8318976
connectivity_2040_lte_wifi_ble.menu.flash.8388608_65536.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_65536.build.fs_start=276754432
connectivity_2040_lte_wifi_ble.menu.flash.8388608_65536.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_131072.upload.maximum_size=8253440
connectivity_2040_lte_wifi_ble.menu.flash.8388608_131072.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_131072.build.flash_length=8253440
connectivity_2040_lte_wifi_ble.menu.flash.8388608_131072.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_131072.build.fs_start=276688896
connectivity_2040_lte_wifi_ble.menu.flash.8388608_131072.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_262144.upload.maximum_size=8122368
connectivity_2040_lte_wifi_ble.menu.flash.8388608_262144.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_262144.build.flash_length=8122368
connectivity_2040_lte_wifi_ble.menu.flash.8388608_262144.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_262144.build.fs_start=276557824
connectivity_2040_lte_wifi_ble.menu.flash.8388608_262144.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_524288.upload.maximum_size=7860224
connectivity_2040_lte_wifi_ble.menu.flash.8388608_524288.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_524288.build.flash_length=7860224
connectivity_2040_lte_wifi_ble.menu.flash.8388608_524288.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_524288.build.fs_start=276295680
connectivity_2040_lte_wifi_ble.menu.flash.8388608_524288.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_1048576.upload.maximum_size=7335936
connectivity_2040_lte_wifi_ble.menu.flash.8388608_1048576.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_1048576.build.flash_length=7335936
connectivity_2040_lte_wifi_ble.menu.flash.8388608_1048576.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_1048576.build.fs_start=275771392
connectivity_2040_lte_wifi_ble.menu.flash.8388608_1048576.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_2097152.upload.maximum_size=6287360
connectivity_2040_lte_wifi_ble.menu.flash.8388608_2097152.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_2097152.build.flash_length=6287360
connectivity_2040_lte_wifi_ble.menu.flash.8388608_2097152.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_2097152.build.fs_start=274722816
connectivity_2040_lte_wifi_ble.menu.flash.8388608_2097152.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_3145728.upload.maximum_size=5238784
connectivity_2040_lte_wifi_ble.menu.flash.8388608_3145728.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_3145728.build.flash_length=5238784
connectivity_2040_lte_wifi_ble.menu.flash.8388608_3145728.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_3145728.build.fs_start=273674240
connectivity_2040_lte_wifi_ble.menu.flash.8388608_3145728.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_4194304.upload.maximum_size=4190208
connectivity_2040_lte_wifi_ble.menu.flash.8388608_4194304.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_4194304.build.flash_length=4190208
connectivity_2040_lte_wifi_ble.menu.flash.8388608_4194304.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_4194304.build.fs_start=272625664
connectivity_2040_lte_wifi_ble.menu.flash.8388608_4194304.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_5242880.upload.maximum_size=3141632
connectivity_2040_lte_wifi_ble.menu.flash.8388608_5242880.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_5242880.build.flash_length=3141632
connectivity_2040_lte_wifi_ble.menu.flash.8388608_5242880.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_5242880.build.fs_start=271577088
connectivity_2040_lte_wifi_ble.menu.flash.8388608_5242880.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_6291456.upload.maximum_size=2093056
connectivity_2040_lte_wifi_ble.menu.flash.8388608_6291456.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_6291456.build.flash_length=2093056
connectivity_2040_lte_wifi_ble.menu.flash.8388608_6291456.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_6291456.build.fs_start=270528512
connectivity_2040_lte_wifi_ble.menu.flash.8388608_6291456.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
connectivity_2040_lte_wifi_ble.menu.flash.8388608_7340032.upload.maximum_size=1044480
connectivity_2040_lte_wifi_ble.menu.flash.8388608_7340032.build.flash_total=8388608
connectivity_2040_lte_wifi_ble.menu.flash.8388608_7340032.build.flash_length=1044480
connectivity_2040_lte_wifi_ble.menu.flash.8388608_7340032.build.eeprom_start=276819968
connectivity_2040_lte_wifi_ble.menu.flash.8388608_7340032.build.fs_start=269479936
connectivity_2040_lte_wifi_ble.menu.flash.8388608_7340032.build.fs_end=276819968
connectivity_2040_lte_wifi_ble.menu.freq.133=133 MHz
connectivity_2040_lte_wifi_ble.menu.freq.133.build.f_cpu=133000000L
connectivity_2040_lte_wifi_ble.menu.freq.50=50 MHz
connectivity_2040_lte_wifi_ble.menu.freq.50.build.f_cpu=50000000L
connectivity_2040_lte_wifi_ble.menu.freq.100=100 MHz
connectivity_2040_lte_wifi_ble.menu.freq.100.build.f_cpu=100000000L
connectivity_2040_lte_wifi_ble.menu.freq.120=120 MHz
connectivity_2040_lte_wifi_ble.menu.freq.120.build.f_cpu=120000000L
connectivity_2040_lte_wifi_ble.menu.freq.125=125 MHz
connectivity_2040_lte_wifi_ble.menu.freq.125.build.f_cpu=125000000L
connectivity_2040_lte_wifi_ble.menu.freq.128=128 MHz
connectivity_2040_lte_wifi_ble.menu.freq.128.build.f_cpu=128000000L
connectivity_2040_lte_wifi_ble.menu.freq.150=150 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.150.build.f_cpu=150000000L
connectivity_2040_lte_wifi_ble.menu.freq.175=175 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.175.build.f_cpu=175000000L
connectivity_2040_lte_wifi_ble.menu.freq.200=200 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.200.build.f_cpu=200000000L
connectivity_2040_lte_wifi_ble.menu.freq.225=225 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.225.build.f_cpu=225000000L
connectivity_2040_lte_wifi_ble.menu.freq.240=240 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.240.build.f_cpu=240000000L
connectivity_2040_lte_wifi_ble.menu.freq.250=250 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.250.build.f_cpu=250000000L
connectivity_2040_lte_wifi_ble.menu.freq.275=275 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.275.build.f_cpu=275000000L
connectivity_2040_lte_wifi_ble.menu.freq.300=300 MHz (Overclock)
connectivity_2040_lte_wifi_ble.menu.freq.300.build.f_cpu=300000000L
connectivity_2040_lte_wifi_ble.menu.opt.Small=Small (-Os) (standard)
connectivity_2040_lte_wifi_ble.menu.opt.Small.build.flags.optimize=-Os
connectivity_2040_lte_wifi_ble.menu.opt.Optimize=Optimize (-O)
connectivity_2040_lte_wifi_ble.menu.opt.Optimize.build.flags.optimize=-O
connectivity_2040_lte_wifi_ble.menu.opt.Optimize2=Optimize More (-O2)
connectivity_2040_lte_wifi_ble.menu.opt.Optimize2.build.flags.optimize=-O2
connectivity_2040_lte_wifi_ble.menu.opt.Optimize3=Optimize Even More (-O3)
connectivity_2040_lte_wifi_ble.menu.opt.Optimize3.build.flags.optimize=-O3
connectivity_2040_lte_wifi_ble.menu.opt.Fast=Fast (-Ofast) (maybe slower)
connectivity_2040_lte_wifi_ble.menu.opt.Fast.build.flags.optimize=-Ofast
connectivity_2040_lte_wifi_ble.menu.opt.Debug=Debug (-Og)
connectivity_2040_lte_wifi_ble.menu.opt.Debug.build.flags.optimize=-Og
connectivity_2040_lte_wifi_ble.menu.rtti.Disabled=Disabled
connectivity_2040_lte_wifi_ble.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
connectivity_2040_lte_wifi_ble.menu.rtti.Enabled=Enabled
connectivity_2040_lte_wifi_ble.menu.rtti.Enabled.build.flags.rtti=
connectivity_2040_lte_wifi_ble.menu.stackprotect.Disabled=Disabled
connectivity_2040_lte_wifi_ble.menu.stackprotect.Disabled.build.flags.stackprotect=
connectivity_2040_lte_wifi_ble.menu.stackprotect.Enabled=Enabled
connectivity_2040_lte_wifi_ble.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
connectivity_2040_lte_wifi_ble.menu.exceptions.Disabled=Disabled
connectivity_2040_lte_wifi_ble.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
connectivity_2040_lte_wifi_ble.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
connectivity_2040_lte_wifi_ble.menu.exceptions.Enabled=Enabled
connectivity_2040_lte_wifi_ble.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
connectivity_2040_lte_wifi_ble.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
connectivity_2040_lte_wifi_ble.menu.dbgport.Disabled=Disabled
connectivity_2040_lte_wifi_ble.menu.dbgport.Disabled.build.debug_port=
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial=Serial
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial1=Serial1
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial2=Serial2
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
connectivity_2040_lte_wifi_ble.menu.dbglvl.None=None
connectivity_2040_lte_wifi_ble.menu.dbglvl.None.build.debug_level=
connectivity_2040_lte_wifi_ble.menu.dbglvl.Core=Core
connectivity_2040_lte_wifi_ble.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
connectivity_2040_lte_wifi_ble.menu.dbglvl.SPI=SPI
connectivity_2040_lte_wifi_ble.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
connectivity_2040_lte_wifi_ble.menu.dbglvl.Wire=Wire
connectivity_2040_lte_wifi_ble.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
connectivity_2040_lte_wifi_ble.menu.dbglvl.Bluetooth=Bluetooth
connectivity_2040_lte_wifi_ble.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
connectivity_2040_lte_wifi_ble.menu.dbglvl.All=All
connectivity_2040_lte_wifi_ble.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
connectivity_2040_lte_wifi_ble.menu.dbglvl.NDEBUG=NDEBUG
connectivity_2040_lte_wifi_ble.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
connectivity_2040_lte_wifi_ble.menu.usbstack.picosdk=Pico SDK
connectivity_2040_lte_wifi_ble.menu.usbstack.picosdk.build.usbstack_flags=
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb=Adafruit TinyUSB
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
connectivity_2040_lte_wifi_ble.menu.usbstack.nousb=No USB
