earlephilhower/arduino-pico/boards.txt
melopero_cookie_rp2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
melopero_cookie_rp2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
melopero_cookie_rp2040.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
melopero_cookie_rp2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
melopero_cookie_rp2040.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
melopero_cookie_rp2040.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
melopero_cookie_rp2040.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
melopero_cookie_rp2040.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
melopero_cookie_rp2040.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
melopero_cookie_rp2040.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
melopero_cookie_rp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
melopero_cookie_rp2040.menu.uploadmethod.default=Default (UF2)
melopero_cookie_rp2040.menu.uploadmethod.default.build.ram_length=256k
melopero_cookie_rp2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
melopero_cookie_rp2040.menu.uploadmethod.default.upload.maximum_data_size=262144
melopero_cookie_rp2040.menu.uploadmethod.default.upload.tool=uf2conv
melopero_cookie_rp2040.menu.uploadmethod.default.upload.tool.default=uf2conv
melopero_cookie_rp2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
melopero_cookie_rp2040.menu.uploadmethod.picotool=Picotool
melopero_cookie_rp2040.menu.uploadmethod.picotool.build.ram_length=256k
melopero_cookie_rp2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
melopero_cookie_rp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
melopero_cookie_rp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
melopero_cookie_rp2040.menu.uploadmethod.picotool.upload.tool=picotool
melopero_cookie_rp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
melopero_cookie_rp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
melopero_cookie_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
melopero_cookie_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
melopero_cookie_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
melopero_cookie_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
melopero_cookie_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
melopero_cookie_rp2040.menu.uploadmethod.picodebug=Pico-Debug
melopero_cookie_rp2040.menu.uploadmethod.picodebug.build.ram_length=240k
melopero_cookie_rp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
melopero_cookie_rp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
melopero_cookie_rp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
melopero_cookie_rp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
melopero_cookie_rp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# Melopero Shake RP2040
# -----------------------------------
melopero_shake_rp2040.name=Melopero Shake RP2040
melopero_shake_rp2040.vid.0=0x2e8a
melopero_shake_rp2040.pid.0=0x1005
melopero_shake_rp2040.vid.1=0x2e8a
melopero_shake_rp2040.pid.1=0x1105
melopero_shake_rp2040.vid.2=0x2e8a
melopero_shake_rp2040.pid.2=0x5005
melopero_shake_rp2040.vid.3=0x2e8a
melopero_shake_rp2040.pid.3=0x5105
melopero_shake_rp2040.vid.4=0x2e8a
melopero_shake_rp2040.pid.4=0x9005
melopero_shake_rp2040.vid.5=0x2e8a
melopero_shake_rp2040.pid.5=0x9105
melopero_shake_rp2040.vid.6=0x2e8a
melopero_shake_rp2040.pid.6=0xd005
melopero_shake_rp2040.vid.7=0x2e8a
melopero_shake_rp2040.pid.7=0xd105
melopero_shake_rp2040.upload_port.0.vid=0x2e8a
melopero_shake_rp2040.upload_port.0.pid=0x1005
melopero_shake_rp2040.upload_port.1.vid=0x2e8a
melopero_shake_rp2040.upload_port.1.pid=0x1105
melopero_shake_rp2040.upload_port.2.vid=0x2e8a
melopero_shake_rp2040.upload_port.2.pid=0x5005
melopero_shake_rp2040.upload_port.3.vid=0x2e8a
melopero_shake_rp2040.upload_port.3.pid=0x5105
melopero_shake_rp2040.upload_port.4.vid=0x2e8a
melopero_shake_rp2040.upload_port.4.pid=0x9005
melopero_shake_rp2040.upload_port.5.vid=0x2e8a
melopero_shake_rp2040.upload_port.5.pid=0x9105
melopero_shake_rp2040.upload_port.6.vid=0x2e8a
melopero_shake_rp2040.upload_port.6.pid=0xd005
melopero_shake_rp2040.upload_port.7.vid=0x2e8a
melopero_shake_rp2040.upload_port.7.pid=0xd105
melopero_shake_rp2040.build.usbvid=-DUSBD_VID=0x2e8a
melopero_shake_rp2040.build.usbpid=-DUSBD_PID=0x1005
melopero_shake_rp2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250
melopero_shake_rp2040.build.board=MELOPERO_SHAKE_RP2040
melopero_shake_rp2040.build.mcu=cortex-m0plus
melopero_shake_rp2040.build.variant=melopero_shake_rp2040
melopero_shake_rp2040.upload.maximum_size=16777216
melopero_shake_rp2040.upload.wait_for_upload_port=true
melopero_shake_rp2040.upload.erase_cmd=
melopero_shake_rp2040.serial.disableDTR=false
melopero_shake_rp2040.serial.disableRTS=false
melopero_shake_rp2040.build.f_cpu=125000000
melopero_shake_rp2040.build.led=
melopero_shake_rp2040.build.core=rp2040
melopero_shake_rp2040.build.ldscript=memmap_default.ld
melopero_shake_rp2040.build.boot2=boot2_w25q080_2_padded_checksum
melopero_shake_rp2040.build.usb_manufacturer="Melopero"
melopero_shake_rp2040.build.usb_product="Shake RP2040"
melopero_shake_rp2040.menu.flash.16777216_0=16MB (no FS)
melopero_shake_rp2040.menu.flash.16777216_0.upload.maximum_size=16773120
melopero_shake_rp2040.menu.flash.16777216_0.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_0.build.flash_length=16773120
melopero_shake_rp2040.menu.flash.16777216_0.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_0.build.fs_start=285208576
melopero_shake_rp2040.menu.flash.16777216_0.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
melopero_shake_rp2040.menu.flash.16777216_65536.upload.maximum_size=16707584
melopero_shake_rp2040.menu.flash.16777216_65536.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_65536.build.flash_length=16707584
melopero_shake_rp2040.menu.flash.16777216_65536.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_65536.build.fs_start=285143040
melopero_shake_rp2040.menu.flash.16777216_65536.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
melopero_shake_rp2040.menu.flash.16777216_131072.upload.maximum_size=16642048
melopero_shake_rp2040.menu.flash.16777216_131072.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_131072.build.flash_length=16642048
melopero_shake_rp2040.menu.flash.16777216_131072.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_131072.build.fs_start=285077504
melopero_shake_rp2040.menu.flash.16777216_131072.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
melopero_shake_rp2040.menu.flash.16777216_262144.upload.maximum_size=16510976
melopero_shake_rp2040.menu.flash.16777216_262144.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_262144.build.flash_length=16510976
melopero_shake_rp2040.menu.flash.16777216_262144.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_262144.build.fs_start=284946432
melopero_shake_rp2040.menu.flash.16777216_262144.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
melopero_shake_rp2040.menu.flash.16777216_524288.upload.maximum_size=16248832
melopero_shake_rp2040.menu.flash.16777216_524288.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_524288.build.flash_length=16248832
melopero_shake_rp2040.menu.flash.16777216_524288.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_524288.build.fs_start=284684288
melopero_shake_rp2040.menu.flash.16777216_524288.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
melopero_shake_rp2040.menu.flash.16777216_1048576.upload.maximum_size=15724544
melopero_shake_rp2040.menu.flash.16777216_1048576.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_1048576.build.flash_length=15724544
melopero_shake_rp2040.menu.flash.16777216_1048576.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_1048576.build.fs_start=284160000
melopero_shake_rp2040.menu.flash.16777216_1048576.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
melopero_shake_rp2040.menu.flash.16777216_2097152.upload.maximum_size=14675968
melopero_shake_rp2040.menu.flash.16777216_2097152.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_2097152.build.flash_length=14675968
melopero_shake_rp2040.menu.flash.16777216_2097152.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_2097152.build.fs_start=283111424
melopero_shake_rp2040.menu.flash.16777216_2097152.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
melopero_shake_rp2040.menu.flash.16777216_3145728.upload.maximum_size=13627392
melopero_shake_rp2040.menu.flash.16777216_3145728.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_3145728.build.flash_length=13627392
melopero_shake_rp2040.menu.flash.16777216_3145728.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_3145728.build.fs_start=282062848
melopero_shake_rp2040.menu.flash.16777216_3145728.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
melopero_shake_rp2040.menu.flash.16777216_4194304.upload.maximum_size=12578816
melopero_shake_rp2040.menu.flash.16777216_4194304.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_4194304.build.flash_length=12578816
melopero_shake_rp2040.menu.flash.16777216_4194304.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_4194304.build.fs_start=281014272
melopero_shake_rp2040.menu.flash.16777216_4194304.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
melopero_shake_rp2040.menu.flash.16777216_5242880.upload.maximum_size=11530240
melopero_shake_rp2040.menu.flash.16777216_5242880.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_5242880.build.flash_length=11530240
melopero_shake_rp2040.menu.flash.16777216_5242880.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_5242880.build.fs_start=279965696
melopero_shake_rp2040.menu.flash.16777216_5242880.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
melopero_shake_rp2040.menu.flash.16777216_6291456.upload.maximum_size=10481664
melopero_shake_rp2040.menu.flash.16777216_6291456.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_6291456.build.flash_length=10481664
melopero_shake_rp2040.menu.flash.16777216_6291456.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_6291456.build.fs_start=278917120
melopero_shake_rp2040.menu.flash.16777216_6291456.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
melopero_shake_rp2040.menu.flash.16777216_7340032.upload.maximum_size=9433088
melopero_shake_rp2040.menu.flash.16777216_7340032.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_7340032.build.flash_length=9433088
melopero_shake_rp2040.menu.flash.16777216_7340032.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_7340032.build.fs_start=277868544
melopero_shake_rp2040.menu.flash.16777216_7340032.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
melopero_shake_rp2040.menu.flash.16777216_8388608.upload.maximum_size=8384512
melopero_shake_rp2040.menu.flash.16777216_8388608.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_8388608.build.flash_length=8384512
melopero_shake_rp2040.menu.flash.16777216_8388608.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_8388608.build.fs_start=276819968
melopero_shake_rp2040.menu.flash.16777216_8388608.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
melopero_shake_rp2040.menu.flash.16777216_9437184.upload.maximum_size=7335936
melopero_shake_rp2040.menu.flash.16777216_9437184.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_9437184.build.flash_length=7335936
melopero_shake_rp2040.menu.flash.16777216_9437184.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_9437184.build.fs_start=275771392
melopero_shake_rp2040.menu.flash.16777216_9437184.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
melopero_shake_rp2040.menu.flash.16777216_10485760.upload.maximum_size=6287360
melopero_shake_rp2040.menu.flash.16777216_10485760.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_10485760.build.flash_length=6287360
melopero_shake_rp2040.menu.flash.16777216_10485760.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_10485760.build.fs_start=274722816
melopero_shake_rp2040.menu.flash.16777216_10485760.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
melopero_shake_rp2040.menu.flash.16777216_11534336.upload.maximum_size=5238784
melopero_shake_rp2040.menu.flash.16777216_11534336.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_11534336.build.flash_length=5238784
melopero_shake_rp2040.menu.flash.16777216_11534336.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_11534336.build.fs_start=273674240
melopero_shake_rp2040.menu.flash.16777216_11534336.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
melopero_shake_rp2040.menu.flash.16777216_12582912.upload.maximum_size=4190208
melopero_shake_rp2040.menu.flash.16777216_12582912.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_12582912.build.flash_length=4190208
melopero_shake_rp2040.menu.flash.16777216_12582912.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_12582912.build.fs_start=272625664
melopero_shake_rp2040.menu.flash.16777216_12582912.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
melopero_shake_rp2040.menu.flash.16777216_13631488.upload.maximum_size=3141632
melopero_shake_rp2040.menu.flash.16777216_13631488.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_13631488.build.flash_length=3141632
melopero_shake_rp2040.menu.flash.16777216_13631488.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_13631488.build.fs_start=271577088
melopero_shake_rp2040.menu.flash.16777216_13631488.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
melopero_shake_rp2040.menu.flash.16777216_14680064.upload.maximum_size=2093056
melopero_shake_rp2040.menu.flash.16777216_14680064.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_14680064.build.flash_length=2093056
melopero_shake_rp2040.menu.flash.16777216_14680064.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_14680064.build.fs_start=270528512
melopero_shake_rp2040.menu.flash.16777216_14680064.build.fs_end=285208576
melopero_shake_rp2040.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
melopero_shake_rp2040.menu.flash.16777216_15728640.upload.maximum_size=1044480
melopero_shake_rp2040.menu.flash.16777216_15728640.build.flash_total=16777216
melopero_shake_rp2040.menu.flash.16777216_15728640.build.flash_length=1044480
melopero_shake_rp2040.menu.flash.16777216_15728640.build.eeprom_start=285208576
melopero_shake_rp2040.menu.flash.16777216_15728640.build.fs_start=269479936
melopero_shake_rp2040.menu.flash.16777216_15728640.build.fs_end=285208576
melopero_shake_rp2040.menu.freq.133=133 MHz
melopero_shake_rp2040.menu.freq.133.build.f_cpu=133000000L
melopero_shake_rp2040.menu.freq.50=50 MHz
melopero_shake_rp2040.menu.freq.50.build.f_cpu=50000000L
melopero_shake_rp2040.menu.freq.100=100 MHz
melopero_shake_rp2040.menu.freq.100.build.f_cpu=100000000L
melopero_shake_rp2040.menu.freq.120=120 MHz
melopero_shake_rp2040.menu.freq.120.build.f_cpu=120000000L
melopero_shake_rp2040.menu.freq.125=125 MHz
