earlephilhower/arduino-pico/boards.txt
melopero_shake_rp2040.menu.freq.125.build.f_cpu=125000000L
melopero_shake_rp2040.menu.freq.128=128 MHz
melopero_shake_rp2040.menu.freq.128.build.f_cpu=128000000L
melopero_shake_rp2040.menu.freq.150=150 MHz (Overclock)
melopero_shake_rp2040.menu.freq.150.build.f_cpu=150000000L
melopero_shake_rp2040.menu.freq.175=175 MHz (Overclock)
melopero_shake_rp2040.menu.freq.175.build.f_cpu=175000000L
melopero_shake_rp2040.menu.freq.200=200 MHz (Overclock)
melopero_shake_rp2040.menu.freq.200.build.f_cpu=200000000L
melopero_shake_rp2040.menu.freq.225=225 MHz (Overclock)
melopero_shake_rp2040.menu.freq.225.build.f_cpu=225000000L
melopero_shake_rp2040.menu.freq.240=240 MHz (Overclock)
melopero_shake_rp2040.menu.freq.240.build.f_cpu=240000000L
melopero_shake_rp2040.menu.freq.250=250 MHz (Overclock)
melopero_shake_rp2040.menu.freq.250.build.f_cpu=250000000L
melopero_shake_rp2040.menu.freq.275=275 MHz (Overclock)
melopero_shake_rp2040.menu.freq.275.build.f_cpu=275000000L
melopero_shake_rp2040.menu.freq.300=300 MHz (Overclock)
melopero_shake_rp2040.menu.freq.300.build.f_cpu=300000000L
melopero_shake_rp2040.menu.opt.Small=Small (-Os) (standard)
melopero_shake_rp2040.menu.opt.Small.build.flags.optimize=-Os
melopero_shake_rp2040.menu.opt.Optimize=Optimize (-O)
melopero_shake_rp2040.menu.opt.Optimize.build.flags.optimize=-O
melopero_shake_rp2040.menu.opt.Optimize2=Optimize More (-O2)
melopero_shake_rp2040.menu.opt.Optimize2.build.flags.optimize=-O2
melopero_shake_rp2040.menu.opt.Optimize3=Optimize Even More (-O3)
melopero_shake_rp2040.menu.opt.Optimize3.build.flags.optimize=-O3
melopero_shake_rp2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
melopero_shake_rp2040.menu.opt.Fast.build.flags.optimize=-Ofast
melopero_shake_rp2040.menu.opt.Debug=Debug (-Og)
melopero_shake_rp2040.menu.opt.Debug.build.flags.optimize=-Og
melopero_shake_rp2040.menu.rtti.Disabled=Disabled
melopero_shake_rp2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
melopero_shake_rp2040.menu.rtti.Enabled=Enabled
melopero_shake_rp2040.menu.rtti.Enabled.build.flags.rtti=
melopero_shake_rp2040.menu.stackprotect.Disabled=Disabled
melopero_shake_rp2040.menu.stackprotect.Disabled.build.flags.stackprotect=
melopero_shake_rp2040.menu.stackprotect.Enabled=Enabled
melopero_shake_rp2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
melopero_shake_rp2040.menu.exceptions.Disabled=Disabled
melopero_shake_rp2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
melopero_shake_rp2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
melopero_shake_rp2040.menu.exceptions.Enabled=Enabled
melopero_shake_rp2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
melopero_shake_rp2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
melopero_shake_rp2040.menu.dbgport.Disabled=Disabled
melopero_shake_rp2040.menu.dbgport.Disabled.build.debug_port=
melopero_shake_rp2040.menu.dbgport.Serial=Serial
melopero_shake_rp2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
melopero_shake_rp2040.menu.dbgport.Serial1=Serial1
melopero_shake_rp2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
melopero_shake_rp2040.menu.dbgport.Serial2=Serial2
melopero_shake_rp2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
melopero_shake_rp2040.menu.dbglvl.None=None
melopero_shake_rp2040.menu.dbglvl.None.build.debug_level=
melopero_shake_rp2040.menu.dbglvl.Core=Core
melopero_shake_rp2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
melopero_shake_rp2040.menu.dbglvl.SPI=SPI
melopero_shake_rp2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
melopero_shake_rp2040.menu.dbglvl.Wire=Wire
melopero_shake_rp2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
melopero_shake_rp2040.menu.dbglvl.Bluetooth=Bluetooth
melopero_shake_rp2040.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
melopero_shake_rp2040.menu.dbglvl.All=All
melopero_shake_rp2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
melopero_shake_rp2040.menu.dbglvl.NDEBUG=NDEBUG
melopero_shake_rp2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
melopero_shake_rp2040.menu.usbstack.picosdk=Pico SDK
melopero_shake_rp2040.menu.usbstack.picosdk.build.usbstack_flags=
melopero_shake_rp2040.menu.usbstack.tinyusb=Adafruit TinyUSB
melopero_shake_rp2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
melopero_shake_rp2040.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
melopero_shake_rp2040.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
melopero_shake_rp2040.menu.usbstack.nousb=No USB
melopero_shake_rp2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
melopero_shake_rp2040.menu.ipbtstack.ipv4only=IPv4 Only
melopero_shake_rp2040.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
melopero_shake_rp2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
melopero_shake_rp2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
melopero_shake_rp2040.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
melopero_shake_rp2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
melopero_shake_rp2040.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
melopero_shake_rp2040.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
melopero_shake_rp2040.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
melopero_shake_rp2040.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
melopero_shake_rp2040.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
melopero_shake_rp2040.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
melopero_shake_rp2040.menu.uploadmethod.default=Default (UF2)
melopero_shake_rp2040.menu.uploadmethod.default.build.ram_length=256k
melopero_shake_rp2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
melopero_shake_rp2040.menu.uploadmethod.default.upload.maximum_data_size=262144
melopero_shake_rp2040.menu.uploadmethod.default.upload.tool=uf2conv
melopero_shake_rp2040.menu.uploadmethod.default.upload.tool.default=uf2conv
melopero_shake_rp2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
melopero_shake_rp2040.menu.uploadmethod.picotool=Picotool
melopero_shake_rp2040.menu.uploadmethod.picotool.build.ram_length=256k
melopero_shake_rp2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
melopero_shake_rp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
melopero_shake_rp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
melopero_shake_rp2040.menu.uploadmethod.picotool.upload.tool=picotool
melopero_shake_rp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
melopero_shake_rp2040.menu.uploadmethod.picodebug=Pico-Debug
melopero_shake_rp2040.menu.uploadmethod.picodebug.build.ram_length=240k
melopero_shake_rp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
melopero_shake_rp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
melopero_shake_rp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
melopero_shake_rp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
melopero_shake_rp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

