earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# METE HOCA Akana R1
# -----------------------------------
akana_r1.name=METE HOCA Akana R1
akana_r1.vid.0=0x2e8a
akana_r1.pid.0=0x3001
akana_r1.vid.1=0x2e8a
akana_r1.pid.1=0x3101
akana_r1.vid.2=0x2e8a
akana_r1.pid.2=0x7001
akana_r1.vid.3=0x2e8a
akana_r1.pid.3=0x7101
akana_r1.vid.4=0x2e8a
akana_r1.pid.4=0xb001
akana_r1.vid.5=0x2e8a
akana_r1.pid.5=0xb101
akana_r1.vid.6=0x2e8a
akana_r1.pid.6=0xf001
akana_r1.vid.7=0x2e8a
akana_r1.pid.7=0xf101
akana_r1.upload_port.0.vid=0x2e8a
akana_r1.upload_port.0.pid=0x3001
akana_r1.upload_port.1.vid=0x2e8a
akana_r1.upload_port.1.pid=0x3101
akana_r1.upload_port.2.vid=0x2e8a
akana_r1.upload_port.2.pid=0x7001
akana_r1.upload_port.3.vid=0x2e8a
akana_r1.upload_port.3.pid=0x7101
akana_r1.upload_port.4.vid=0x2e8a
akana_r1.upload_port.4.pid=0xb001
akana_r1.upload_port.5.vid=0x2e8a
akana_r1.upload_port.5.pid=0xb101
akana_r1.upload_port.6.vid=0x2e8a
akana_r1.upload_port.6.pid=0xf001
akana_r1.upload_port.7.vid=0x2e8a
akana_r1.upload_port.7.pid=0xf101
akana_r1.build.usbvid=-DUSBD_VID=0x2e8a
akana_r1.build.usbpid=-DUSBD_PID=0x3001
akana_r1.build.usbpwr=-DUSBD_MAX_POWER_MA=500
akana_r1.build.board=METEHOCA_AKANA_R1
akana_r1.build.mcu=cortex-m0plus
akana_r1.build.variant=akana_r1
akana_r1.upload.maximum_size=16777216
akana_r1.upload.wait_for_upload_port=true
akana_r1.upload.erase_cmd=
akana_r1.serial.disableDTR=false
akana_r1.serial.disableRTS=false
akana_r1.build.f_cpu=125000000
akana_r1.build.led=
akana_r1.build.core=rp2040
akana_r1.build.ldscript=memmap_default.ld
akana_r1.build.boot2=boot2_generic_03h_4_padded_checksum
akana_r1.build.usb_manufacturer="METE HOCA"
akana_r1.build.usb_product="Akana R1"
akana_r1.menu.flash.2097152_0=2MB (no FS)
akana_r1.menu.flash.2097152_0.upload.maximum_size=2093056
akana_r1.menu.flash.2097152_0.build.flash_total=2097152
akana_r1.menu.flash.2097152_0.build.flash_length=2093056
akana_r1.menu.flash.2097152_0.build.eeprom_start=270528512
akana_r1.menu.flash.2097152_0.build.fs_start=270528512
akana_r1.menu.flash.2097152_0.build.fs_end=270528512
akana_r1.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
akana_r1.menu.flash.2097152_1048576.upload.maximum_size=1044480
akana_r1.menu.flash.2097152_1048576.build.flash_total=2097152
akana_r1.menu.flash.2097152_1048576.build.flash_length=1044480
akana_r1.menu.flash.2097152_1048576.build.eeprom_start=270528512
akana_r1.menu.flash.2097152_1048576.build.fs_start=269479936
akana_r1.menu.flash.2097152_1048576.build.fs_end=270528512
akana_r1.menu.flash.8388608_0=8MB (no FS)
akana_r1.menu.flash.8388608_0.upload.maximum_size=8384512
akana_r1.menu.flash.8388608_0.build.flash_total=8388608
akana_r1.menu.flash.8388608_0.build.flash_length=8384512
akana_r1.menu.flash.8388608_0.build.eeprom_start=276819968
akana_r1.menu.flash.8388608_0.build.fs_start=276819968
akana_r1.menu.flash.8388608_0.build.fs_end=276819968
akana_r1.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
akana_r1.menu.flash.8388608_7340032.upload.maximum_size=1044480
akana_r1.menu.flash.8388608_7340032.build.flash_total=8388608
akana_r1.menu.flash.8388608_7340032.build.flash_length=1044480
akana_r1.menu.flash.8388608_7340032.build.eeprom_start=276819968
akana_r1.menu.flash.8388608_7340032.build.fs_start=269479936
akana_r1.menu.flash.8388608_7340032.build.fs_end=276819968
akana_r1.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
akana_r1.menu.flash.8388608_4194304.upload.maximum_size=4190208
akana_r1.menu.flash.8388608_4194304.build.flash_total=8388608
akana_r1.menu.flash.8388608_4194304.build.flash_length=4190208
akana_r1.menu.flash.8388608_4194304.build.eeprom_start=276819968
akana_r1.menu.flash.8388608_4194304.build.fs_start=272625664
akana_r1.menu.flash.8388608_4194304.build.fs_end=276819968
akana_r1.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
akana_r1.menu.flash.8388608_2097152.upload.maximum_size=6287360
akana_r1.menu.flash.8388608_2097152.build.flash_total=8388608
akana_r1.menu.flash.8388608_2097152.build.flash_length=6287360
akana_r1.menu.flash.8388608_2097152.build.eeprom_start=276819968
akana_r1.menu.flash.8388608_2097152.build.fs_start=274722816
akana_r1.menu.flash.8388608_2097152.build.fs_end=276819968
akana_r1.menu.flash.16777216_0=16MB (no FS)
akana_r1.menu.flash.16777216_0.upload.maximum_size=16773120
akana_r1.menu.flash.16777216_0.build.flash_total=16777216
akana_r1.menu.flash.16777216_0.build.flash_length=16773120
akana_r1.menu.flash.16777216_0.build.eeprom_start=285208576
akana_r1.menu.flash.16777216_0.build.fs_start=285208576
akana_r1.menu.flash.16777216_0.build.fs_end=285208576
akana_r1.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
akana_r1.menu.flash.16777216_15728640.upload.maximum_size=1044480
akana_r1.menu.flash.16777216_15728640.build.flash_total=16777216
akana_r1.menu.flash.16777216_15728640.build.flash_length=1044480
akana_r1.menu.flash.16777216_15728640.build.eeprom_start=285208576
akana_r1.menu.flash.16777216_15728640.build.fs_start=269479936
akana_r1.menu.flash.16777216_15728640.build.fs_end=285208576
akana_r1.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
akana_r1.menu.flash.16777216_14680064.upload.maximum_size=2093056
akana_r1.menu.flash.16777216_14680064.build.flash_total=16777216
akana_r1.menu.flash.16777216_14680064.build.flash_length=2093056
akana_r1.menu.flash.16777216_14680064.build.eeprom_start=285208576
akana_r1.menu.flash.16777216_14680064.build.fs_start=270528512
akana_r1.menu.flash.16777216_14680064.build.fs_end=285208576
akana_r1.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
akana_r1.menu.flash.16777216_12582912.upload.maximum_size=4190208
akana_r1.menu.flash.16777216_12582912.build.flash_total=16777216
akana_r1.menu.flash.16777216_12582912.build.flash_length=4190208
akana_r1.menu.flash.16777216_12582912.build.eeprom_start=285208576
akana_r1.menu.flash.16777216_12582912.build.fs_start=272625664
akana_r1.menu.flash.16777216_12582912.build.fs_end=285208576
akana_r1.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
akana_r1.menu.flash.16777216_8388608.upload.maximum_size=8384512
akana_r1.menu.flash.16777216_8388608.build.flash_total=16777216
akana_r1.menu.flash.16777216_8388608.build.flash_length=8384512
akana_r1.menu.flash.16777216_8388608.build.eeprom_start=285208576
akana_r1.menu.flash.16777216_8388608.build.fs_start=276819968
akana_r1.menu.flash.16777216_8388608.build.fs_end=285208576
akana_r1.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
akana_r1.menu.flash.16777216_4194304.upload.maximum_size=12578816
akana_r1.menu.flash.16777216_4194304.build.flash_total=16777216
akana_r1.menu.flash.16777216_4194304.build.flash_length=12578816
akana_r1.menu.flash.16777216_4194304.build.eeprom_start=285208576
akana_r1.menu.flash.16777216_4194304.build.fs_start=281014272
akana_r1.menu.flash.16777216_4194304.build.fs_end=285208576
akana_r1.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
akana_r1.menu.flash.16777216_2097152.upload.maximum_size=14675968
akana_r1.menu.flash.16777216_2097152.build.flash_total=16777216
akana_r1.menu.flash.16777216_2097152.build.flash_length=14675968
akana_r1.menu.flash.16777216_2097152.build.eeprom_start=285208576
akana_r1.menu.flash.16777216_2097152.build.fs_start=283111424
akana_r1.menu.flash.16777216_2097152.build.fs_end=285208576
akana_r1.menu.freq.133=133 MHz
akana_r1.menu.freq.133.build.f_cpu=133000000L
akana_r1.menu.freq.50=50 MHz
akana_r1.menu.freq.50.build.f_cpu=50000000L
akana_r1.menu.freq.100=100 MHz
akana_r1.menu.freq.100.build.f_cpu=100000000L
akana_r1.menu.freq.120=120 MHz
akana_r1.menu.freq.120.build.f_cpu=120000000L
akana_r1.menu.freq.125=125 MHz
akana_r1.menu.freq.125.build.f_cpu=125000000L
akana_r1.menu.freq.128=128 MHz
akana_r1.menu.freq.128.build.f_cpu=128000000L
akana_r1.menu.freq.150=150 MHz (Overclock)
akana_r1.menu.freq.150.build.f_cpu=150000000L
akana_r1.menu.freq.175=175 MHz (Overclock)
akana_r1.menu.freq.175.build.f_cpu=175000000L
akana_r1.menu.freq.200=200 MHz (Overclock)
akana_r1.menu.freq.200.build.f_cpu=200000000L
akana_r1.menu.freq.225=225 MHz (Overclock)
akana_r1.menu.freq.225.build.f_cpu=225000000L
akana_r1.menu.freq.240=240 MHz (Overclock)
akana_r1.menu.freq.240.build.f_cpu=240000000L
akana_r1.menu.freq.250=250 MHz (Overclock)
akana_r1.menu.freq.250.build.f_cpu=250000000L
akana_r1.menu.freq.275=275 MHz (Overclock)
akana_r1.menu.freq.275.build.f_cpu=275000000L
akana_r1.menu.freq.300=300 MHz (Overclock)
akana_r1.menu.freq.300.build.f_cpu=300000000L
akana_r1.menu.opt.Small=Small (-Os) (standard)
akana_r1.menu.opt.Small.build.flags.optimize=-Os
akana_r1.menu.opt.Optimize=Optimize (-O)
akana_r1.menu.opt.Optimize.build.flags.optimize=-O
akana_r1.menu.opt.Optimize2=Optimize More (-O2)
akana_r1.menu.opt.Optimize2.build.flags.optimize=-O2
akana_r1.menu.opt.Optimize3=Optimize Even More (-O3)
akana_r1.menu.opt.Optimize3.build.flags.optimize=-O3
akana_r1.menu.opt.Fast=Fast (-Ofast) (maybe slower)
akana_r1.menu.opt.Fast.build.flags.optimize=-Ofast
akana_r1.menu.opt.Debug=Debug (-Og)
akana_r1.menu.opt.Debug.build.flags.optimize=-Og
akana_r1.menu.rtti.Disabled=Disabled
akana_r1.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
akana_r1.menu.rtti.Enabled=Enabled
akana_r1.menu.rtti.Enabled.build.flags.rtti=
akana_r1.menu.stackprotect.Disabled=Disabled
akana_r1.menu.stackprotect.Disabled.build.flags.stackprotect=
akana_r1.menu.stackprotect.Enabled=Enabled
akana_r1.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
akana_r1.menu.exceptions.Disabled=Disabled
akana_r1.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
akana_r1.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
akana_r1.menu.exceptions.Enabled=Enabled
akana_r1.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
akana_r1.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
akana_r1.menu.dbgport.Disabled=Disabled
akana_r1.menu.dbgport.Disabled.build.debug_port=
akana_r1.menu.dbgport.Serial=Serial
akana_r1.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
akana_r1.menu.dbgport.Serial1=Serial1
akana_r1.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
akana_r1.menu.dbgport.Serial2=Serial2
akana_r1.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
akana_r1.menu.dbglvl.None=None
akana_r1.menu.dbglvl.None.build.debug_level=
akana_r1.menu.dbglvl.Core=Core
akana_r1.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
akana_r1.menu.dbglvl.SPI=SPI
akana_r1.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
akana_r1.menu.dbglvl.Wire=Wire
akana_r1.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
akana_r1.menu.dbglvl.Bluetooth=Bluetooth
akana_r1.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
akana_r1.menu.dbglvl.All=All
akana_r1.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
akana_r1.menu.dbglvl.NDEBUG=NDEBUG
akana_r1.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
akana_r1.menu.usbstack.picosdk=Pico SDK
akana_r1.menu.usbstack.picosdk.build.usbstack_flags=
akana_r1.menu.usbstack.tinyusb=Adafruit TinyUSB
akana_r1.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
akana_r1.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
akana_r1.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
akana_r1.menu.usbstack.nousb=No USB
akana_r1.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
akana_r1.menu.ipbtstack.ipv4only=IPv4 Only
akana_r1.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
akana_r1.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
akana_r1.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
akana_r1.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
akana_r1.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
akana_r1.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
akana_r1.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
akana_r1.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
akana_r1.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
akana_r1.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
akana_r1.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
akana_r1.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
akana_r1.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
akana_r1.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
akana_r1.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
akana_r1.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
akana_r1.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
akana_r1.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
akana_r1.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
akana_r1.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
akana_r1.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
akana_r1.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
akana_r1.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
akana_r1.menu.uploadmethod.default=Default (UF2)
akana_r1.menu.uploadmethod.default.build.ram_length=256k
akana_r1.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
akana_r1.menu.uploadmethod.default.upload.maximum_data_size=262144
akana_r1.menu.uploadmethod.default.upload.tool=uf2conv
akana_r1.menu.uploadmethod.default.upload.tool.default=uf2conv
akana_r1.menu.uploadmethod.default.upload.tool.network=uf2conv-network
akana_r1.menu.uploadmethod.picotool=Picotool
akana_r1.menu.uploadmethod.picotool.build.ram_length=256k
akana_r1.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
akana_r1.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
akana_r1.menu.uploadmethod.picotool.upload.maximum_data_size=262144
akana_r1.menu.uploadmethod.picotool.upload.tool=picotool
akana_r1.menu.uploadmethod.picotool.upload.tool.default=picotool
akana_r1.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
akana_r1.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
akana_r1.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
akana_r1.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
akana_r1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
akana_r1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
akana_r1.menu.uploadmethod.picodebug=Pico-Debug
akana_r1.menu.uploadmethod.picodebug.build.ram_length=240k
akana_r1.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
akana_r1.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
akana_r1.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
akana_r1.menu.uploadmethod.picodebug.upload.tool=picodebug
akana_r1.menu.uploadmethod.picodebug.upload.tool.default=picodebug

