earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Olimex RP2040-Pico30 2MB
# -----------------------------------
olimex_rp2040pico30_2mb.name=Olimex RP2040-Pico30 2MB
olimex_rp2040pico30_2mb.vid.0=0x15ba
olimex_rp2040pico30_2mb.pid.0=0x0026
olimex_rp2040pico30_2mb.vid.1=0x15ba
olimex_rp2040pico30_2mb.pid.1=0x0126
olimex_rp2040pico30_2mb.vid.2=0x15ba
olimex_rp2040pico30_2mb.pid.2=0x4026
olimex_rp2040pico30_2mb.vid.3=0x15ba
olimex_rp2040pico30_2mb.pid.3=0x4126
olimex_rp2040pico30_2mb.vid.4=0x15ba
olimex_rp2040pico30_2mb.pid.4=0x8026
olimex_rp2040pico30_2mb.vid.5=0x15ba
olimex_rp2040pico30_2mb.pid.5=0x8126
olimex_rp2040pico30_2mb.vid.6=0x15ba
olimex_rp2040pico30_2mb.pid.6=0xc026
olimex_rp2040pico30_2mb.vid.7=0x15ba
olimex_rp2040pico30_2mb.pid.7=0xc126
olimex_rp2040pico30_2mb.upload_port.0.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.0.pid=0x0026
olimex_rp2040pico30_2mb.upload_port.1.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.1.pid=0x0126
olimex_rp2040pico30_2mb.upload_port.2.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.2.pid=0x4026
olimex_rp2040pico30_2mb.upload_port.3.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.3.pid=0x4126
olimex_rp2040pico30_2mb.upload_port.4.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.4.pid=0x8026
olimex_rp2040pico30_2mb.upload_port.5.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.5.pid=0x8126
olimex_rp2040pico30_2mb.upload_port.6.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.6.pid=0xc026
olimex_rp2040pico30_2mb.upload_port.7.vid=0x15ba
olimex_rp2040pico30_2mb.upload_port.7.pid=0xc126
olimex_rp2040pico30_2mb.build.usbvid=-DUSBD_VID=0x15ba
olimex_rp2040pico30_2mb.build.usbpid=-DUSBD_PID=0x0026
olimex_rp2040pico30_2mb.build.usbpwr=-DUSBD_MAX_POWER_MA=250
olimex_rp2040pico30_2mb.build.board=OLIMEX_RP2040_PICO30_2MB
olimex_rp2040pico30_2mb.build.mcu=cortex-m0plus
olimex_rp2040pico30_2mb.build.variant=olimex_rp2040pico30_2mb
olimex_rp2040pico30_2mb.upload.maximum_size=2097152
olimex_rp2040pico30_2mb.upload.wait_for_upload_port=true
olimex_rp2040pico30_2mb.upload.erase_cmd=
olimex_rp2040pico30_2mb.serial.disableDTR=false
olimex_rp2040pico30_2mb.serial.disableRTS=false
olimex_rp2040pico30_2mb.build.f_cpu=125000000
olimex_rp2040pico30_2mb.build.led=
olimex_rp2040pico30_2mb.build.core=rp2040
olimex_rp2040pico30_2mb.build.ldscript=memmap_default.ld
olimex_rp2040pico30_2mb.build.boot2=boot2_w25q080_2_padded_checksum
olimex_rp2040pico30_2mb.build.usb_manufacturer="Olimex"
olimex_rp2040pico30_2mb.build.usb_product="RP2040-Pico30 2MB"
olimex_rp2040pico30_2mb.menu.flash.2097152_0=2MB (no FS)
olimex_rp2040pico30_2mb.menu.flash.2097152_0.upload.maximum_size=2093056
olimex_rp2040pico30_2mb.menu.flash.2097152_0.build.flash_total=2097152
olimex_rp2040pico30_2mb.menu.flash.2097152_0.build.flash_length=2093056
olimex_rp2040pico30_2mb.menu.flash.2097152_0.build.eeprom_start=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_0.build.fs_start=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_0.build.fs_end=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
olimex_rp2040pico30_2mb.menu.flash.2097152_65536.upload.maximum_size=2027520
olimex_rp2040pico30_2mb.menu.flash.2097152_65536.build.flash_total=2097152
olimex_rp2040pico30_2mb.menu.flash.2097152_65536.build.flash_length=2027520
olimex_rp2040pico30_2mb.menu.flash.2097152_65536.build.eeprom_start=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_65536.build.fs_start=270462976
olimex_rp2040pico30_2mb.menu.flash.2097152_65536.build.fs_end=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
olimex_rp2040pico30_2mb.menu.flash.2097152_131072.upload.maximum_size=1961984
olimex_rp2040pico30_2mb.menu.flash.2097152_131072.build.flash_total=2097152
olimex_rp2040pico30_2mb.menu.flash.2097152_131072.build.flash_length=1961984
olimex_rp2040pico30_2mb.menu.flash.2097152_131072.build.eeprom_start=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_131072.build.fs_start=270397440
olimex_rp2040pico30_2mb.menu.flash.2097152_131072.build.fs_end=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
olimex_rp2040pico30_2mb.menu.flash.2097152_262144.upload.maximum_size=1830912
olimex_rp2040pico30_2mb.menu.flash.2097152_262144.build.flash_total=2097152
olimex_rp2040pico30_2mb.menu.flash.2097152_262144.build.flash_length=1830912
olimex_rp2040pico30_2mb.menu.flash.2097152_262144.build.eeprom_start=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_262144.build.fs_start=270266368
olimex_rp2040pico30_2mb.menu.flash.2097152_262144.build.fs_end=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
olimex_rp2040pico30_2mb.menu.flash.2097152_524288.upload.maximum_size=1568768
olimex_rp2040pico30_2mb.menu.flash.2097152_524288.build.flash_total=2097152
olimex_rp2040pico30_2mb.menu.flash.2097152_524288.build.flash_length=1568768
olimex_rp2040pico30_2mb.menu.flash.2097152_524288.build.eeprom_start=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_524288.build.fs_start=270004224
olimex_rp2040pico30_2mb.menu.flash.2097152_524288.build.fs_end=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
olimex_rp2040pico30_2mb.menu.flash.2097152_1048576.upload.maximum_size=1044480
olimex_rp2040pico30_2mb.menu.flash.2097152_1048576.build.flash_total=2097152
olimex_rp2040pico30_2mb.menu.flash.2097152_1048576.build.flash_length=1044480
olimex_rp2040pico30_2mb.menu.flash.2097152_1048576.build.eeprom_start=270528512
olimex_rp2040pico30_2mb.menu.flash.2097152_1048576.build.fs_start=269479936
olimex_rp2040pico30_2mb.menu.flash.2097152_1048576.build.fs_end=270528512
olimex_rp2040pico30_2mb.menu.freq.133=133 MHz
olimex_rp2040pico30_2mb.menu.freq.133.build.f_cpu=133000000L
olimex_rp2040pico30_2mb.menu.freq.50=50 MHz
olimex_rp2040pico30_2mb.menu.freq.50.build.f_cpu=50000000L
olimex_rp2040pico30_2mb.menu.freq.100=100 MHz
olimex_rp2040pico30_2mb.menu.freq.100.build.f_cpu=100000000L
olimex_rp2040pico30_2mb.menu.freq.120=120 MHz
olimex_rp2040pico30_2mb.menu.freq.120.build.f_cpu=120000000L
olimex_rp2040pico30_2mb.menu.freq.125=125 MHz
olimex_rp2040pico30_2mb.menu.freq.125.build.f_cpu=125000000L
olimex_rp2040pico30_2mb.menu.freq.128=128 MHz
olimex_rp2040pico30_2mb.menu.freq.128.build.f_cpu=128000000L
olimex_rp2040pico30_2mb.menu.freq.150=150 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.150.build.f_cpu=150000000L
olimex_rp2040pico30_2mb.menu.freq.175=175 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.175.build.f_cpu=175000000L
olimex_rp2040pico30_2mb.menu.freq.200=200 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.200.build.f_cpu=200000000L
olimex_rp2040pico30_2mb.menu.freq.225=225 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.225.build.f_cpu=225000000L
olimex_rp2040pico30_2mb.menu.freq.240=240 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.240.build.f_cpu=240000000L
olimex_rp2040pico30_2mb.menu.freq.250=250 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.250.build.f_cpu=250000000L
olimex_rp2040pico30_2mb.menu.freq.275=275 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.275.build.f_cpu=275000000L
olimex_rp2040pico30_2mb.menu.freq.300=300 MHz (Overclock)
olimex_rp2040pico30_2mb.menu.freq.300.build.f_cpu=300000000L
olimex_rp2040pico30_2mb.menu.opt.Small=Small (-Os) (standard)
olimex_rp2040pico30_2mb.menu.opt.Small.build.flags.optimize=-Os
olimex_rp2040pico30_2mb.menu.opt.Optimize=Optimize (-O)
olimex_rp2040pico30_2mb.menu.opt.Optimize.build.flags.optimize=-O
olimex_rp2040pico30_2mb.menu.opt.Optimize2=Optimize More (-O2)
olimex_rp2040pico30_2mb.menu.opt.Optimize2.build.flags.optimize=-O2
olimex_rp2040pico30_2mb.menu.opt.Optimize3=Optimize Even More (-O3)
olimex_rp2040pico30_2mb.menu.opt.Optimize3.build.flags.optimize=-O3
olimex_rp2040pico30_2mb.menu.opt.Fast=Fast (-Ofast) (maybe slower)
olimex_rp2040pico30_2mb.menu.opt.Fast.build.flags.optimize=-Ofast
olimex_rp2040pico30_2mb.menu.opt.Debug=Debug (-Og)
olimex_rp2040pico30_2mb.menu.opt.Debug.build.flags.optimize=-Og
olimex_rp2040pico30_2mb.menu.rtti.Disabled=Disabled
olimex_rp2040pico30_2mb.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
olimex_rp2040pico30_2mb.menu.rtti.Enabled=Enabled
olimex_rp2040pico30_2mb.menu.rtti.Enabled.build.flags.rtti=
olimex_rp2040pico30_2mb.menu.stackprotect.Disabled=Disabled
olimex_rp2040pico30_2mb.menu.stackprotect.Disabled.build.flags.stackprotect=
olimex_rp2040pico30_2mb.menu.stackprotect.Enabled=Enabled
olimex_rp2040pico30_2mb.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
olimex_rp2040pico30_2mb.menu.exceptions.Disabled=Disabled
olimex_rp2040pico30_2mb.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
olimex_rp2040pico30_2mb.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
olimex_rp2040pico30_2mb.menu.exceptions.Enabled=Enabled
olimex_rp2040pico30_2mb.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
olimex_rp2040pico30_2mb.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
olimex_rp2040pico30_2mb.menu.dbgport.Disabled=Disabled
olimex_rp2040pico30_2mb.menu.dbgport.Disabled.build.debug_port=
olimex_rp2040pico30_2mb.menu.dbgport.Serial=Serial
olimex_rp2040pico30_2mb.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
olimex_rp2040pico30_2mb.menu.dbgport.Serial1=Serial1
olimex_rp2040pico30_2mb.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
olimex_rp2040pico30_2mb.menu.dbgport.Serial2=Serial2
olimex_rp2040pico30_2mb.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
olimex_rp2040pico30_2mb.menu.dbglvl.None=None
olimex_rp2040pico30_2mb.menu.dbglvl.None.build.debug_level=
olimex_rp2040pico30_2mb.menu.dbglvl.Core=Core
olimex_rp2040pico30_2mb.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
olimex_rp2040pico30_2mb.menu.dbglvl.SPI=SPI
olimex_rp2040pico30_2mb.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
olimex_rp2040pico30_2mb.menu.dbglvl.Wire=Wire
olimex_rp2040pico30_2mb.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
olimex_rp2040pico30_2mb.menu.dbglvl.Bluetooth=Bluetooth
olimex_rp2040pico30_2mb.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
olimex_rp2040pico30_2mb.menu.dbglvl.All=All
olimex_rp2040pico30_2mb.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
olimex_rp2040pico30_2mb.menu.dbglvl.NDEBUG=NDEBUG
olimex_rp2040pico30_2mb.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
olimex_rp2040pico30_2mb.menu.usbstack.picosdk=Pico SDK
olimex_rp2040pico30_2mb.menu.usbstack.picosdk.build.usbstack_flags=
olimex_rp2040pico30_2mb.menu.usbstack.tinyusb=Adafruit TinyUSB
olimex_rp2040pico30_2mb.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_rp2040pico30_2mb.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
olimex_rp2040pico30_2mb.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_rp2040pico30_2mb.menu.usbstack.nousb=No USB
olimex_rp2040pico30_2mb.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4only=IPv4 Only
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
olimex_rp2040pico30_2mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_2mb.menu.uploadmethod.default=Default (UF2)
olimex_rp2040pico30_2mb.menu.uploadmethod.default.build.ram_length=256k
olimex_rp2040pico30_2mb.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_rp2040pico30_2mb.menu.uploadmethod.default.upload.maximum_data_size=262144
olimex_rp2040pico30_2mb.menu.uploadmethod.default.upload.tool=uf2conv
olimex_rp2040pico30_2mb.menu.uploadmethod.default.upload.tool.default=uf2conv
olimex_rp2040pico30_2mb.menu.uploadmethod.default.upload.tool.network=uf2conv-network
olimex_rp2040pico30_2mb.menu.uploadmethod.picotool=Picotool
olimex_rp2040pico30_2mb.menu.uploadmethod.picotool.build.ram_length=256k
olimex_rp2040pico30_2mb.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
olimex_rp2040pico30_2mb.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
olimex_rp2040pico30_2mb.menu.uploadmethod.picotool.upload.maximum_data_size=262144
olimex_rp2040pico30_2mb.menu.uploadmethod.picotool.upload.tool=picotool
olimex_rp2040pico30_2mb.menu.uploadmethod.picotool.upload.tool.default=picotool
olimex_rp2040pico30_2mb.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
olimex_rp2040pico30_2mb.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
olimex_rp2040pico30_2mb.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_rp2040pico30_2mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
olimex_rp2040pico30_2mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
olimex_rp2040pico30_2mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
olimex_rp2040pico30_2mb.menu.uploadmethod.picodebug=Pico-Debug
olimex_rp2040pico30_2mb.menu.uploadmethod.picodebug.build.ram_length=240k
olimex_rp2040pico30_2mb.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
olimex_rp2040pico30_2mb.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
olimex_rp2040pico30_2mb.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
olimex_rp2040pico30_2mb.menu.uploadmethod.picodebug.upload.tool=picodebug
olimex_rp2040pico30_2mb.menu.uploadmethod.picodebug.upload.tool.default=picodebug

