earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Olimex RP2040-Pico30 16MB
# -----------------------------------
olimex_rp2040pico30_16mb.name=Olimex RP2040-Pico30 16MB
olimex_rp2040pico30_16mb.vid.0=0x15ba
olimex_rp2040pico30_16mb.pid.0=0x0026
olimex_rp2040pico30_16mb.vid.1=0x15ba
olimex_rp2040pico30_16mb.pid.1=0x0126
olimex_rp2040pico30_16mb.vid.2=0x15ba
olimex_rp2040pico30_16mb.pid.2=0x4026
olimex_rp2040pico30_16mb.vid.3=0x15ba
olimex_rp2040pico30_16mb.pid.3=0x4126
olimex_rp2040pico30_16mb.vid.4=0x15ba
olimex_rp2040pico30_16mb.pid.4=0x8026
olimex_rp2040pico30_16mb.vid.5=0x15ba
olimex_rp2040pico30_16mb.pid.5=0x8126
olimex_rp2040pico30_16mb.vid.6=0x15ba
olimex_rp2040pico30_16mb.pid.6=0xc026
olimex_rp2040pico30_16mb.vid.7=0x15ba
olimex_rp2040pico30_16mb.pid.7=0xc126
olimex_rp2040pico30_16mb.upload_port.0.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.0.pid=0x0026
olimex_rp2040pico30_16mb.upload_port.1.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.1.pid=0x0126
olimex_rp2040pico30_16mb.upload_port.2.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.2.pid=0x4026
olimex_rp2040pico30_16mb.upload_port.3.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.3.pid=0x4126
olimex_rp2040pico30_16mb.upload_port.4.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.4.pid=0x8026
olimex_rp2040pico30_16mb.upload_port.5.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.5.pid=0x8126
olimex_rp2040pico30_16mb.upload_port.6.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.6.pid=0xc026
olimex_rp2040pico30_16mb.upload_port.7.vid=0x15ba
olimex_rp2040pico30_16mb.upload_port.7.pid=0xc126
olimex_rp2040pico30_16mb.build.usbvid=-DUSBD_VID=0x15ba
olimex_rp2040pico30_16mb.build.usbpid=-DUSBD_PID=0x0026
olimex_rp2040pico30_16mb.build.usbpwr=-DUSBD_MAX_POWER_MA=250
olimex_rp2040pico30_16mb.build.board=OLIMEX_RP2040_PICO30_16MB
olimex_rp2040pico30_16mb.build.mcu=cortex-m0plus
olimex_rp2040pico30_16mb.build.variant=olimex_rp2040pico30_16mb
olimex_rp2040pico30_16mb.upload.maximum_size=16777216
olimex_rp2040pico30_16mb.upload.wait_for_upload_port=true
olimex_rp2040pico30_16mb.upload.erase_cmd=
olimex_rp2040pico30_16mb.serial.disableDTR=false
olimex_rp2040pico30_16mb.serial.disableRTS=false
olimex_rp2040pico30_16mb.build.f_cpu=125000000
olimex_rp2040pico30_16mb.build.led=
olimex_rp2040pico30_16mb.build.core=rp2040
olimex_rp2040pico30_16mb.build.ldscript=memmap_default.ld
olimex_rp2040pico30_16mb.build.boot2=boot2_w25q080_2_padded_checksum
olimex_rp2040pico30_16mb.build.usb_manufacturer="Olimex"
olimex_rp2040pico30_16mb.build.usb_product="RP2040-Pico30 16MB"
olimex_rp2040pico30_16mb.menu.flash.16777216_0=16MB (no FS)
olimex_rp2040pico30_16mb.menu.flash.16777216_0.upload.maximum_size=16773120
olimex_rp2040pico30_16mb.menu.flash.16777216_0.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_0.build.flash_length=16773120
olimex_rp2040pico30_16mb.menu.flash.16777216_0.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_0.build.fs_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_0.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
olimex_rp2040pico30_16mb.menu.flash.16777216_65536.upload.maximum_size=16707584
olimex_rp2040pico30_16mb.menu.flash.16777216_65536.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_65536.build.flash_length=16707584
olimex_rp2040pico30_16mb.menu.flash.16777216_65536.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_65536.build.fs_start=285143040
olimex_rp2040pico30_16mb.menu.flash.16777216_65536.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
olimex_rp2040pico30_16mb.menu.flash.16777216_131072.upload.maximum_size=16642048
olimex_rp2040pico30_16mb.menu.flash.16777216_131072.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_131072.build.flash_length=16642048
olimex_rp2040pico30_16mb.menu.flash.16777216_131072.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_131072.build.fs_start=285077504
olimex_rp2040pico30_16mb.menu.flash.16777216_131072.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
olimex_rp2040pico30_16mb.menu.flash.16777216_262144.upload.maximum_size=16510976
olimex_rp2040pico30_16mb.menu.flash.16777216_262144.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_262144.build.flash_length=16510976
olimex_rp2040pico30_16mb.menu.flash.16777216_262144.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_262144.build.fs_start=284946432
olimex_rp2040pico30_16mb.menu.flash.16777216_262144.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
olimex_rp2040pico30_16mb.menu.flash.16777216_524288.upload.maximum_size=16248832
olimex_rp2040pico30_16mb.menu.flash.16777216_524288.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_524288.build.flash_length=16248832
olimex_rp2040pico30_16mb.menu.flash.16777216_524288.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_524288.build.fs_start=284684288
olimex_rp2040pico30_16mb.menu.flash.16777216_524288.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_1048576.upload.maximum_size=15724544
olimex_rp2040pico30_16mb.menu.flash.16777216_1048576.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_1048576.build.flash_length=15724544
olimex_rp2040pico30_16mb.menu.flash.16777216_1048576.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_1048576.build.fs_start=284160000
olimex_rp2040pico30_16mb.menu.flash.16777216_1048576.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_2097152.upload.maximum_size=14675968
olimex_rp2040pico30_16mb.menu.flash.16777216_2097152.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_2097152.build.flash_length=14675968
olimex_rp2040pico30_16mb.menu.flash.16777216_2097152.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_2097152.build.fs_start=283111424
olimex_rp2040pico30_16mb.menu.flash.16777216_2097152.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_3145728.upload.maximum_size=13627392
olimex_rp2040pico30_16mb.menu.flash.16777216_3145728.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_3145728.build.flash_length=13627392
olimex_rp2040pico30_16mb.menu.flash.16777216_3145728.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_3145728.build.fs_start=282062848
olimex_rp2040pico30_16mb.menu.flash.16777216_3145728.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_4194304.upload.maximum_size=12578816
olimex_rp2040pico30_16mb.menu.flash.16777216_4194304.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_4194304.build.flash_length=12578816
olimex_rp2040pico30_16mb.menu.flash.16777216_4194304.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_4194304.build.fs_start=281014272
olimex_rp2040pico30_16mb.menu.flash.16777216_4194304.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_5242880.upload.maximum_size=11530240
olimex_rp2040pico30_16mb.menu.flash.16777216_5242880.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_5242880.build.flash_length=11530240
olimex_rp2040pico30_16mb.menu.flash.16777216_5242880.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_5242880.build.fs_start=279965696
olimex_rp2040pico30_16mb.menu.flash.16777216_5242880.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_6291456.upload.maximum_size=10481664
olimex_rp2040pico30_16mb.menu.flash.16777216_6291456.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_6291456.build.flash_length=10481664
olimex_rp2040pico30_16mb.menu.flash.16777216_6291456.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_6291456.build.fs_start=278917120
olimex_rp2040pico30_16mb.menu.flash.16777216_6291456.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_7340032.upload.maximum_size=9433088
olimex_rp2040pico30_16mb.menu.flash.16777216_7340032.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_7340032.build.flash_length=9433088
olimex_rp2040pico30_16mb.menu.flash.16777216_7340032.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_7340032.build.fs_start=277868544
olimex_rp2040pico30_16mb.menu.flash.16777216_7340032.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_8388608.upload.maximum_size=8384512
olimex_rp2040pico30_16mb.menu.flash.16777216_8388608.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_8388608.build.flash_length=8384512
olimex_rp2040pico30_16mb.menu.flash.16777216_8388608.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_8388608.build.fs_start=276819968
olimex_rp2040pico30_16mb.menu.flash.16777216_8388608.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_9437184.upload.maximum_size=7335936
olimex_rp2040pico30_16mb.menu.flash.16777216_9437184.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_9437184.build.flash_length=7335936
olimex_rp2040pico30_16mb.menu.flash.16777216_9437184.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_9437184.build.fs_start=275771392
olimex_rp2040pico30_16mb.menu.flash.16777216_9437184.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_10485760.upload.maximum_size=6287360
olimex_rp2040pico30_16mb.menu.flash.16777216_10485760.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_10485760.build.flash_length=6287360
olimex_rp2040pico30_16mb.menu.flash.16777216_10485760.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_10485760.build.fs_start=274722816
olimex_rp2040pico30_16mb.menu.flash.16777216_10485760.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_11534336.upload.maximum_size=5238784
olimex_rp2040pico30_16mb.menu.flash.16777216_11534336.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_11534336.build.flash_length=5238784
olimex_rp2040pico30_16mb.menu.flash.16777216_11534336.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_11534336.build.fs_start=273674240
olimex_rp2040pico30_16mb.menu.flash.16777216_11534336.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_12582912.upload.maximum_size=4190208
olimex_rp2040pico30_16mb.menu.flash.16777216_12582912.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_12582912.build.flash_length=4190208
olimex_rp2040pico30_16mb.menu.flash.16777216_12582912.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_12582912.build.fs_start=272625664
olimex_rp2040pico30_16mb.menu.flash.16777216_12582912.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_13631488.upload.maximum_size=3141632
olimex_rp2040pico30_16mb.menu.flash.16777216_13631488.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_13631488.build.flash_length=3141632
olimex_rp2040pico30_16mb.menu.flash.16777216_13631488.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_13631488.build.fs_start=271577088
olimex_rp2040pico30_16mb.menu.flash.16777216_13631488.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_14680064.upload.maximum_size=2093056
olimex_rp2040pico30_16mb.menu.flash.16777216_14680064.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_14680064.build.flash_length=2093056
olimex_rp2040pico30_16mb.menu.flash.16777216_14680064.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_14680064.build.fs_start=270528512
olimex_rp2040pico30_16mb.menu.flash.16777216_14680064.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
olimex_rp2040pico30_16mb.menu.flash.16777216_15728640.upload.maximum_size=1044480
olimex_rp2040pico30_16mb.menu.flash.16777216_15728640.build.flash_total=16777216
olimex_rp2040pico30_16mb.menu.flash.16777216_15728640.build.flash_length=1044480
olimex_rp2040pico30_16mb.menu.flash.16777216_15728640.build.eeprom_start=285208576
olimex_rp2040pico30_16mb.menu.flash.16777216_15728640.build.fs_start=269479936
olimex_rp2040pico30_16mb.menu.flash.16777216_15728640.build.fs_end=285208576
olimex_rp2040pico30_16mb.menu.freq.133=133 MHz
olimex_rp2040pico30_16mb.menu.freq.133.build.f_cpu=133000000L
olimex_rp2040pico30_16mb.menu.freq.50=50 MHz
olimex_rp2040pico30_16mb.menu.freq.50.build.f_cpu=50000000L
olimex_rp2040pico30_16mb.menu.freq.100=100 MHz
olimex_rp2040pico30_16mb.menu.freq.100.build.f_cpu=100000000L
olimex_rp2040pico30_16mb.menu.freq.120=120 MHz
olimex_rp2040pico30_16mb.menu.freq.120.build.f_cpu=120000000L
olimex_rp2040pico30_16mb.menu.freq.125=125 MHz
olimex_rp2040pico30_16mb.menu.freq.125.build.f_cpu=125000000L
olimex_rp2040pico30_16mb.menu.freq.128=128 MHz
olimex_rp2040pico30_16mb.menu.freq.128.build.f_cpu=128000000L
olimex_rp2040pico30_16mb.menu.freq.150=150 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.150.build.f_cpu=150000000L
olimex_rp2040pico30_16mb.menu.freq.175=175 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.175.build.f_cpu=175000000L
olimex_rp2040pico30_16mb.menu.freq.200=200 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.200.build.f_cpu=200000000L
olimex_rp2040pico30_16mb.menu.freq.225=225 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.225.build.f_cpu=225000000L
olimex_rp2040pico30_16mb.menu.freq.240=240 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.240.build.f_cpu=240000000L
olimex_rp2040pico30_16mb.menu.freq.250=250 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.250.build.f_cpu=250000000L
olimex_rp2040pico30_16mb.menu.freq.275=275 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.275.build.f_cpu=275000000L
olimex_rp2040pico30_16mb.menu.freq.300=300 MHz (Overclock)
olimex_rp2040pico30_16mb.menu.freq.300.build.f_cpu=300000000L
olimex_rp2040pico30_16mb.menu.opt.Small=Small (-Os) (standard)
olimex_rp2040pico30_16mb.menu.opt.Small.build.flags.optimize=-Os
olimex_rp2040pico30_16mb.menu.opt.Optimize=Optimize (-O)
olimex_rp2040pico30_16mb.menu.opt.Optimize.build.flags.optimize=-O
olimex_rp2040pico30_16mb.menu.opt.Optimize2=Optimize More (-O2)
olimex_rp2040pico30_16mb.menu.opt.Optimize2.build.flags.optimize=-O2
olimex_rp2040pico30_16mb.menu.opt.Optimize3=Optimize Even More (-O3)
olimex_rp2040pico30_16mb.menu.opt.Optimize3.build.flags.optimize=-O3
olimex_rp2040pico30_16mb.menu.opt.Fast=Fast (-Ofast) (maybe slower)
olimex_rp2040pico30_16mb.menu.opt.Fast.build.flags.optimize=-Ofast
olimex_rp2040pico30_16mb.menu.opt.Debug=Debug (-Og)
olimex_rp2040pico30_16mb.menu.opt.Debug.build.flags.optimize=-Og
olimex_rp2040pico30_16mb.menu.rtti.Disabled=Disabled
olimex_rp2040pico30_16mb.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
olimex_rp2040pico30_16mb.menu.rtti.Enabled=Enabled
olimex_rp2040pico30_16mb.menu.rtti.Enabled.build.flags.rtti=
olimex_rp2040pico30_16mb.menu.stackprotect.Disabled=Disabled
olimex_rp2040pico30_16mb.menu.stackprotect.Disabled.build.flags.stackprotect=
olimex_rp2040pico30_16mb.menu.stackprotect.Enabled=Enabled
olimex_rp2040pico30_16mb.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
olimex_rp2040pico30_16mb.menu.exceptions.Disabled=Disabled
olimex_rp2040pico30_16mb.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
olimex_rp2040pico30_16mb.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
olimex_rp2040pico30_16mb.menu.exceptions.Enabled=Enabled
olimex_rp2040pico30_16mb.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
olimex_rp2040pico30_16mb.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
olimex_rp2040pico30_16mb.menu.dbgport.Disabled=Disabled
olimex_rp2040pico30_16mb.menu.dbgport.Disabled.build.debug_port=
olimex_rp2040pico30_16mb.menu.dbgport.Serial=Serial
olimex_rp2040pico30_16mb.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
olimex_rp2040pico30_16mb.menu.dbgport.Serial1=Serial1
olimex_rp2040pico30_16mb.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
olimex_rp2040pico30_16mb.menu.dbgport.Serial2=Serial2
olimex_rp2040pico30_16mb.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
olimex_rp2040pico30_16mb.menu.dbglvl.None=None
olimex_rp2040pico30_16mb.menu.dbglvl.None.build.debug_level=
olimex_rp2040pico30_16mb.menu.dbglvl.Core=Core
olimex_rp2040pico30_16mb.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
olimex_rp2040pico30_16mb.menu.dbglvl.SPI=SPI
olimex_rp2040pico30_16mb.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
