earlephilhower/arduino-pico/boards.txt
olimex_rp2040pico30_16mb.menu.dbglvl.Wire=Wire
olimex_rp2040pico30_16mb.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
olimex_rp2040pico30_16mb.menu.dbglvl.Bluetooth=Bluetooth
olimex_rp2040pico30_16mb.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
olimex_rp2040pico30_16mb.menu.dbglvl.All=All
olimex_rp2040pico30_16mb.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
olimex_rp2040pico30_16mb.menu.dbglvl.NDEBUG=NDEBUG
olimex_rp2040pico30_16mb.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
olimex_rp2040pico30_16mb.menu.usbstack.picosdk=Pico SDK
olimex_rp2040pico30_16mb.menu.usbstack.picosdk.build.usbstack_flags=
olimex_rp2040pico30_16mb.menu.usbstack.tinyusb=Adafruit TinyUSB
olimex_rp2040pico30_16mb.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_rp2040pico30_16mb.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
olimex_rp2040pico30_16mb.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_rp2040pico30_16mb.menu.usbstack.nousb=No USB
olimex_rp2040pico30_16mb.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4only=IPv4 Only
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
olimex_rp2040pico30_16mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_rp2040pico30_16mb.menu.uploadmethod.default=Default (UF2)
olimex_rp2040pico30_16mb.menu.uploadmethod.default.build.ram_length=256k
olimex_rp2040pico30_16mb.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_rp2040pico30_16mb.menu.uploadmethod.default.upload.maximum_data_size=262144
olimex_rp2040pico30_16mb.menu.uploadmethod.default.upload.tool=uf2conv
olimex_rp2040pico30_16mb.menu.uploadmethod.default.upload.tool.default=uf2conv
olimex_rp2040pico30_16mb.menu.uploadmethod.default.upload.tool.network=uf2conv-network
olimex_rp2040pico30_16mb.menu.uploadmethod.picotool=Picotool
olimex_rp2040pico30_16mb.menu.uploadmethod.picotool.build.ram_length=256k
olimex_rp2040pico30_16mb.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
olimex_rp2040pico30_16mb.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
olimex_rp2040pico30_16mb.menu.uploadmethod.picotool.upload.maximum_data_size=262144
olimex_rp2040pico30_16mb.menu.uploadmethod.picotool.upload.tool=picotool
olimex_rp2040pico30_16mb.menu.uploadmethod.picotool.upload.tool.default=picotool
olimex_rp2040pico30_16mb.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
olimex_rp2040pico30_16mb.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
olimex_rp2040pico30_16mb.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_rp2040pico30_16mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
olimex_rp2040pico30_16mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
olimex_rp2040pico30_16mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
olimex_rp2040pico30_16mb.menu.uploadmethod.picodebug=Pico-Debug
olimex_rp2040pico30_16mb.menu.uploadmethod.picodebug.build.ram_length=240k
olimex_rp2040pico30_16mb.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
olimex_rp2040pico30_16mb.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
olimex_rp2040pico30_16mb.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
olimex_rp2040pico30_16mb.menu.uploadmethod.picodebug.upload.tool=picodebug
olimex_rp2040pico30_16mb.menu.uploadmethod.picodebug.upload.tool.default=picodebug

