earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Pimoroni Plasma2040
# -----------------------------------
pimoroni_plasma2040.name=Pimoroni Plasma2040
pimoroni_plasma2040.vid.0=0x2e8a
pimoroni_plasma2040.pid.0=0x100a
pimoroni_plasma2040.vid.1=0x2e8a
pimoroni_plasma2040.pid.1=0x110a
pimoroni_plasma2040.vid.2=0x2e8a
pimoroni_plasma2040.pid.2=0x500a
pimoroni_plasma2040.vid.3=0x2e8a
pimoroni_plasma2040.pid.3=0x510a
pimoroni_plasma2040.vid.4=0x2e8a
pimoroni_plasma2040.pid.4=0x900a
pimoroni_plasma2040.vid.5=0x2e8a
pimoroni_plasma2040.pid.5=0x910a
pimoroni_plasma2040.vid.6=0x2e8a
pimoroni_plasma2040.pid.6=0xd00a
pimoroni_plasma2040.vid.7=0x2e8a
pimoroni_plasma2040.pid.7=0xd10a
pimoroni_plasma2040.upload_port.0.vid=0x2e8a
pimoroni_plasma2040.upload_port.0.pid=0x100a
pimoroni_plasma2040.upload_port.1.vid=0x2e8a
pimoroni_plasma2040.upload_port.1.pid=0x110a
pimoroni_plasma2040.upload_port.2.vid=0x2e8a
pimoroni_plasma2040.upload_port.2.pid=0x500a
pimoroni_plasma2040.upload_port.3.vid=0x2e8a
pimoroni_plasma2040.upload_port.3.pid=0x510a
pimoroni_plasma2040.upload_port.4.vid=0x2e8a
pimoroni_plasma2040.upload_port.4.pid=0x900a
pimoroni_plasma2040.upload_port.5.vid=0x2e8a
pimoroni_plasma2040.upload_port.5.pid=0x910a
pimoroni_plasma2040.upload_port.6.vid=0x2e8a
pimoroni_plasma2040.upload_port.6.pid=0xd00a
pimoroni_plasma2040.upload_port.7.vid=0x2e8a
pimoroni_plasma2040.upload_port.7.pid=0xd10a
pimoroni_plasma2040.build.usbvid=-DUSBD_VID=0x2e8a
pimoroni_plasma2040.build.usbpid=-DUSBD_PID=0x100a
pimoroni_plasma2040.build.usbpwr=-DUSBD_MAX_POWER_MA=500
pimoroni_plasma2040.build.board=PIMORONI_PLASMA2040
pimoroni_plasma2040.build.mcu=cortex-m0plus
pimoroni_plasma2040.build.variant=pimoroni_plasma2040
pimoroni_plasma2040.upload.maximum_size=2097152
pimoroni_plasma2040.upload.wait_for_upload_port=true
pimoroni_plasma2040.upload.erase_cmd=
pimoroni_plasma2040.serial.disableDTR=false
pimoroni_plasma2040.serial.disableRTS=false
pimoroni_plasma2040.build.f_cpu=125000000
pimoroni_plasma2040.build.led=
pimoroni_plasma2040.build.core=rp2040
pimoroni_plasma2040.build.ldscript=memmap_default.ld
pimoroni_plasma2040.build.boot2=boot2_w25q080_2_padded_checksum
pimoroni_plasma2040.build.usb_manufacturer="Pimoroni"
pimoroni_plasma2040.build.usb_product="Plasma2040"
pimoroni_plasma2040.menu.flash.2097152_0=2MB (no FS)
pimoroni_plasma2040.menu.flash.2097152_0.upload.maximum_size=2093056
pimoroni_plasma2040.menu.flash.2097152_0.build.flash_total=2097152
pimoroni_plasma2040.menu.flash.2097152_0.build.flash_length=2093056
pimoroni_plasma2040.menu.flash.2097152_0.build.eeprom_start=270528512
pimoroni_plasma2040.menu.flash.2097152_0.build.fs_start=270528512
pimoroni_plasma2040.menu.flash.2097152_0.build.fs_end=270528512
pimoroni_plasma2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
pimoroni_plasma2040.menu.flash.2097152_65536.upload.maximum_size=2027520
pimoroni_plasma2040.menu.flash.2097152_65536.build.flash_total=2097152
pimoroni_plasma2040.menu.flash.2097152_65536.build.flash_length=2027520
pimoroni_plasma2040.menu.flash.2097152_65536.build.eeprom_start=270528512
pimoroni_plasma2040.menu.flash.2097152_65536.build.fs_start=270462976
pimoroni_plasma2040.menu.flash.2097152_65536.build.fs_end=270528512
pimoroni_plasma2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
pimoroni_plasma2040.menu.flash.2097152_131072.upload.maximum_size=1961984
pimoroni_plasma2040.menu.flash.2097152_131072.build.flash_total=2097152
pimoroni_plasma2040.menu.flash.2097152_131072.build.flash_length=1961984
pimoroni_plasma2040.menu.flash.2097152_131072.build.eeprom_start=270528512
pimoroni_plasma2040.menu.flash.2097152_131072.build.fs_start=270397440
pimoroni_plasma2040.menu.flash.2097152_131072.build.fs_end=270528512
pimoroni_plasma2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
pimoroni_plasma2040.menu.flash.2097152_262144.upload.maximum_size=1830912
pimoroni_plasma2040.menu.flash.2097152_262144.build.flash_total=2097152
pimoroni_plasma2040.menu.flash.2097152_262144.build.flash_length=1830912
pimoroni_plasma2040.menu.flash.2097152_262144.build.eeprom_start=270528512
pimoroni_plasma2040.menu.flash.2097152_262144.build.fs_start=270266368
pimoroni_plasma2040.menu.flash.2097152_262144.build.fs_end=270528512
pimoroni_plasma2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
pimoroni_plasma2040.menu.flash.2097152_524288.upload.maximum_size=1568768
pimoroni_plasma2040.menu.flash.2097152_524288.build.flash_total=2097152
pimoroni_plasma2040.menu.flash.2097152_524288.build.flash_length=1568768
pimoroni_plasma2040.menu.flash.2097152_524288.build.eeprom_start=270528512
pimoroni_plasma2040.menu.flash.2097152_524288.build.fs_start=270004224
pimoroni_plasma2040.menu.flash.2097152_524288.build.fs_end=270528512
pimoroni_plasma2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
pimoroni_plasma2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
pimoroni_plasma2040.menu.flash.2097152_1048576.build.flash_total=2097152
pimoroni_plasma2040.menu.flash.2097152_1048576.build.flash_length=1044480
pimoroni_plasma2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
pimoroni_plasma2040.menu.flash.2097152_1048576.build.fs_start=269479936
pimoroni_plasma2040.menu.flash.2097152_1048576.build.fs_end=270528512
pimoroni_plasma2040.menu.freq.133=133 MHz
pimoroni_plasma2040.menu.freq.133.build.f_cpu=133000000L
pimoroni_plasma2040.menu.freq.50=50 MHz
pimoroni_plasma2040.menu.freq.50.build.f_cpu=50000000L
pimoroni_plasma2040.menu.freq.100=100 MHz
pimoroni_plasma2040.menu.freq.100.build.f_cpu=100000000L
pimoroni_plasma2040.menu.freq.120=120 MHz
pimoroni_plasma2040.menu.freq.120.build.f_cpu=120000000L
pimoroni_plasma2040.menu.freq.125=125 MHz
pimoroni_plasma2040.menu.freq.125.build.f_cpu=125000000L
pimoroni_plasma2040.menu.freq.128=128 MHz
pimoroni_plasma2040.menu.freq.128.build.f_cpu=128000000L
pimoroni_plasma2040.menu.freq.150=150 MHz (Overclock)
pimoroni_plasma2040.menu.freq.150.build.f_cpu=150000000L
pimoroni_plasma2040.menu.freq.175=175 MHz (Overclock)
pimoroni_plasma2040.menu.freq.175.build.f_cpu=175000000L
pimoroni_plasma2040.menu.freq.200=200 MHz (Overclock)
pimoroni_plasma2040.menu.freq.200.build.f_cpu=200000000L
pimoroni_plasma2040.menu.freq.225=225 MHz (Overclock)
pimoroni_plasma2040.menu.freq.225.build.f_cpu=225000000L
pimoroni_plasma2040.menu.freq.240=240 MHz (Overclock)
pimoroni_plasma2040.menu.freq.240.build.f_cpu=240000000L
pimoroni_plasma2040.menu.freq.250=250 MHz (Overclock)
pimoroni_plasma2040.menu.freq.250.build.f_cpu=250000000L
pimoroni_plasma2040.menu.freq.275=275 MHz (Overclock)
pimoroni_plasma2040.menu.freq.275.build.f_cpu=275000000L
pimoroni_plasma2040.menu.freq.300=300 MHz (Overclock)
pimoroni_plasma2040.menu.freq.300.build.f_cpu=300000000L
pimoroni_plasma2040.menu.opt.Small=Small (-Os) (standard)
pimoroni_plasma2040.menu.opt.Small.build.flags.optimize=-Os
pimoroni_plasma2040.menu.opt.Optimize=Optimize (-O)
pimoroni_plasma2040.menu.opt.Optimize.build.flags.optimize=-O
pimoroni_plasma2040.menu.opt.Optimize2=Optimize More (-O2)
pimoroni_plasma2040.menu.opt.Optimize2.build.flags.optimize=-O2
pimoroni_plasma2040.menu.opt.Optimize3=Optimize Even More (-O3)
pimoroni_plasma2040.menu.opt.Optimize3.build.flags.optimize=-O3
pimoroni_plasma2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pimoroni_plasma2040.menu.opt.Fast.build.flags.optimize=-Ofast
pimoroni_plasma2040.menu.opt.Debug=Debug (-Og)
pimoroni_plasma2040.menu.opt.Debug.build.flags.optimize=-Og
pimoroni_plasma2040.menu.rtti.Disabled=Disabled
pimoroni_plasma2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pimoroni_plasma2040.menu.rtti.Enabled=Enabled
pimoroni_plasma2040.menu.rtti.Enabled.build.flags.rtti=
pimoroni_plasma2040.menu.stackprotect.Disabled=Disabled
pimoroni_plasma2040.menu.stackprotect.Disabled.build.flags.stackprotect=
pimoroni_plasma2040.menu.stackprotect.Enabled=Enabled
pimoroni_plasma2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
pimoroni_plasma2040.menu.exceptions.Disabled=Disabled
pimoroni_plasma2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pimoroni_plasma2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pimoroni_plasma2040.menu.exceptions.Enabled=Enabled
pimoroni_plasma2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pimoroni_plasma2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
pimoroni_plasma2040.menu.dbgport.Disabled=Disabled
pimoroni_plasma2040.menu.dbgport.Disabled.build.debug_port=
pimoroni_plasma2040.menu.dbgport.Serial=Serial
pimoroni_plasma2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
pimoroni_plasma2040.menu.dbgport.Serial1=Serial1
pimoroni_plasma2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
pimoroni_plasma2040.menu.dbgport.Serial2=Serial2
pimoroni_plasma2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
pimoroni_plasma2040.menu.dbglvl.None=None
pimoroni_plasma2040.menu.dbglvl.None.build.debug_level=
pimoroni_plasma2040.menu.dbglvl.Core=Core
pimoroni_plasma2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
pimoroni_plasma2040.menu.dbglvl.SPI=SPI
pimoroni_plasma2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
pimoroni_plasma2040.menu.dbglvl.Wire=Wire
pimoroni_plasma2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
pimoroni_plasma2040.menu.dbglvl.Bluetooth=Bluetooth
pimoroni_plasma2040.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
pimoroni_plasma2040.menu.dbglvl.All=All
pimoroni_plasma2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
pimoroni_plasma2040.menu.dbglvl.NDEBUG=NDEBUG
pimoroni_plasma2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
pimoroni_plasma2040.menu.usbstack.picosdk=Pico SDK
pimoroni_plasma2040.menu.usbstack.picosdk.build.usbstack_flags=
pimoroni_plasma2040.menu.usbstack.tinyusb=Adafruit TinyUSB
pimoroni_plasma2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_plasma2040.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
pimoroni_plasma2040.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_plasma2040.menu.usbstack.nousb=No USB
pimoroni_plasma2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
pimoroni_plasma2040.menu.ipbtstack.ipv4only=IPv4 Only
pimoroni_plasma2040.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
pimoroni_plasma2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
pimoroni_plasma2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
pimoroni_plasma2040.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
pimoroni_plasma2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_plasma2040.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
pimoroni_plasma2040.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
pimoroni_plasma2040.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_plasma2040.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
pimoroni_plasma2040.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
pimoroni_plasma2040.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
pimoroni_plasma2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_plasma2040.menu.uploadmethod.default=Default (UF2)
pimoroni_plasma2040.menu.uploadmethod.default.build.ram_length=256k
pimoroni_plasma2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_plasma2040.menu.uploadmethod.default.upload.maximum_data_size=262144
pimoroni_plasma2040.menu.uploadmethod.default.upload.tool=uf2conv
pimoroni_plasma2040.menu.uploadmethod.default.upload.tool.default=uf2conv
pimoroni_plasma2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
pimoroni_plasma2040.menu.uploadmethod.picotool=Picotool
pimoroni_plasma2040.menu.uploadmethod.picotool.build.ram_length=256k
pimoroni_plasma2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
pimoroni_plasma2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
pimoroni_plasma2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
pimoroni_plasma2040.menu.uploadmethod.picotool.upload.tool=picotool
pimoroni_plasma2040.menu.uploadmethod.picotool.upload.tool.default=picotool
pimoroni_plasma2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
pimoroni_plasma2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
pimoroni_plasma2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_plasma2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
pimoroni_plasma2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
pimoroni_plasma2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
pimoroni_plasma2040.menu.uploadmethod.picodebug=Pico-Debug
pimoroni_plasma2040.menu.uploadmethod.picodebug.build.ram_length=240k
pimoroni_plasma2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
pimoroni_plasma2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
pimoroni_plasma2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
pimoroni_plasma2040.menu.uploadmethod.picodebug.upload.tool=picodebug
pimoroni_plasma2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

