earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# RAKwireless RAK11300
# -----------------------------------
rakwireless_rak11300.name=RAKwireless RAK11300
rakwireless_rak11300.vid.0=0x2e8a
rakwireless_rak11300.pid.0=0x00c0
rakwireless_rak11300.vid.1=0x2e8a
rakwireless_rak11300.pid.1=0x01c0
rakwireless_rak11300.vid.2=0x2e8a
rakwireless_rak11300.pid.2=0x40c0
rakwireless_rak11300.vid.3=0x2e8a
rakwireless_rak11300.pid.3=0x41c0
rakwireless_rak11300.vid.4=0x2e8a
rakwireless_rak11300.pid.4=0x80c0
rakwireless_rak11300.vid.5=0x2e8a
rakwireless_rak11300.pid.5=0x81c0
rakwireless_rak11300.vid.6=0x2e8a
rakwireless_rak11300.pid.6=0xc0c0
rakwireless_rak11300.vid.7=0x2e8a
rakwireless_rak11300.pid.7=0xc1c0
rakwireless_rak11300.upload_port.0.vid=0x2e8a
rakwireless_rak11300.upload_port.0.pid=0x00c0
rakwireless_rak11300.upload_port.1.vid=0x2e8a
rakwireless_rak11300.upload_port.1.pid=0x01c0
rakwireless_rak11300.upload_port.2.vid=0x2e8a
rakwireless_rak11300.upload_port.2.pid=0x40c0
rakwireless_rak11300.upload_port.3.vid=0x2e8a
rakwireless_rak11300.upload_port.3.pid=0x41c0
rakwireless_rak11300.upload_port.4.vid=0x2e8a
rakwireless_rak11300.upload_port.4.pid=0x80c0
rakwireless_rak11300.upload_port.5.vid=0x2e8a
rakwireless_rak11300.upload_port.5.pid=0x81c0
rakwireless_rak11300.upload_port.6.vid=0x2e8a
rakwireless_rak11300.upload_port.6.pid=0xc0c0
rakwireless_rak11300.upload_port.7.vid=0x2e8a
rakwireless_rak11300.upload_port.7.pid=0xc1c0
rakwireless_rak11300.build.usbvid=-DUSBD_VID=0x2e8a
rakwireless_rak11300.build.usbpid=-DUSBD_PID=0x00c0
rakwireless_rak11300.build.usbpwr=-DUSBD_MAX_POWER_MA=500
rakwireless_rak11300.build.board=RAKWIRELESS_RAK11300
rakwireless_rak11300.build.mcu=cortex-m0plus
rakwireless_rak11300.build.variant=rakwireless_rak11300
rakwireless_rak11300.upload.maximum_size=2097152
rakwireless_rak11300.upload.wait_for_upload_port=true
rakwireless_rak11300.upload.erase_cmd=
rakwireless_rak11300.serial.disableDTR=false
rakwireless_rak11300.serial.disableRTS=false
rakwireless_rak11300.build.f_cpu=125000000
rakwireless_rak11300.build.led=
rakwireless_rak11300.build.core=rp2040
rakwireless_rak11300.build.ldscript=memmap_default.ld
rakwireless_rak11300.build.boot2=boot2_w25q16jvxq_4_padded_checksum
rakwireless_rak11300.build.usb_manufacturer="RAKwireless"
rakwireless_rak11300.build.usb_product="RAK11300"
rakwireless_rak11300.menu.flash.2097152_0=2MB (no FS)
rakwireless_rak11300.menu.flash.2097152_0.upload.maximum_size=2093056
rakwireless_rak11300.menu.flash.2097152_0.build.flash_total=2097152
rakwireless_rak11300.menu.flash.2097152_0.build.flash_length=2093056
rakwireless_rak11300.menu.flash.2097152_0.build.eeprom_start=270528512
rakwireless_rak11300.menu.flash.2097152_0.build.fs_start=270528512
rakwireless_rak11300.menu.flash.2097152_0.build.fs_end=270528512
rakwireless_rak11300.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rakwireless_rak11300.menu.flash.2097152_65536.upload.maximum_size=2027520
rakwireless_rak11300.menu.flash.2097152_65536.build.flash_total=2097152
rakwireless_rak11300.menu.flash.2097152_65536.build.flash_length=2027520
rakwireless_rak11300.menu.flash.2097152_65536.build.eeprom_start=270528512
rakwireless_rak11300.menu.flash.2097152_65536.build.fs_start=270462976
rakwireless_rak11300.menu.flash.2097152_65536.build.fs_end=270528512
rakwireless_rak11300.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rakwireless_rak11300.menu.flash.2097152_131072.upload.maximum_size=1961984
rakwireless_rak11300.menu.flash.2097152_131072.build.flash_total=2097152
rakwireless_rak11300.menu.flash.2097152_131072.build.flash_length=1961984
rakwireless_rak11300.menu.flash.2097152_131072.build.eeprom_start=270528512
rakwireless_rak11300.menu.flash.2097152_131072.build.fs_start=270397440
rakwireless_rak11300.menu.flash.2097152_131072.build.fs_end=270528512
rakwireless_rak11300.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rakwireless_rak11300.menu.flash.2097152_262144.upload.maximum_size=1830912
rakwireless_rak11300.menu.flash.2097152_262144.build.flash_total=2097152
rakwireless_rak11300.menu.flash.2097152_262144.build.flash_length=1830912
rakwireless_rak11300.menu.flash.2097152_262144.build.eeprom_start=270528512
rakwireless_rak11300.menu.flash.2097152_262144.build.fs_start=270266368
rakwireless_rak11300.menu.flash.2097152_262144.build.fs_end=270528512
rakwireless_rak11300.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rakwireless_rak11300.menu.flash.2097152_524288.upload.maximum_size=1568768
rakwireless_rak11300.menu.flash.2097152_524288.build.flash_total=2097152
rakwireless_rak11300.menu.flash.2097152_524288.build.flash_length=1568768
rakwireless_rak11300.menu.flash.2097152_524288.build.eeprom_start=270528512
rakwireless_rak11300.menu.flash.2097152_524288.build.fs_start=270004224
rakwireless_rak11300.menu.flash.2097152_524288.build.fs_end=270528512
rakwireless_rak11300.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rakwireless_rak11300.menu.flash.2097152_1048576.upload.maximum_size=1044480
rakwireless_rak11300.menu.flash.2097152_1048576.build.flash_total=2097152
rakwireless_rak11300.menu.flash.2097152_1048576.build.flash_length=1044480
rakwireless_rak11300.menu.flash.2097152_1048576.build.eeprom_start=270528512
rakwireless_rak11300.menu.flash.2097152_1048576.build.fs_start=269479936
rakwireless_rak11300.menu.flash.2097152_1048576.build.fs_end=270528512
rakwireless_rak11300.menu.freq.133=133 MHz
rakwireless_rak11300.menu.freq.133.build.f_cpu=133000000L
rakwireless_rak11300.menu.freq.50=50 MHz
rakwireless_rak11300.menu.freq.50.build.f_cpu=50000000L
rakwireless_rak11300.menu.freq.100=100 MHz
rakwireless_rak11300.menu.freq.100.build.f_cpu=100000000L
rakwireless_rak11300.menu.freq.120=120 MHz
rakwireless_rak11300.menu.freq.120.build.f_cpu=120000000L
rakwireless_rak11300.menu.freq.125=125 MHz
rakwireless_rak11300.menu.freq.125.build.f_cpu=125000000L
rakwireless_rak11300.menu.freq.128=128 MHz
rakwireless_rak11300.menu.freq.128.build.f_cpu=128000000L
rakwireless_rak11300.menu.freq.150=150 MHz (Overclock)
rakwireless_rak11300.menu.freq.150.build.f_cpu=150000000L
rakwireless_rak11300.menu.freq.175=175 MHz (Overclock)
rakwireless_rak11300.menu.freq.175.build.f_cpu=175000000L
rakwireless_rak11300.menu.freq.200=200 MHz (Overclock)
rakwireless_rak11300.menu.freq.200.build.f_cpu=200000000L
rakwireless_rak11300.menu.freq.225=225 MHz (Overclock)
rakwireless_rak11300.menu.freq.225.build.f_cpu=225000000L
rakwireless_rak11300.menu.freq.240=240 MHz (Overclock)
rakwireless_rak11300.menu.freq.240.build.f_cpu=240000000L
rakwireless_rak11300.menu.freq.250=250 MHz (Overclock)
rakwireless_rak11300.menu.freq.250.build.f_cpu=250000000L
rakwireless_rak11300.menu.freq.275=275 MHz (Overclock)
rakwireless_rak11300.menu.freq.275.build.f_cpu=275000000L
rakwireless_rak11300.menu.freq.300=300 MHz (Overclock)
rakwireless_rak11300.menu.freq.300.build.f_cpu=300000000L
rakwireless_rak11300.menu.opt.Small=Small (-Os) (standard)
rakwireless_rak11300.menu.opt.Small.build.flags.optimize=-Os
rakwireless_rak11300.menu.opt.Optimize=Optimize (-O)
rakwireless_rak11300.menu.opt.Optimize.build.flags.optimize=-O
rakwireless_rak11300.menu.opt.Optimize2=Optimize More (-O2)
rakwireless_rak11300.menu.opt.Optimize2.build.flags.optimize=-O2
rakwireless_rak11300.menu.opt.Optimize3=Optimize Even More (-O3)
rakwireless_rak11300.menu.opt.Optimize3.build.flags.optimize=-O3
rakwireless_rak11300.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rakwireless_rak11300.menu.opt.Fast.build.flags.optimize=-Ofast
rakwireless_rak11300.menu.opt.Debug=Debug (-Og)
rakwireless_rak11300.menu.opt.Debug.build.flags.optimize=-Og
rakwireless_rak11300.menu.rtti.Disabled=Disabled
rakwireless_rak11300.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rakwireless_rak11300.menu.rtti.Enabled=Enabled
rakwireless_rak11300.menu.rtti.Enabled.build.flags.rtti=
rakwireless_rak11300.menu.stackprotect.Disabled=Disabled
rakwireless_rak11300.menu.stackprotect.Disabled.build.flags.stackprotect=
rakwireless_rak11300.menu.stackprotect.Enabled=Enabled
rakwireless_rak11300.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rakwireless_rak11300.menu.exceptions.Disabled=Disabled
rakwireless_rak11300.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rakwireless_rak11300.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rakwireless_rak11300.menu.exceptions.Enabled=Enabled
rakwireless_rak11300.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rakwireless_rak11300.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rakwireless_rak11300.menu.dbgport.Disabled=Disabled
rakwireless_rak11300.menu.dbgport.Disabled.build.debug_port=
rakwireless_rak11300.menu.dbgport.Serial=Serial
rakwireless_rak11300.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rakwireless_rak11300.menu.dbgport.Serial1=Serial1
rakwireless_rak11300.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rakwireless_rak11300.menu.dbgport.Serial2=Serial2
rakwireless_rak11300.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rakwireless_rak11300.menu.dbglvl.None=None
rakwireless_rak11300.menu.dbglvl.None.build.debug_level=
rakwireless_rak11300.menu.dbglvl.Core=Core
rakwireless_rak11300.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rakwireless_rak11300.menu.dbglvl.SPI=SPI
rakwireless_rak11300.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rakwireless_rak11300.menu.dbglvl.Wire=Wire
rakwireless_rak11300.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rakwireless_rak11300.menu.dbglvl.Bluetooth=Bluetooth
rakwireless_rak11300.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
rakwireless_rak11300.menu.dbglvl.All=All
rakwireless_rak11300.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
rakwireless_rak11300.menu.dbglvl.NDEBUG=NDEBUG
rakwireless_rak11300.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rakwireless_rak11300.menu.usbstack.picosdk=Pico SDK
rakwireless_rak11300.menu.usbstack.picosdk.build.usbstack_flags=
rakwireless_rak11300.menu.usbstack.tinyusb=Adafruit TinyUSB
rakwireless_rak11300.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rakwireless_rak11300.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
rakwireless_rak11300.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rakwireless_rak11300.menu.usbstack.nousb=No USB
rakwireless_rak11300.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
rakwireless_rak11300.menu.ipbtstack.ipv4only=IPv4 Only
rakwireless_rak11300.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
rakwireless_rak11300.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
rakwireless_rak11300.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
rakwireless_rak11300.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
rakwireless_rak11300.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
rakwireless_rak11300.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
rakwireless_rak11300.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
rakwireless_rak11300.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
rakwireless_rak11300.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
rakwireless_rak11300.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
rakwireless_rak11300.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
rakwireless_rak11300.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
rakwireless_rak11300.menu.uploadmethod.default=Default (UF2)
rakwireless_rak11300.menu.uploadmethod.default.build.ram_length=256k
rakwireless_rak11300.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
rakwireless_rak11300.menu.uploadmethod.default.upload.maximum_data_size=262144
rakwireless_rak11300.menu.uploadmethod.default.upload.tool=uf2conv
rakwireless_rak11300.menu.uploadmethod.default.upload.tool.default=uf2conv
rakwireless_rak11300.menu.uploadmethod.default.upload.tool.network=uf2conv-network
rakwireless_rak11300.menu.uploadmethod.picotool=Picotool
rakwireless_rak11300.menu.uploadmethod.picotool.build.ram_length=256k
rakwireless_rak11300.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
rakwireless_rak11300.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
rakwireless_rak11300.menu.uploadmethod.picotool.upload.maximum_data_size=262144
rakwireless_rak11300.menu.uploadmethod.picotool.upload.tool=picotool
rakwireless_rak11300.menu.uploadmethod.picotool.upload.tool.default=picotool
rakwireless_rak11300.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
rakwireless_rak11300.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
rakwireless_rak11300.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
rakwireless_rak11300.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
rakwireless_rak11300.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
rakwireless_rak11300.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
rakwireless_rak11300.menu.uploadmethod.picodebug=Pico-Debug
rakwireless_rak11300.menu.uploadmethod.picodebug.build.ram_length=240k
rakwireless_rak11300.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
rakwireless_rak11300.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
rakwireless_rak11300.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
rakwireless_rak11300.menu.uploadmethod.picodebug.upload.tool=picodebug
rakwireless_rak11300.menu.uploadmethod.picodebug.upload.tool.default=picodebug

