earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# redscorp RP2040-Eins
# -----------------------------------
redscorp_rp2040_eins.name=redscorp RP2040-Eins
redscorp_rp2040_eins.vid.0=0x2341
redscorp_rp2040_eins.pid.0=0x005f
redscorp_rp2040_eins.vid.1=0x2341
redscorp_rp2040_eins.pid.1=0x805f
redscorp_rp2040_eins.vid.2=0x2341
redscorp_rp2040_eins.pid.2=0x015f
redscorp_rp2040_eins.vid.3=0x2341
redscorp_rp2040_eins.pid.3=0x025f
redscorp_rp2040_eins.upload_port.0.vid=0x2341
redscorp_rp2040_eins.upload_port.0.pid=0x005f
redscorp_rp2040_eins.upload_port.1.vid=0x2341
redscorp_rp2040_eins.upload_port.1.pid=0x805f
redscorp_rp2040_eins.upload_port.2.vid=0x2341
redscorp_rp2040_eins.upload_port.2.pid=0x015f
redscorp_rp2040_eins.upload_port.3.vid=0x2341
redscorp_rp2040_eins.upload_port.3.pid=0x025f
redscorp_rp2040_eins.build.usbvid=-DUSBD_VID=0x2341
redscorp_rp2040_eins.build.usbpid=-DUSBD_PID=0x005f
redscorp_rp2040_eins.build.usbpwr=-DUSBD_MAX_POWER_MA=250
redscorp_rp2040_eins.build.board=REDSCORP_RP2040_EINS
redscorp_rp2040_eins.build.mcu=cortex-m0plus
redscorp_rp2040_eins.build.variant=redscorp_rp2040_eins
redscorp_rp2040_eins.upload.maximum_size=16777216
redscorp_rp2040_eins.upload.wait_for_upload_port=true
redscorp_rp2040_eins.upload.erase_cmd=
redscorp_rp2040_eins.serial.disableDTR=false
redscorp_rp2040_eins.serial.disableRTS=false
redscorp_rp2040_eins.build.f_cpu=125000000
redscorp_rp2040_eins.build.led=
redscorp_rp2040_eins.build.core=rp2040
redscorp_rp2040_eins.build.ldscript=memmap_default.ld
redscorp_rp2040_eins.build.boot2=boot2_w25q080_2_padded_checksum
redscorp_rp2040_eins.build.usb_manufacturer="redscorp"
redscorp_rp2040_eins.build.usb_product="RP2040-Eins"
redscorp_rp2040_eins.menu.flash.16777216_0=16MB (no FS)
redscorp_rp2040_eins.menu.flash.16777216_0.upload.maximum_size=16773120
redscorp_rp2040_eins.menu.flash.16777216_0.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_0.build.flash_length=16773120
redscorp_rp2040_eins.menu.flash.16777216_0.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_0.build.fs_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_0.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
redscorp_rp2040_eins.menu.flash.16777216_65536.upload.maximum_size=16707584
redscorp_rp2040_eins.menu.flash.16777216_65536.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_65536.build.flash_length=16707584
redscorp_rp2040_eins.menu.flash.16777216_65536.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_65536.build.fs_start=285143040
redscorp_rp2040_eins.menu.flash.16777216_65536.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
redscorp_rp2040_eins.menu.flash.16777216_131072.upload.maximum_size=16642048
redscorp_rp2040_eins.menu.flash.16777216_131072.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_131072.build.flash_length=16642048
redscorp_rp2040_eins.menu.flash.16777216_131072.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_131072.build.fs_start=285077504
redscorp_rp2040_eins.menu.flash.16777216_131072.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
redscorp_rp2040_eins.menu.flash.16777216_262144.upload.maximum_size=16510976
redscorp_rp2040_eins.menu.flash.16777216_262144.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_262144.build.flash_length=16510976
redscorp_rp2040_eins.menu.flash.16777216_262144.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_262144.build.fs_start=284946432
redscorp_rp2040_eins.menu.flash.16777216_262144.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
redscorp_rp2040_eins.menu.flash.16777216_524288.upload.maximum_size=16248832
redscorp_rp2040_eins.menu.flash.16777216_524288.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_524288.build.flash_length=16248832
redscorp_rp2040_eins.menu.flash.16777216_524288.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_524288.build.fs_start=284684288
redscorp_rp2040_eins.menu.flash.16777216_524288.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
redscorp_rp2040_eins.menu.flash.16777216_1048576.upload.maximum_size=15724544
redscorp_rp2040_eins.menu.flash.16777216_1048576.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_1048576.build.flash_length=15724544
redscorp_rp2040_eins.menu.flash.16777216_1048576.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_1048576.build.fs_start=284160000
redscorp_rp2040_eins.menu.flash.16777216_1048576.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
redscorp_rp2040_eins.menu.flash.16777216_2097152.upload.maximum_size=14675968
redscorp_rp2040_eins.menu.flash.16777216_2097152.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_2097152.build.flash_length=14675968
redscorp_rp2040_eins.menu.flash.16777216_2097152.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_2097152.build.fs_start=283111424
redscorp_rp2040_eins.menu.flash.16777216_2097152.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
redscorp_rp2040_eins.menu.flash.16777216_3145728.upload.maximum_size=13627392
redscorp_rp2040_eins.menu.flash.16777216_3145728.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_3145728.build.flash_length=13627392
redscorp_rp2040_eins.menu.flash.16777216_3145728.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_3145728.build.fs_start=282062848
redscorp_rp2040_eins.menu.flash.16777216_3145728.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
redscorp_rp2040_eins.menu.flash.16777216_4194304.upload.maximum_size=12578816
redscorp_rp2040_eins.menu.flash.16777216_4194304.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_4194304.build.flash_length=12578816
redscorp_rp2040_eins.menu.flash.16777216_4194304.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_4194304.build.fs_start=281014272
redscorp_rp2040_eins.menu.flash.16777216_4194304.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
redscorp_rp2040_eins.menu.flash.16777216_5242880.upload.maximum_size=11530240
redscorp_rp2040_eins.menu.flash.16777216_5242880.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_5242880.build.flash_length=11530240
redscorp_rp2040_eins.menu.flash.16777216_5242880.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_5242880.build.fs_start=279965696
redscorp_rp2040_eins.menu.flash.16777216_5242880.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
redscorp_rp2040_eins.menu.flash.16777216_6291456.upload.maximum_size=10481664
redscorp_rp2040_eins.menu.flash.16777216_6291456.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_6291456.build.flash_length=10481664
redscorp_rp2040_eins.menu.flash.16777216_6291456.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_6291456.build.fs_start=278917120
redscorp_rp2040_eins.menu.flash.16777216_6291456.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
redscorp_rp2040_eins.menu.flash.16777216_7340032.upload.maximum_size=9433088
redscorp_rp2040_eins.menu.flash.16777216_7340032.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_7340032.build.flash_length=9433088
redscorp_rp2040_eins.menu.flash.16777216_7340032.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_7340032.build.fs_start=277868544
redscorp_rp2040_eins.menu.flash.16777216_7340032.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
redscorp_rp2040_eins.menu.flash.16777216_8388608.upload.maximum_size=8384512
redscorp_rp2040_eins.menu.flash.16777216_8388608.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_8388608.build.flash_length=8384512
redscorp_rp2040_eins.menu.flash.16777216_8388608.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_8388608.build.fs_start=276819968
redscorp_rp2040_eins.menu.flash.16777216_8388608.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
redscorp_rp2040_eins.menu.flash.16777216_9437184.upload.maximum_size=7335936
redscorp_rp2040_eins.menu.flash.16777216_9437184.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_9437184.build.flash_length=7335936
redscorp_rp2040_eins.menu.flash.16777216_9437184.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_9437184.build.fs_start=275771392
redscorp_rp2040_eins.menu.flash.16777216_9437184.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
redscorp_rp2040_eins.menu.flash.16777216_10485760.upload.maximum_size=6287360
redscorp_rp2040_eins.menu.flash.16777216_10485760.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_10485760.build.flash_length=6287360
redscorp_rp2040_eins.menu.flash.16777216_10485760.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_10485760.build.fs_start=274722816
redscorp_rp2040_eins.menu.flash.16777216_10485760.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
redscorp_rp2040_eins.menu.flash.16777216_11534336.upload.maximum_size=5238784
redscorp_rp2040_eins.menu.flash.16777216_11534336.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_11534336.build.flash_length=5238784
redscorp_rp2040_eins.menu.flash.16777216_11534336.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_11534336.build.fs_start=273674240
redscorp_rp2040_eins.menu.flash.16777216_11534336.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
redscorp_rp2040_eins.menu.flash.16777216_12582912.upload.maximum_size=4190208
redscorp_rp2040_eins.menu.flash.16777216_12582912.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_12582912.build.flash_length=4190208
redscorp_rp2040_eins.menu.flash.16777216_12582912.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_12582912.build.fs_start=272625664
redscorp_rp2040_eins.menu.flash.16777216_12582912.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
redscorp_rp2040_eins.menu.flash.16777216_13631488.upload.maximum_size=3141632
redscorp_rp2040_eins.menu.flash.16777216_13631488.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_13631488.build.flash_length=3141632
redscorp_rp2040_eins.menu.flash.16777216_13631488.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_13631488.build.fs_start=271577088
redscorp_rp2040_eins.menu.flash.16777216_13631488.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
redscorp_rp2040_eins.menu.flash.16777216_14680064.upload.maximum_size=2093056
redscorp_rp2040_eins.menu.flash.16777216_14680064.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_14680064.build.flash_length=2093056
redscorp_rp2040_eins.menu.flash.16777216_14680064.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_14680064.build.fs_start=270528512
redscorp_rp2040_eins.menu.flash.16777216_14680064.build.fs_end=285208576
redscorp_rp2040_eins.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
redscorp_rp2040_eins.menu.flash.16777216_15728640.upload.maximum_size=1044480
redscorp_rp2040_eins.menu.flash.16777216_15728640.build.flash_total=16777216
redscorp_rp2040_eins.menu.flash.16777216_15728640.build.flash_length=1044480
redscorp_rp2040_eins.menu.flash.16777216_15728640.build.eeprom_start=285208576
redscorp_rp2040_eins.menu.flash.16777216_15728640.build.fs_start=269479936
redscorp_rp2040_eins.menu.flash.16777216_15728640.build.fs_end=285208576
redscorp_rp2040_eins.menu.freq.133=133 MHz
redscorp_rp2040_eins.menu.freq.133.build.f_cpu=133000000L
redscorp_rp2040_eins.menu.freq.50=50 MHz
redscorp_rp2040_eins.menu.freq.50.build.f_cpu=50000000L
redscorp_rp2040_eins.menu.freq.100=100 MHz
redscorp_rp2040_eins.menu.freq.100.build.f_cpu=100000000L
redscorp_rp2040_eins.menu.freq.120=120 MHz
redscorp_rp2040_eins.menu.freq.120.build.f_cpu=120000000L
redscorp_rp2040_eins.menu.freq.125=125 MHz
redscorp_rp2040_eins.menu.freq.125.build.f_cpu=125000000L
redscorp_rp2040_eins.menu.freq.128=128 MHz
redscorp_rp2040_eins.menu.freq.128.build.f_cpu=128000000L
redscorp_rp2040_eins.menu.freq.150=150 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.150.build.f_cpu=150000000L
redscorp_rp2040_eins.menu.freq.175=175 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.175.build.f_cpu=175000000L
redscorp_rp2040_eins.menu.freq.200=200 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.200.build.f_cpu=200000000L
redscorp_rp2040_eins.menu.freq.225=225 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.225.build.f_cpu=225000000L
redscorp_rp2040_eins.menu.freq.240=240 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.240.build.f_cpu=240000000L
redscorp_rp2040_eins.menu.freq.250=250 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.250.build.f_cpu=250000000L
redscorp_rp2040_eins.menu.freq.275=275 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.275.build.f_cpu=275000000L
redscorp_rp2040_eins.menu.freq.300=300 MHz (Overclock)
redscorp_rp2040_eins.menu.freq.300.build.f_cpu=300000000L
redscorp_rp2040_eins.menu.opt.Small=Small (-Os) (standard)
redscorp_rp2040_eins.menu.opt.Small.build.flags.optimize=-Os
redscorp_rp2040_eins.menu.opt.Optimize=Optimize (-O)
redscorp_rp2040_eins.menu.opt.Optimize.build.flags.optimize=-O
redscorp_rp2040_eins.menu.opt.Optimize2=Optimize More (-O2)
redscorp_rp2040_eins.menu.opt.Optimize2.build.flags.optimize=-O2
redscorp_rp2040_eins.menu.opt.Optimize3=Optimize Even More (-O3)
redscorp_rp2040_eins.menu.opt.Optimize3.build.flags.optimize=-O3
redscorp_rp2040_eins.menu.opt.Fast=Fast (-Ofast) (maybe slower)
redscorp_rp2040_eins.menu.opt.Fast.build.flags.optimize=-Ofast
redscorp_rp2040_eins.menu.opt.Debug=Debug (-Og)
redscorp_rp2040_eins.menu.opt.Debug.build.flags.optimize=-Og
redscorp_rp2040_eins.menu.rtti.Disabled=Disabled
redscorp_rp2040_eins.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
redscorp_rp2040_eins.menu.rtti.Enabled=Enabled
redscorp_rp2040_eins.menu.rtti.Enabled.build.flags.rtti=
redscorp_rp2040_eins.menu.stackprotect.Disabled=Disabled
redscorp_rp2040_eins.menu.stackprotect.Disabled.build.flags.stackprotect=
redscorp_rp2040_eins.menu.stackprotect.Enabled=Enabled
redscorp_rp2040_eins.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
redscorp_rp2040_eins.menu.exceptions.Disabled=Disabled
redscorp_rp2040_eins.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
redscorp_rp2040_eins.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
redscorp_rp2040_eins.menu.exceptions.Enabled=Enabled
redscorp_rp2040_eins.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
redscorp_rp2040_eins.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
redscorp_rp2040_eins.menu.dbgport.Disabled=Disabled
redscorp_rp2040_eins.menu.dbgport.Disabled.build.debug_port=
redscorp_rp2040_eins.menu.dbgport.Serial=Serial
redscorp_rp2040_eins.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
redscorp_rp2040_eins.menu.dbgport.Serial1=Serial1
redscorp_rp2040_eins.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
redscorp_rp2040_eins.menu.dbgport.Serial2=Serial2
redscorp_rp2040_eins.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
redscorp_rp2040_eins.menu.dbglvl.None=None
redscorp_rp2040_eins.menu.dbglvl.None.build.debug_level=
redscorp_rp2040_eins.menu.dbglvl.Core=Core
redscorp_rp2040_eins.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
redscorp_rp2040_eins.menu.dbglvl.SPI=SPI
redscorp_rp2040_eins.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
redscorp_rp2040_eins.menu.dbglvl.Wire=Wire
redscorp_rp2040_eins.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
redscorp_rp2040_eins.menu.dbglvl.Bluetooth=Bluetooth
redscorp_rp2040_eins.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
redscorp_rp2040_eins.menu.dbglvl.All=All
redscorp_rp2040_eins.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
redscorp_rp2040_eins.menu.dbglvl.NDEBUG=NDEBUG
redscorp_rp2040_eins.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
redscorp_rp2040_eins.menu.usbstack.picosdk=Pico SDK
redscorp_rp2040_eins.menu.usbstack.picosdk.build.usbstack_flags=
redscorp_rp2040_eins.menu.usbstack.tinyusb=Adafruit TinyUSB
redscorp_rp2040_eins.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
redscorp_rp2040_eins.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
redscorp_rp2040_eins.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
redscorp_rp2040_eins.menu.usbstack.nousb=No USB
redscorp_rp2040_eins.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
redscorp_rp2040_eins.menu.ipbtstack.ipv4only=IPv4 Only
redscorp_rp2040_eins.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
