earlephilhower/arduino-pico/boards.txt
redscorp_rp2040_promini.menu.freq.240=240 MHz (Overclock)
redscorp_rp2040_promini.menu.freq.240.build.f_cpu=240000000L
redscorp_rp2040_promini.menu.freq.250=250 MHz (Overclock)
redscorp_rp2040_promini.menu.freq.250.build.f_cpu=250000000L
redscorp_rp2040_promini.menu.freq.275=275 MHz (Overclock)
redscorp_rp2040_promini.menu.freq.275.build.f_cpu=275000000L
redscorp_rp2040_promini.menu.freq.300=300 MHz (Overclock)
redscorp_rp2040_promini.menu.freq.300.build.f_cpu=300000000L
redscorp_rp2040_promini.menu.opt.Small=Small (-Os) (standard)
redscorp_rp2040_promini.menu.opt.Small.build.flags.optimize=-Os
redscorp_rp2040_promini.menu.opt.Optimize=Optimize (-O)
redscorp_rp2040_promini.menu.opt.Optimize.build.flags.optimize=-O
redscorp_rp2040_promini.menu.opt.Optimize2=Optimize More (-O2)
redscorp_rp2040_promini.menu.opt.Optimize2.build.flags.optimize=-O2
redscorp_rp2040_promini.menu.opt.Optimize3=Optimize Even More (-O3)
redscorp_rp2040_promini.menu.opt.Optimize3.build.flags.optimize=-O3
redscorp_rp2040_promini.menu.opt.Fast=Fast (-Ofast) (maybe slower)
redscorp_rp2040_promini.menu.opt.Fast.build.flags.optimize=-Ofast
redscorp_rp2040_promini.menu.opt.Debug=Debug (-Og)
redscorp_rp2040_promini.menu.opt.Debug.build.flags.optimize=-Og
redscorp_rp2040_promini.menu.rtti.Disabled=Disabled
redscorp_rp2040_promini.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
redscorp_rp2040_promini.menu.rtti.Enabled=Enabled
redscorp_rp2040_promini.menu.rtti.Enabled.build.flags.rtti=
redscorp_rp2040_promini.menu.stackprotect.Disabled=Disabled
redscorp_rp2040_promini.menu.stackprotect.Disabled.build.flags.stackprotect=
redscorp_rp2040_promini.menu.stackprotect.Enabled=Enabled
redscorp_rp2040_promini.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
redscorp_rp2040_promini.menu.exceptions.Disabled=Disabled
redscorp_rp2040_promini.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
redscorp_rp2040_promini.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
redscorp_rp2040_promini.menu.exceptions.Enabled=Enabled
redscorp_rp2040_promini.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
redscorp_rp2040_promini.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
redscorp_rp2040_promini.menu.dbgport.Disabled=Disabled
redscorp_rp2040_promini.menu.dbgport.Disabled.build.debug_port=
redscorp_rp2040_promini.menu.dbgport.Serial=Serial
redscorp_rp2040_promini.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
redscorp_rp2040_promini.menu.dbgport.Serial1=Serial1
redscorp_rp2040_promini.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
redscorp_rp2040_promini.menu.dbgport.Serial2=Serial2
redscorp_rp2040_promini.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
redscorp_rp2040_promini.menu.dbglvl.None=None
redscorp_rp2040_promini.menu.dbglvl.None.build.debug_level=
redscorp_rp2040_promini.menu.dbglvl.Core=Core
redscorp_rp2040_promini.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
redscorp_rp2040_promini.menu.dbglvl.SPI=SPI
redscorp_rp2040_promini.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
redscorp_rp2040_promini.menu.dbglvl.Wire=Wire
redscorp_rp2040_promini.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
redscorp_rp2040_promini.menu.dbglvl.Bluetooth=Bluetooth
redscorp_rp2040_promini.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
redscorp_rp2040_promini.menu.dbglvl.All=All
redscorp_rp2040_promini.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
redscorp_rp2040_promini.menu.dbglvl.NDEBUG=NDEBUG
redscorp_rp2040_promini.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
redscorp_rp2040_promini.menu.usbstack.picosdk=Pico SDK
redscorp_rp2040_promini.menu.usbstack.picosdk.build.usbstack_flags=
redscorp_rp2040_promini.menu.usbstack.tinyusb=Adafruit TinyUSB
redscorp_rp2040_promini.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
redscorp_rp2040_promini.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
redscorp_rp2040_promini.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
redscorp_rp2040_promini.menu.usbstack.nousb=No USB
redscorp_rp2040_promini.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
redscorp_rp2040_promini.menu.ipbtstack.ipv4only=IPv4 Only
redscorp_rp2040_promini.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
redscorp_rp2040_promini.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
redscorp_rp2040_promini.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
redscorp_rp2040_promini.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
redscorp_rp2040_promini.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_promini.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
redscorp_rp2040_promini.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
redscorp_rp2040_promini.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_promini.menu.uploadmethod.default=Default (UF2)
redscorp_rp2040_promini.menu.uploadmethod.default.build.ram_length=256k
redscorp_rp2040_promini.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
redscorp_rp2040_promini.menu.uploadmethod.default.upload.maximum_data_size=262144
redscorp_rp2040_promini.menu.uploadmethod.default.upload.tool=uf2conv
redscorp_rp2040_promini.menu.uploadmethod.default.upload.tool.default=uf2conv
redscorp_rp2040_promini.menu.uploadmethod.default.upload.tool.network=uf2conv-network
redscorp_rp2040_promini.menu.uploadmethod.picotool=Picotool
redscorp_rp2040_promini.menu.uploadmethod.picotool.build.ram_length=256k
redscorp_rp2040_promini.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
redscorp_rp2040_promini.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
redscorp_rp2040_promini.menu.uploadmethod.picotool.upload.maximum_data_size=262144
redscorp_rp2040_promini.menu.uploadmethod.picotool.upload.tool=picotool
redscorp_rp2040_promini.menu.uploadmethod.picotool.upload.tool.default=picotool
redscorp_rp2040_promini.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
redscorp_rp2040_promini.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
redscorp_rp2040_promini.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
redscorp_rp2040_promini.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
redscorp_rp2040_promini.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
redscorp_rp2040_promini.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
redscorp_rp2040_promini.menu.uploadmethod.picodebug=Pico-Debug
redscorp_rp2040_promini.menu.uploadmethod.picodebug.build.ram_length=240k
redscorp_rp2040_promini.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
redscorp_rp2040_promini.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
redscorp_rp2040_promini.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
redscorp_rp2040_promini.menu.uploadmethod.picodebug.upload.tool=picodebug
redscorp_rp2040_promini.menu.uploadmethod.picodebug.upload.tool.default=picodebug

