earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Silicognition RP2040-Shim
# -----------------------------------
silicognition_rp2040_shim.name=Silicognition RP2040-Shim
silicognition_rp2040_shim.vid.0=0x1209
silicognition_rp2040_shim.pid.0=0xf502
silicognition_rp2040_shim.upload_port.0.vid=0x1209
silicognition_rp2040_shim.upload_port.0.pid=0xf502
silicognition_rp2040_shim.build.usbvid=-DUSBD_VID=0x1209
silicognition_rp2040_shim.build.usbpid=-DUSBD_PID=0xf502
silicognition_rp2040_shim.build.usbpwr=-DUSBD_MAX_POWER_MA=500
silicognition_rp2040_shim.build.board=SILICOGNITION_RP2040_SHIM
silicognition_rp2040_shim.build.mcu=cortex-m0plus
silicognition_rp2040_shim.build.variant=silicognition_rp2040_shim
silicognition_rp2040_shim.upload.maximum_size=4194304
silicognition_rp2040_shim.upload.wait_for_upload_port=true
silicognition_rp2040_shim.upload.erase_cmd=
silicognition_rp2040_shim.serial.disableDTR=false
silicognition_rp2040_shim.serial.disableRTS=false
silicognition_rp2040_shim.build.f_cpu=125000000
silicognition_rp2040_shim.build.led=
silicognition_rp2040_shim.build.core=rp2040
silicognition_rp2040_shim.build.ldscript=memmap_default.ld
silicognition_rp2040_shim.build.boot2=boot2_generic_03h_4_padded_checksum
silicognition_rp2040_shim.build.usb_manufacturer="Silicognition"
silicognition_rp2040_shim.build.usb_product="RP2040-Shim"
silicognition_rp2040_shim.menu.flash.4194304_0=4MB (no FS)
silicognition_rp2040_shim.menu.flash.4194304_0.upload.maximum_size=4190208
silicognition_rp2040_shim.menu.flash.4194304_0.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_0.build.flash_length=4190208
silicognition_rp2040_shim.menu.flash.4194304_0.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_0.build.fs_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_0.build.fs_end=272625664
silicognition_rp2040_shim.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
silicognition_rp2040_shim.menu.flash.4194304_65536.upload.maximum_size=4124672
silicognition_rp2040_shim.menu.flash.4194304_65536.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_65536.build.flash_length=4124672
silicognition_rp2040_shim.menu.flash.4194304_65536.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_65536.build.fs_start=272560128
silicognition_rp2040_shim.menu.flash.4194304_65536.build.fs_end=272625664
silicognition_rp2040_shim.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
silicognition_rp2040_shim.menu.flash.4194304_131072.upload.maximum_size=4059136
silicognition_rp2040_shim.menu.flash.4194304_131072.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_131072.build.flash_length=4059136
silicognition_rp2040_shim.menu.flash.4194304_131072.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_131072.build.fs_start=272494592
silicognition_rp2040_shim.menu.flash.4194304_131072.build.fs_end=272625664
silicognition_rp2040_shim.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
silicognition_rp2040_shim.menu.flash.4194304_262144.upload.maximum_size=3928064
silicognition_rp2040_shim.menu.flash.4194304_262144.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_262144.build.flash_length=3928064
silicognition_rp2040_shim.menu.flash.4194304_262144.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_262144.build.fs_start=272363520
silicognition_rp2040_shim.menu.flash.4194304_262144.build.fs_end=272625664
silicognition_rp2040_shim.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
silicognition_rp2040_shim.menu.flash.4194304_524288.upload.maximum_size=3665920
silicognition_rp2040_shim.menu.flash.4194304_524288.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_524288.build.flash_length=3665920
silicognition_rp2040_shim.menu.flash.4194304_524288.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_524288.build.fs_start=272101376
silicognition_rp2040_shim.menu.flash.4194304_524288.build.fs_end=272625664
silicognition_rp2040_shim.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
silicognition_rp2040_shim.menu.flash.4194304_1048576.upload.maximum_size=3141632
silicognition_rp2040_shim.menu.flash.4194304_1048576.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_1048576.build.flash_length=3141632
silicognition_rp2040_shim.menu.flash.4194304_1048576.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_1048576.build.fs_start=271577088
silicognition_rp2040_shim.menu.flash.4194304_1048576.build.fs_end=272625664
silicognition_rp2040_shim.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
silicognition_rp2040_shim.menu.flash.4194304_2097152.upload.maximum_size=2093056
silicognition_rp2040_shim.menu.flash.4194304_2097152.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_2097152.build.flash_length=2093056
silicognition_rp2040_shim.menu.flash.4194304_2097152.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_2097152.build.fs_start=270528512
silicognition_rp2040_shim.menu.flash.4194304_2097152.build.fs_end=272625664
silicognition_rp2040_shim.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
silicognition_rp2040_shim.menu.flash.4194304_3145728.upload.maximum_size=1044480
silicognition_rp2040_shim.menu.flash.4194304_3145728.build.flash_total=4194304
silicognition_rp2040_shim.menu.flash.4194304_3145728.build.flash_length=1044480
silicognition_rp2040_shim.menu.flash.4194304_3145728.build.eeprom_start=272625664
silicognition_rp2040_shim.menu.flash.4194304_3145728.build.fs_start=269479936
silicognition_rp2040_shim.menu.flash.4194304_3145728.build.fs_end=272625664
silicognition_rp2040_shim.menu.freq.133=133 MHz
silicognition_rp2040_shim.menu.freq.133.build.f_cpu=133000000L
silicognition_rp2040_shim.menu.freq.50=50 MHz
silicognition_rp2040_shim.menu.freq.50.build.f_cpu=50000000L
silicognition_rp2040_shim.menu.freq.100=100 MHz
silicognition_rp2040_shim.menu.freq.100.build.f_cpu=100000000L
silicognition_rp2040_shim.menu.freq.120=120 MHz
silicognition_rp2040_shim.menu.freq.120.build.f_cpu=120000000L
silicognition_rp2040_shim.menu.freq.125=125 MHz
silicognition_rp2040_shim.menu.freq.125.build.f_cpu=125000000L
silicognition_rp2040_shim.menu.freq.128=128 MHz
silicognition_rp2040_shim.menu.freq.128.build.f_cpu=128000000L
silicognition_rp2040_shim.menu.freq.150=150 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.150.build.f_cpu=150000000L
silicognition_rp2040_shim.menu.freq.175=175 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.175.build.f_cpu=175000000L
silicognition_rp2040_shim.menu.freq.200=200 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.200.build.f_cpu=200000000L
silicognition_rp2040_shim.menu.freq.225=225 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.225.build.f_cpu=225000000L
silicognition_rp2040_shim.menu.freq.240=240 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.240.build.f_cpu=240000000L
silicognition_rp2040_shim.menu.freq.250=250 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.250.build.f_cpu=250000000L
silicognition_rp2040_shim.menu.freq.275=275 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.275.build.f_cpu=275000000L
silicognition_rp2040_shim.menu.freq.300=300 MHz (Overclock)
silicognition_rp2040_shim.menu.freq.300.build.f_cpu=300000000L
silicognition_rp2040_shim.menu.opt.Small=Small (-Os) (standard)
silicognition_rp2040_shim.menu.opt.Small.build.flags.optimize=-Os
silicognition_rp2040_shim.menu.opt.Optimize=Optimize (-O)
silicognition_rp2040_shim.menu.opt.Optimize.build.flags.optimize=-O
silicognition_rp2040_shim.menu.opt.Optimize2=Optimize More (-O2)
silicognition_rp2040_shim.menu.opt.Optimize2.build.flags.optimize=-O2
silicognition_rp2040_shim.menu.opt.Optimize3=Optimize Even More (-O3)
silicognition_rp2040_shim.menu.opt.Optimize3.build.flags.optimize=-O3
silicognition_rp2040_shim.menu.opt.Fast=Fast (-Ofast) (maybe slower)
silicognition_rp2040_shim.menu.opt.Fast.build.flags.optimize=-Ofast
silicognition_rp2040_shim.menu.opt.Debug=Debug (-Og)
silicognition_rp2040_shim.menu.opt.Debug.build.flags.optimize=-Og
silicognition_rp2040_shim.menu.rtti.Disabled=Disabled
silicognition_rp2040_shim.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
silicognition_rp2040_shim.menu.rtti.Enabled=Enabled
silicognition_rp2040_shim.menu.rtti.Enabled.build.flags.rtti=
silicognition_rp2040_shim.menu.stackprotect.Disabled=Disabled
silicognition_rp2040_shim.menu.stackprotect.Disabled.build.flags.stackprotect=
silicognition_rp2040_shim.menu.stackprotect.Enabled=Enabled
silicognition_rp2040_shim.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
silicognition_rp2040_shim.menu.exceptions.Disabled=Disabled
silicognition_rp2040_shim.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
silicognition_rp2040_shim.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
silicognition_rp2040_shim.menu.exceptions.Enabled=Enabled
silicognition_rp2040_shim.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
silicognition_rp2040_shim.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
silicognition_rp2040_shim.menu.dbgport.Disabled=Disabled
silicognition_rp2040_shim.menu.dbgport.Disabled.build.debug_port=
silicognition_rp2040_shim.menu.dbgport.Serial=Serial
silicognition_rp2040_shim.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
silicognition_rp2040_shim.menu.dbgport.Serial1=Serial1
silicognition_rp2040_shim.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
silicognition_rp2040_shim.menu.dbgport.Serial2=Serial2
silicognition_rp2040_shim.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
silicognition_rp2040_shim.menu.dbglvl.None=None
silicognition_rp2040_shim.menu.dbglvl.None.build.debug_level=
silicognition_rp2040_shim.menu.dbglvl.Core=Core
silicognition_rp2040_shim.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
silicognition_rp2040_shim.menu.dbglvl.SPI=SPI
silicognition_rp2040_shim.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
silicognition_rp2040_shim.menu.dbglvl.Wire=Wire
silicognition_rp2040_shim.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
silicognition_rp2040_shim.menu.dbglvl.Bluetooth=Bluetooth
silicognition_rp2040_shim.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
silicognition_rp2040_shim.menu.dbglvl.All=All
silicognition_rp2040_shim.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
silicognition_rp2040_shim.menu.dbglvl.NDEBUG=NDEBUG
silicognition_rp2040_shim.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
silicognition_rp2040_shim.menu.usbstack.picosdk=Pico SDK
silicognition_rp2040_shim.menu.usbstack.picosdk.build.usbstack_flags=
silicognition_rp2040_shim.menu.usbstack.tinyusb=Adafruit TinyUSB
silicognition_rp2040_shim.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
silicognition_rp2040_shim.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
silicognition_rp2040_shim.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
silicognition_rp2040_shim.menu.usbstack.nousb=No USB
silicognition_rp2040_shim.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
silicognition_rp2040_shim.menu.ipbtstack.ipv4only=IPv4 Only
silicognition_rp2040_shim.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
silicognition_rp2040_shim.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
silicognition_rp2040_shim.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
silicognition_rp2040_shim.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
silicognition_rp2040_shim.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
silicognition_rp2040_shim.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
silicognition_rp2040_shim.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
silicognition_rp2040_shim.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
silicognition_rp2040_shim.menu.uploadmethod.default=Default (UF2)
silicognition_rp2040_shim.menu.uploadmethod.default.build.ram_length=256k
silicognition_rp2040_shim.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
silicognition_rp2040_shim.menu.uploadmethod.default.upload.maximum_data_size=262144
silicognition_rp2040_shim.menu.uploadmethod.default.upload.tool=uf2conv
silicognition_rp2040_shim.menu.uploadmethod.default.upload.tool.default=uf2conv
silicognition_rp2040_shim.menu.uploadmethod.default.upload.tool.network=uf2conv-network
silicognition_rp2040_shim.menu.uploadmethod.picotool=Picotool
silicognition_rp2040_shim.menu.uploadmethod.picotool.build.ram_length=256k
silicognition_rp2040_shim.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
silicognition_rp2040_shim.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
silicognition_rp2040_shim.menu.uploadmethod.picotool.upload.maximum_data_size=262144
silicognition_rp2040_shim.menu.uploadmethod.picotool.upload.tool=picotool
silicognition_rp2040_shim.menu.uploadmethod.picotool.upload.tool.default=picotool
silicognition_rp2040_shim.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
silicognition_rp2040_shim.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
silicognition_rp2040_shim.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
silicognition_rp2040_shim.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
silicognition_rp2040_shim.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
silicognition_rp2040_shim.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
silicognition_rp2040_shim.menu.uploadmethod.picodebug=Pico-Debug
silicognition_rp2040_shim.menu.uploadmethod.picodebug.build.ram_length=240k
silicognition_rp2040_shim.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
silicognition_rp2040_shim.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
silicognition_rp2040_shim.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
silicognition_rp2040_shim.menu.uploadmethod.picodebug.upload.tool=picodebug
silicognition_rp2040_shim.menu.uploadmethod.picodebug.upload.tool.default=picodebug

