earlephilhower/arduino-pico/boards.txt
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.upload.tool=picodebug
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# SparkFun MicroMod RP2040
# -----------------------------------
sparkfun_micromodrp2040.name=SparkFun MicroMod RP2040
sparkfun_micromodrp2040.vid.0=0x1b4f
sparkfun_micromodrp2040.pid.0=0x0026
sparkfun_micromodrp2040.vid.1=0x1b4f
sparkfun_micromodrp2040.pid.1=0x0126
sparkfun_micromodrp2040.vid.2=0x1b4f
sparkfun_micromodrp2040.pid.2=0x4026
sparkfun_micromodrp2040.vid.3=0x1b4f
sparkfun_micromodrp2040.pid.3=0x4126
sparkfun_micromodrp2040.vid.4=0x1b4f
sparkfun_micromodrp2040.pid.4=0x8026
sparkfun_micromodrp2040.vid.5=0x1b4f
sparkfun_micromodrp2040.pid.5=0x8126
sparkfun_micromodrp2040.vid.6=0x1b4f
sparkfun_micromodrp2040.pid.6=0xc026
sparkfun_micromodrp2040.vid.7=0x1b4f
sparkfun_micromodrp2040.pid.7=0xc126
sparkfun_micromodrp2040.upload_port.0.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.0.pid=0x0026
sparkfun_micromodrp2040.upload_port.1.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.1.pid=0x0126
sparkfun_micromodrp2040.upload_port.2.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.2.pid=0x4026
sparkfun_micromodrp2040.upload_port.3.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.3.pid=0x4126
sparkfun_micromodrp2040.upload_port.4.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.4.pid=0x8026
sparkfun_micromodrp2040.upload_port.5.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.5.pid=0x8126
sparkfun_micromodrp2040.upload_port.6.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.6.pid=0xc026
sparkfun_micromodrp2040.upload_port.7.vid=0x1b4f
sparkfun_micromodrp2040.upload_port.7.pid=0xc126
sparkfun_micromodrp2040.build.usbvid=-DUSBD_VID=0x1b4f
sparkfun_micromodrp2040.build.usbpid=-DUSBD_PID=0x0026
sparkfun_micromodrp2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250
sparkfun_micromodrp2040.build.board=SPARKFUN_MICROMOD_RP2040
sparkfun_micromodrp2040.build.mcu=cortex-m0plus
sparkfun_micromodrp2040.build.variant=sparkfun_micromodrp2040
sparkfun_micromodrp2040.upload.maximum_size=16777216
sparkfun_micromodrp2040.upload.wait_for_upload_port=true
sparkfun_micromodrp2040.upload.erase_cmd=
sparkfun_micromodrp2040.serial.disableDTR=false
sparkfun_micromodrp2040.serial.disableRTS=false
sparkfun_micromodrp2040.build.f_cpu=125000000
sparkfun_micromodrp2040.build.led=
sparkfun_micromodrp2040.build.core=rp2040
sparkfun_micromodrp2040.build.ldscript=memmap_default.ld
sparkfun_micromodrp2040.build.boot2=boot2_w25q080_2_padded_checksum
sparkfun_micromodrp2040.build.usb_manufacturer="SparkFun"
sparkfun_micromodrp2040.build.usb_product="MicroMod RP2040"
sparkfun_micromodrp2040.menu.flash.16777216_0=16MB (no FS)
sparkfun_micromodrp2040.menu.flash.16777216_0.upload.maximum_size=16773120
sparkfun_micromodrp2040.menu.flash.16777216_0.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_0.build.flash_length=16773120
sparkfun_micromodrp2040.menu.flash.16777216_0.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_0.build.fs_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_0.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
sparkfun_micromodrp2040.menu.flash.16777216_65536.upload.maximum_size=16707584
sparkfun_micromodrp2040.menu.flash.16777216_65536.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_65536.build.flash_length=16707584
sparkfun_micromodrp2040.menu.flash.16777216_65536.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_65536.build.fs_start=285143040
sparkfun_micromodrp2040.menu.flash.16777216_65536.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
sparkfun_micromodrp2040.menu.flash.16777216_131072.upload.maximum_size=16642048
sparkfun_micromodrp2040.menu.flash.16777216_131072.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_131072.build.flash_length=16642048
sparkfun_micromodrp2040.menu.flash.16777216_131072.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_131072.build.fs_start=285077504
sparkfun_micromodrp2040.menu.flash.16777216_131072.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
sparkfun_micromodrp2040.menu.flash.16777216_262144.upload.maximum_size=16510976
sparkfun_micromodrp2040.menu.flash.16777216_262144.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_262144.build.flash_length=16510976
sparkfun_micromodrp2040.menu.flash.16777216_262144.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_262144.build.fs_start=284946432
sparkfun_micromodrp2040.menu.flash.16777216_262144.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
sparkfun_micromodrp2040.menu.flash.16777216_524288.upload.maximum_size=16248832
sparkfun_micromodrp2040.menu.flash.16777216_524288.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_524288.build.flash_length=16248832
sparkfun_micromodrp2040.menu.flash.16777216_524288.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_524288.build.fs_start=284684288
sparkfun_micromodrp2040.menu.flash.16777216_524288.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
sparkfun_micromodrp2040.menu.flash.16777216_1048576.upload.maximum_size=15724544
sparkfun_micromodrp2040.menu.flash.16777216_1048576.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_1048576.build.flash_length=15724544
sparkfun_micromodrp2040.menu.flash.16777216_1048576.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_1048576.build.fs_start=284160000
sparkfun_micromodrp2040.menu.flash.16777216_1048576.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
sparkfun_micromodrp2040.menu.flash.16777216_2097152.upload.maximum_size=14675968
sparkfun_micromodrp2040.menu.flash.16777216_2097152.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_2097152.build.flash_length=14675968
sparkfun_micromodrp2040.menu.flash.16777216_2097152.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_2097152.build.fs_start=283111424
sparkfun_micromodrp2040.menu.flash.16777216_2097152.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
sparkfun_micromodrp2040.menu.flash.16777216_3145728.upload.maximum_size=13627392
sparkfun_micromodrp2040.menu.flash.16777216_3145728.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_3145728.build.flash_length=13627392
sparkfun_micromodrp2040.menu.flash.16777216_3145728.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_3145728.build.fs_start=282062848
sparkfun_micromodrp2040.menu.flash.16777216_3145728.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
sparkfun_micromodrp2040.menu.flash.16777216_4194304.upload.maximum_size=12578816
sparkfun_micromodrp2040.menu.flash.16777216_4194304.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_4194304.build.flash_length=12578816
sparkfun_micromodrp2040.menu.flash.16777216_4194304.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_4194304.build.fs_start=281014272
sparkfun_micromodrp2040.menu.flash.16777216_4194304.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
sparkfun_micromodrp2040.menu.flash.16777216_5242880.upload.maximum_size=11530240
sparkfun_micromodrp2040.menu.flash.16777216_5242880.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_5242880.build.flash_length=11530240
sparkfun_micromodrp2040.menu.flash.16777216_5242880.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_5242880.build.fs_start=279965696
sparkfun_micromodrp2040.menu.flash.16777216_5242880.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
sparkfun_micromodrp2040.menu.flash.16777216_6291456.upload.maximum_size=10481664
sparkfun_micromodrp2040.menu.flash.16777216_6291456.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_6291456.build.flash_length=10481664
sparkfun_micromodrp2040.menu.flash.16777216_6291456.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_6291456.build.fs_start=278917120
sparkfun_micromodrp2040.menu.flash.16777216_6291456.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
sparkfun_micromodrp2040.menu.flash.16777216_7340032.upload.maximum_size=9433088
sparkfun_micromodrp2040.menu.flash.16777216_7340032.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_7340032.build.flash_length=9433088
sparkfun_micromodrp2040.menu.flash.16777216_7340032.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_7340032.build.fs_start=277868544
sparkfun_micromodrp2040.menu.flash.16777216_7340032.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
sparkfun_micromodrp2040.menu.flash.16777216_8388608.upload.maximum_size=8384512
sparkfun_micromodrp2040.menu.flash.16777216_8388608.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_8388608.build.flash_length=8384512
sparkfun_micromodrp2040.menu.flash.16777216_8388608.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_8388608.build.fs_start=276819968
sparkfun_micromodrp2040.menu.flash.16777216_8388608.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
sparkfun_micromodrp2040.menu.flash.16777216_9437184.upload.maximum_size=7335936
sparkfun_micromodrp2040.menu.flash.16777216_9437184.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_9437184.build.flash_length=7335936
sparkfun_micromodrp2040.menu.flash.16777216_9437184.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_9437184.build.fs_start=275771392
sparkfun_micromodrp2040.menu.flash.16777216_9437184.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
sparkfun_micromodrp2040.menu.flash.16777216_10485760.upload.maximum_size=6287360
sparkfun_micromodrp2040.menu.flash.16777216_10485760.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_10485760.build.flash_length=6287360
sparkfun_micromodrp2040.menu.flash.16777216_10485760.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_10485760.build.fs_start=274722816
sparkfun_micromodrp2040.menu.flash.16777216_10485760.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
sparkfun_micromodrp2040.menu.flash.16777216_11534336.upload.maximum_size=5238784
sparkfun_micromodrp2040.menu.flash.16777216_11534336.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_11534336.build.flash_length=5238784
sparkfun_micromodrp2040.menu.flash.16777216_11534336.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_11534336.build.fs_start=273674240
sparkfun_micromodrp2040.menu.flash.16777216_11534336.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
sparkfun_micromodrp2040.menu.flash.16777216_12582912.upload.maximum_size=4190208
sparkfun_micromodrp2040.menu.flash.16777216_12582912.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_12582912.build.flash_length=4190208
sparkfun_micromodrp2040.menu.flash.16777216_12582912.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_12582912.build.fs_start=272625664
sparkfun_micromodrp2040.menu.flash.16777216_12582912.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
sparkfun_micromodrp2040.menu.flash.16777216_13631488.upload.maximum_size=3141632
sparkfun_micromodrp2040.menu.flash.16777216_13631488.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_13631488.build.flash_length=3141632
sparkfun_micromodrp2040.menu.flash.16777216_13631488.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_13631488.build.fs_start=271577088
sparkfun_micromodrp2040.menu.flash.16777216_13631488.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
sparkfun_micromodrp2040.menu.flash.16777216_14680064.upload.maximum_size=2093056
sparkfun_micromodrp2040.menu.flash.16777216_14680064.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_14680064.build.flash_length=2093056
sparkfun_micromodrp2040.menu.flash.16777216_14680064.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_14680064.build.fs_start=270528512
sparkfun_micromodrp2040.menu.flash.16777216_14680064.build.fs_end=285208576
sparkfun_micromodrp2040.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
sparkfun_micromodrp2040.menu.flash.16777216_15728640.upload.maximum_size=1044480
sparkfun_micromodrp2040.menu.flash.16777216_15728640.build.flash_total=16777216
sparkfun_micromodrp2040.menu.flash.16777216_15728640.build.flash_length=1044480
sparkfun_micromodrp2040.menu.flash.16777216_15728640.build.eeprom_start=285208576
sparkfun_micromodrp2040.menu.flash.16777216_15728640.build.fs_start=269479936
sparkfun_micromodrp2040.menu.flash.16777216_15728640.build.fs_end=285208576
sparkfun_micromodrp2040.menu.freq.133=133 MHz
sparkfun_micromodrp2040.menu.freq.133.build.f_cpu=133000000L
sparkfun_micromodrp2040.menu.freq.50=50 MHz
sparkfun_micromodrp2040.menu.freq.50.build.f_cpu=50000000L
sparkfun_micromodrp2040.menu.freq.100=100 MHz
sparkfun_micromodrp2040.menu.freq.100.build.f_cpu=100000000L
sparkfun_micromodrp2040.menu.freq.120=120 MHz
sparkfun_micromodrp2040.menu.freq.120.build.f_cpu=120000000L
sparkfun_micromodrp2040.menu.freq.125=125 MHz
sparkfun_micromodrp2040.menu.freq.125.build.f_cpu=125000000L
sparkfun_micromodrp2040.menu.freq.128=128 MHz
sparkfun_micromodrp2040.menu.freq.128.build.f_cpu=128000000L
sparkfun_micromodrp2040.menu.freq.150=150 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.150.build.f_cpu=150000000L
sparkfun_micromodrp2040.menu.freq.175=175 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.175.build.f_cpu=175000000L
sparkfun_micromodrp2040.menu.freq.200=200 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.200.build.f_cpu=200000000L
sparkfun_micromodrp2040.menu.freq.225=225 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.225.build.f_cpu=225000000L
sparkfun_micromodrp2040.menu.freq.240=240 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.240.build.f_cpu=240000000L
sparkfun_micromodrp2040.menu.freq.250=250 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.250.build.f_cpu=250000000L
sparkfun_micromodrp2040.menu.freq.275=275 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.275.build.f_cpu=275000000L
sparkfun_micromodrp2040.menu.freq.300=300 MHz (Overclock)
sparkfun_micromodrp2040.menu.freq.300.build.f_cpu=300000000L
sparkfun_micromodrp2040.menu.opt.Small=Small (-Os) (standard)
sparkfun_micromodrp2040.menu.opt.Small.build.flags.optimize=-Os
sparkfun_micromodrp2040.menu.opt.Optimize=Optimize (-O)
sparkfun_micromodrp2040.menu.opt.Optimize.build.flags.optimize=-O
sparkfun_micromodrp2040.menu.opt.Optimize2=Optimize More (-O2)
sparkfun_micromodrp2040.menu.opt.Optimize2.build.flags.optimize=-O2
sparkfun_micromodrp2040.menu.opt.Optimize3=Optimize Even More (-O3)
sparkfun_micromodrp2040.menu.opt.Optimize3.build.flags.optimize=-O3
sparkfun_micromodrp2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
sparkfun_micromodrp2040.menu.opt.Fast.build.flags.optimize=-Ofast
sparkfun_micromodrp2040.menu.opt.Debug=Debug (-Og)
sparkfun_micromodrp2040.menu.opt.Debug.build.flags.optimize=-Og
sparkfun_micromodrp2040.menu.rtti.Disabled=Disabled
sparkfun_micromodrp2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
sparkfun_micromodrp2040.menu.rtti.Enabled=Enabled
sparkfun_micromodrp2040.menu.rtti.Enabled.build.flags.rtti=
sparkfun_micromodrp2040.menu.stackprotect.Disabled=Disabled
sparkfun_micromodrp2040.menu.stackprotect.Disabled.build.flags.stackprotect=
sparkfun_micromodrp2040.menu.stackprotect.Enabled=Enabled
sparkfun_micromodrp2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
sparkfun_micromodrp2040.menu.exceptions.Disabled=Disabled
sparkfun_micromodrp2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
sparkfun_micromodrp2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
sparkfun_micromodrp2040.menu.exceptions.Enabled=Enabled
sparkfun_micromodrp2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
sparkfun_micromodrp2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
sparkfun_micromodrp2040.menu.dbgport.Disabled=Disabled
sparkfun_micromodrp2040.menu.dbgport.Disabled.build.debug_port=
sparkfun_micromodrp2040.menu.dbgport.Serial=Serial
sparkfun_micromodrp2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
sparkfun_micromodrp2040.menu.dbgport.Serial1=Serial1
sparkfun_micromodrp2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
sparkfun_micromodrp2040.menu.dbgport.Serial2=Serial2
sparkfun_micromodrp2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sparkfun_micromodrp2040.menu.dbglvl.None=None
sparkfun_micromodrp2040.menu.dbglvl.None.build.debug_level=
sparkfun_micromodrp2040.menu.dbglvl.Core=Core
