earlephilhower/arduino-pico/boards.txt
sparkfun_micromodrp2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sparkfun_micromodrp2040.menu.dbglvl.SPI=SPI
sparkfun_micromodrp2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sparkfun_micromodrp2040.menu.dbglvl.Wire=Wire
sparkfun_micromodrp2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sparkfun_micromodrp2040.menu.dbglvl.Bluetooth=Bluetooth
sparkfun_micromodrp2040.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
sparkfun_micromodrp2040.menu.dbglvl.All=All
sparkfun_micromodrp2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
sparkfun_micromodrp2040.menu.dbglvl.NDEBUG=NDEBUG
sparkfun_micromodrp2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sparkfun_micromodrp2040.menu.usbstack.picosdk=Pico SDK
sparkfun_micromodrp2040.menu.usbstack.picosdk.build.usbstack_flags=
sparkfun_micromodrp2040.menu.usbstack.tinyusb=Adafruit TinyUSB
sparkfun_micromodrp2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_micromodrp2040.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
sparkfun_micromodrp2040.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_micromodrp2040.menu.usbstack.nousb=No USB
sparkfun_micromodrp2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
sparkfun_micromodrp2040.menu.ipbtstack.ipv4only=IPv4 Only
sparkfun_micromodrp2040.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.uploadmethod.default=Default (UF2)
sparkfun_micromodrp2040.menu.uploadmethod.default.build.ram_length=256k
sparkfun_micromodrp2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.maximum_data_size=262144
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.tool=uf2conv
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.tool.default=uf2conv
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
sparkfun_micromodrp2040.menu.uploadmethod.picotool=Picotool
sparkfun_micromodrp2040.menu.uploadmethod.picotool.build.ram_length=256k
sparkfun_micromodrp2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
sparkfun_micromodrp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
sparkfun_micromodrp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
sparkfun_micromodrp2040.menu.uploadmethod.picotool.upload.tool=picotool
sparkfun_micromodrp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
sparkfun_micromodrp2040.menu.uploadmethod.picodebug=Pico-Debug
sparkfun_micromodrp2040.menu.uploadmethod.picodebug.build.ram_length=240k
sparkfun_micromodrp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
sparkfun_micromodrp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
sparkfun_micromodrp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
sparkfun_micromodrp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
sparkfun_micromodrp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

