earlephilhower/arduino-pico/boards.txt
sparkfun_thingplusrp2040.menu.flash.16777216_13631488.build.flash_total=16777216
sparkfun_thingplusrp2040.menu.flash.16777216_13631488.build.flash_length=3141632
sparkfun_thingplusrp2040.menu.flash.16777216_13631488.build.eeprom_start=285208576
sparkfun_thingplusrp2040.menu.flash.16777216_13631488.build.fs_start=271577088
sparkfun_thingplusrp2040.menu.flash.16777216_13631488.build.fs_end=285208576
sparkfun_thingplusrp2040.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
sparkfun_thingplusrp2040.menu.flash.16777216_14680064.upload.maximum_size=2093056
sparkfun_thingplusrp2040.menu.flash.16777216_14680064.build.flash_total=16777216
sparkfun_thingplusrp2040.menu.flash.16777216_14680064.build.flash_length=2093056
sparkfun_thingplusrp2040.menu.flash.16777216_14680064.build.eeprom_start=285208576
sparkfun_thingplusrp2040.menu.flash.16777216_14680064.build.fs_start=270528512
sparkfun_thingplusrp2040.menu.flash.16777216_14680064.build.fs_end=285208576
sparkfun_thingplusrp2040.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
sparkfun_thingplusrp2040.menu.flash.16777216_15728640.upload.maximum_size=1044480
sparkfun_thingplusrp2040.menu.flash.16777216_15728640.build.flash_total=16777216
sparkfun_thingplusrp2040.menu.flash.16777216_15728640.build.flash_length=1044480
sparkfun_thingplusrp2040.menu.flash.16777216_15728640.build.eeprom_start=285208576
sparkfun_thingplusrp2040.menu.flash.16777216_15728640.build.fs_start=269479936
sparkfun_thingplusrp2040.menu.flash.16777216_15728640.build.fs_end=285208576
sparkfun_thingplusrp2040.menu.freq.133=133 MHz
sparkfun_thingplusrp2040.menu.freq.133.build.f_cpu=133000000L
sparkfun_thingplusrp2040.menu.freq.50=50 MHz
sparkfun_thingplusrp2040.menu.freq.50.build.f_cpu=50000000L
sparkfun_thingplusrp2040.menu.freq.100=100 MHz
sparkfun_thingplusrp2040.menu.freq.100.build.f_cpu=100000000L
sparkfun_thingplusrp2040.menu.freq.120=120 MHz
sparkfun_thingplusrp2040.menu.freq.120.build.f_cpu=120000000L
sparkfun_thingplusrp2040.menu.freq.125=125 MHz
sparkfun_thingplusrp2040.menu.freq.125.build.f_cpu=125000000L
sparkfun_thingplusrp2040.menu.freq.128=128 MHz
sparkfun_thingplusrp2040.menu.freq.128.build.f_cpu=128000000L
sparkfun_thingplusrp2040.menu.freq.150=150 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.150.build.f_cpu=150000000L
sparkfun_thingplusrp2040.menu.freq.175=175 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.175.build.f_cpu=175000000L
sparkfun_thingplusrp2040.menu.freq.200=200 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.200.build.f_cpu=200000000L
sparkfun_thingplusrp2040.menu.freq.225=225 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.225.build.f_cpu=225000000L
sparkfun_thingplusrp2040.menu.freq.240=240 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.240.build.f_cpu=240000000L
sparkfun_thingplusrp2040.menu.freq.250=250 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.250.build.f_cpu=250000000L
sparkfun_thingplusrp2040.menu.freq.275=275 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.275.build.f_cpu=275000000L
sparkfun_thingplusrp2040.menu.freq.300=300 MHz (Overclock)
sparkfun_thingplusrp2040.menu.freq.300.build.f_cpu=300000000L
sparkfun_thingplusrp2040.menu.opt.Small=Small (-Os) (standard)
sparkfun_thingplusrp2040.menu.opt.Small.build.flags.optimize=-Os
sparkfun_thingplusrp2040.menu.opt.Optimize=Optimize (-O)
sparkfun_thingplusrp2040.menu.opt.Optimize.build.flags.optimize=-O
sparkfun_thingplusrp2040.menu.opt.Optimize2=Optimize More (-O2)
sparkfun_thingplusrp2040.menu.opt.Optimize2.build.flags.optimize=-O2
sparkfun_thingplusrp2040.menu.opt.Optimize3=Optimize Even More (-O3)
sparkfun_thingplusrp2040.menu.opt.Optimize3.build.flags.optimize=-O3
sparkfun_thingplusrp2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
sparkfun_thingplusrp2040.menu.opt.Fast.build.flags.optimize=-Ofast
sparkfun_thingplusrp2040.menu.opt.Debug=Debug (-Og)
sparkfun_thingplusrp2040.menu.opt.Debug.build.flags.optimize=-Og
sparkfun_thingplusrp2040.menu.rtti.Disabled=Disabled
sparkfun_thingplusrp2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
sparkfun_thingplusrp2040.menu.rtti.Enabled=Enabled
sparkfun_thingplusrp2040.menu.rtti.Enabled.build.flags.rtti=
sparkfun_thingplusrp2040.menu.stackprotect.Disabled=Disabled
sparkfun_thingplusrp2040.menu.stackprotect.Disabled.build.flags.stackprotect=
sparkfun_thingplusrp2040.menu.stackprotect.Enabled=Enabled
sparkfun_thingplusrp2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
sparkfun_thingplusrp2040.menu.exceptions.Disabled=Disabled
sparkfun_thingplusrp2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
sparkfun_thingplusrp2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
sparkfun_thingplusrp2040.menu.exceptions.Enabled=Enabled
sparkfun_thingplusrp2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
sparkfun_thingplusrp2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
sparkfun_thingplusrp2040.menu.dbgport.Disabled=Disabled
sparkfun_thingplusrp2040.menu.dbgport.Disabled.build.debug_port=
sparkfun_thingplusrp2040.menu.dbgport.Serial=Serial
sparkfun_thingplusrp2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
sparkfun_thingplusrp2040.menu.dbgport.Serial1=Serial1
sparkfun_thingplusrp2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
sparkfun_thingplusrp2040.menu.dbgport.Serial2=Serial2
sparkfun_thingplusrp2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sparkfun_thingplusrp2040.menu.dbglvl.None=None
sparkfun_thingplusrp2040.menu.dbglvl.None.build.debug_level=
sparkfun_thingplusrp2040.menu.dbglvl.Core=Core
sparkfun_thingplusrp2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sparkfun_thingplusrp2040.menu.dbglvl.SPI=SPI
sparkfun_thingplusrp2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sparkfun_thingplusrp2040.menu.dbglvl.Wire=Wire
sparkfun_thingplusrp2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sparkfun_thingplusrp2040.menu.dbglvl.Bluetooth=Bluetooth
sparkfun_thingplusrp2040.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
sparkfun_thingplusrp2040.menu.dbglvl.All=All
sparkfun_thingplusrp2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
sparkfun_thingplusrp2040.menu.dbglvl.NDEBUG=NDEBUG
sparkfun_thingplusrp2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sparkfun_thingplusrp2040.menu.usbstack.picosdk=Pico SDK
sparkfun_thingplusrp2040.menu.usbstack.picosdk.build.usbstack_flags=
sparkfun_thingplusrp2040.menu.usbstack.tinyusb=Adafruit TinyUSB
sparkfun_thingplusrp2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_thingplusrp2040.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
sparkfun_thingplusrp2040.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_thingplusrp2040.menu.usbstack.nousb=No USB
sparkfun_thingplusrp2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4only=IPv4 Only
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
sparkfun_thingplusrp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2040.menu.uploadmethod.default=Default (UF2)
sparkfun_thingplusrp2040.menu.uploadmethod.default.build.ram_length=256k
sparkfun_thingplusrp2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_thingplusrp2040.menu.uploadmethod.default.upload.maximum_data_size=262144
sparkfun_thingplusrp2040.menu.uploadmethod.default.upload.tool=uf2conv
sparkfun_thingplusrp2040.menu.uploadmethod.default.upload.tool.default=uf2conv
sparkfun_thingplusrp2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
sparkfun_thingplusrp2040.menu.uploadmethod.picotool=Picotool
sparkfun_thingplusrp2040.menu.uploadmethod.picotool.build.ram_length=256k
sparkfun_thingplusrp2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
sparkfun_thingplusrp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
sparkfun_thingplusrp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
sparkfun_thingplusrp2040.menu.uploadmethod.picotool.upload.tool=picotool
sparkfun_thingplusrp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
sparkfun_thingplusrp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
sparkfun_thingplusrp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
sparkfun_thingplusrp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_thingplusrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
sparkfun_thingplusrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
sparkfun_thingplusrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
sparkfun_thingplusrp2040.menu.uploadmethod.picodebug=Pico-Debug
sparkfun_thingplusrp2040.menu.uploadmethod.picodebug.build.ram_length=240k
sparkfun_thingplusrp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
sparkfun_thingplusrp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
sparkfun_thingplusrp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
sparkfun_thingplusrp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
sparkfun_thingplusrp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

