earlephilhower/arduino-pico/boards.txt
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.build.ram_length=240k
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# Viyalab Mizu RP2040
# -----------------------------------
viyalab_mizu.name=Viyalab Mizu RP2040
viyalab_mizu.vid.0=0x2e8a
viyalab_mizu.pid.0=0x000a
viyalab_mizu.vid.1=0x2e8a
viyalab_mizu.pid.1=0x010a
viyalab_mizu.vid.2=0x2e8a
viyalab_mizu.pid.2=0x400a
viyalab_mizu.vid.3=0x2e8a
viyalab_mizu.pid.3=0x410a
viyalab_mizu.vid.4=0x2e8a
viyalab_mizu.pid.4=0x800a
viyalab_mizu.vid.5=0x2e8a
viyalab_mizu.pid.5=0x810a
viyalab_mizu.vid.6=0x2e8a
viyalab_mizu.pid.6=0xc00a
viyalab_mizu.vid.7=0x2e8a
viyalab_mizu.pid.7=0xc10a
viyalab_mizu.upload_port.0.vid=0x2e8a
viyalab_mizu.upload_port.0.pid=0x000a
viyalab_mizu.upload_port.1.vid=0x2e8a
viyalab_mizu.upload_port.1.pid=0x010a
viyalab_mizu.upload_port.2.vid=0x2e8a
viyalab_mizu.upload_port.2.pid=0x400a
viyalab_mizu.upload_port.3.vid=0x2e8a
viyalab_mizu.upload_port.3.pid=0x410a
viyalab_mizu.upload_port.4.vid=0x2e8a
viyalab_mizu.upload_port.4.pid=0x800a
viyalab_mizu.upload_port.5.vid=0x2e8a
viyalab_mizu.upload_port.5.pid=0x810a
viyalab_mizu.upload_port.6.vid=0x2e8a
viyalab_mizu.upload_port.6.pid=0xc00a
viyalab_mizu.upload_port.7.vid=0x2e8a
viyalab_mizu.upload_port.7.pid=0xc10a
viyalab_mizu.build.usbvid=-DUSBD_VID=0x2e8a
viyalab_mizu.build.usbpid=-DUSBD_PID=0x000a
viyalab_mizu.build.usbpwr=-DUSBD_MAX_POWER_MA=250
viyalab_mizu.build.board=VIYALAB_MIZU_RP2040
viyalab_mizu.build.mcu=cortex-m0plus
viyalab_mizu.build.variant=viyalab_mizu
viyalab_mizu.upload.maximum_size=8388608
viyalab_mizu.upload.wait_for_upload_port=true
viyalab_mizu.upload.erase_cmd=
viyalab_mizu.serial.disableDTR=false
viyalab_mizu.serial.disableRTS=false
viyalab_mizu.build.f_cpu=125000000
viyalab_mizu.build.led=
viyalab_mizu.build.core=rp2040
viyalab_mizu.build.ldscript=memmap_default.ld
viyalab_mizu.build.boot2=boot2_generic_03h_4_padded_checksum
viyalab_mizu.build.usb_manufacturer="Viyalab"
viyalab_mizu.build.usb_product="Mizu RP2040"
viyalab_mizu.menu.flash.8388608_0=8MB (no FS)
viyalab_mizu.menu.flash.8388608_0.upload.maximum_size=8384512
viyalab_mizu.menu.flash.8388608_0.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_0.build.flash_length=8384512
viyalab_mizu.menu.flash.8388608_0.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_0.build.fs_start=276819968
viyalab_mizu.menu.flash.8388608_0.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
viyalab_mizu.menu.flash.8388608_65536.upload.maximum_size=8318976
viyalab_mizu.menu.flash.8388608_65536.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_65536.build.flash_length=8318976
viyalab_mizu.menu.flash.8388608_65536.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_65536.build.fs_start=276754432
viyalab_mizu.menu.flash.8388608_65536.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
viyalab_mizu.menu.flash.8388608_131072.upload.maximum_size=8253440
viyalab_mizu.menu.flash.8388608_131072.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_131072.build.flash_length=8253440
viyalab_mizu.menu.flash.8388608_131072.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_131072.build.fs_start=276688896
viyalab_mizu.menu.flash.8388608_131072.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
viyalab_mizu.menu.flash.8388608_262144.upload.maximum_size=8122368
viyalab_mizu.menu.flash.8388608_262144.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_262144.build.flash_length=8122368
viyalab_mizu.menu.flash.8388608_262144.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_262144.build.fs_start=276557824
viyalab_mizu.menu.flash.8388608_262144.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
viyalab_mizu.menu.flash.8388608_524288.upload.maximum_size=7860224
viyalab_mizu.menu.flash.8388608_524288.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_524288.build.flash_length=7860224
viyalab_mizu.menu.flash.8388608_524288.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_524288.build.fs_start=276295680
viyalab_mizu.menu.flash.8388608_524288.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
viyalab_mizu.menu.flash.8388608_1048576.upload.maximum_size=7335936
viyalab_mizu.menu.flash.8388608_1048576.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_1048576.build.flash_length=7335936
viyalab_mizu.menu.flash.8388608_1048576.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_1048576.build.fs_start=275771392
viyalab_mizu.menu.flash.8388608_1048576.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
viyalab_mizu.menu.flash.8388608_2097152.upload.maximum_size=6287360
viyalab_mizu.menu.flash.8388608_2097152.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_2097152.build.flash_length=6287360
viyalab_mizu.menu.flash.8388608_2097152.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_2097152.build.fs_start=274722816
viyalab_mizu.menu.flash.8388608_2097152.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
viyalab_mizu.menu.flash.8388608_3145728.upload.maximum_size=5238784
viyalab_mizu.menu.flash.8388608_3145728.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_3145728.build.flash_length=5238784
viyalab_mizu.menu.flash.8388608_3145728.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_3145728.build.fs_start=273674240
viyalab_mizu.menu.flash.8388608_3145728.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
viyalab_mizu.menu.flash.8388608_4194304.upload.maximum_size=4190208
viyalab_mizu.menu.flash.8388608_4194304.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_4194304.build.flash_length=4190208
viyalab_mizu.menu.flash.8388608_4194304.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_4194304.build.fs_start=272625664
viyalab_mizu.menu.flash.8388608_4194304.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
viyalab_mizu.menu.flash.8388608_5242880.upload.maximum_size=3141632
viyalab_mizu.menu.flash.8388608_5242880.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_5242880.build.flash_length=3141632
viyalab_mizu.menu.flash.8388608_5242880.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_5242880.build.fs_start=271577088
viyalab_mizu.menu.flash.8388608_5242880.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
viyalab_mizu.menu.flash.8388608_6291456.upload.maximum_size=2093056
viyalab_mizu.menu.flash.8388608_6291456.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_6291456.build.flash_length=2093056
viyalab_mizu.menu.flash.8388608_6291456.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_6291456.build.fs_start=270528512
viyalab_mizu.menu.flash.8388608_6291456.build.fs_end=276819968
viyalab_mizu.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
viyalab_mizu.menu.flash.8388608_7340032.upload.maximum_size=1044480
viyalab_mizu.menu.flash.8388608_7340032.build.flash_total=8388608
viyalab_mizu.menu.flash.8388608_7340032.build.flash_length=1044480
viyalab_mizu.menu.flash.8388608_7340032.build.eeprom_start=276819968
viyalab_mizu.menu.flash.8388608_7340032.build.fs_start=269479936
viyalab_mizu.menu.flash.8388608_7340032.build.fs_end=276819968
viyalab_mizu.menu.freq.133=133 MHz
viyalab_mizu.menu.freq.133.build.f_cpu=133000000L
viyalab_mizu.menu.freq.50=50 MHz
viyalab_mizu.menu.freq.50.build.f_cpu=50000000L
viyalab_mizu.menu.freq.100=100 MHz
viyalab_mizu.menu.freq.100.build.f_cpu=100000000L
viyalab_mizu.menu.freq.120=120 MHz
viyalab_mizu.menu.freq.120.build.f_cpu=120000000L
viyalab_mizu.menu.freq.125=125 MHz
viyalab_mizu.menu.freq.125.build.f_cpu=125000000L
viyalab_mizu.menu.freq.128=128 MHz
viyalab_mizu.menu.freq.128.build.f_cpu=128000000L
viyalab_mizu.menu.freq.150=150 MHz (Overclock)
viyalab_mizu.menu.freq.150.build.f_cpu=150000000L
viyalab_mizu.menu.freq.175=175 MHz (Overclock)
viyalab_mizu.menu.freq.175.build.f_cpu=175000000L
viyalab_mizu.menu.freq.200=200 MHz (Overclock)
viyalab_mizu.menu.freq.200.build.f_cpu=200000000L
viyalab_mizu.menu.freq.225=225 MHz (Overclock)
viyalab_mizu.menu.freq.225.build.f_cpu=225000000L
viyalab_mizu.menu.freq.240=240 MHz (Overclock)
viyalab_mizu.menu.freq.240.build.f_cpu=240000000L
viyalab_mizu.menu.freq.250=250 MHz (Overclock)
viyalab_mizu.menu.freq.250.build.f_cpu=250000000L
viyalab_mizu.menu.freq.275=275 MHz (Overclock)
viyalab_mizu.menu.freq.275.build.f_cpu=275000000L
viyalab_mizu.menu.freq.300=300 MHz (Overclock)
viyalab_mizu.menu.freq.300.build.f_cpu=300000000L
viyalab_mizu.menu.opt.Small=Small (-Os) (standard)
viyalab_mizu.menu.opt.Small.build.flags.optimize=-Os
viyalab_mizu.menu.opt.Optimize=Optimize (-O)
viyalab_mizu.menu.opt.Optimize.build.flags.optimize=-O
viyalab_mizu.menu.opt.Optimize2=Optimize More (-O2)
viyalab_mizu.menu.opt.Optimize2.build.flags.optimize=-O2
viyalab_mizu.menu.opt.Optimize3=Optimize Even More (-O3)
viyalab_mizu.menu.opt.Optimize3.build.flags.optimize=-O3
viyalab_mizu.menu.opt.Fast=Fast (-Ofast) (maybe slower)
viyalab_mizu.menu.opt.Fast.build.flags.optimize=-Ofast
viyalab_mizu.menu.opt.Debug=Debug (-Og)
viyalab_mizu.menu.opt.Debug.build.flags.optimize=-Og
viyalab_mizu.menu.rtti.Disabled=Disabled
viyalab_mizu.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
viyalab_mizu.menu.rtti.Enabled=Enabled
viyalab_mizu.menu.rtti.Enabled.build.flags.rtti=
viyalab_mizu.menu.stackprotect.Disabled=Disabled
viyalab_mizu.menu.stackprotect.Disabled.build.flags.stackprotect=
viyalab_mizu.menu.stackprotect.Enabled=Enabled
viyalab_mizu.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
viyalab_mizu.menu.exceptions.Disabled=Disabled
viyalab_mizu.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
viyalab_mizu.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
viyalab_mizu.menu.exceptions.Enabled=Enabled
viyalab_mizu.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
viyalab_mizu.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
viyalab_mizu.menu.dbgport.Disabled=Disabled
viyalab_mizu.menu.dbgport.Disabled.build.debug_port=
viyalab_mizu.menu.dbgport.Serial=Serial
viyalab_mizu.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
viyalab_mizu.menu.dbgport.Serial1=Serial1
viyalab_mizu.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
viyalab_mizu.menu.dbgport.Serial2=Serial2
viyalab_mizu.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
viyalab_mizu.menu.dbglvl.None=None
viyalab_mizu.menu.dbglvl.None.build.debug_level=
viyalab_mizu.menu.dbglvl.Core=Core
viyalab_mizu.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
viyalab_mizu.menu.dbglvl.SPI=SPI
viyalab_mizu.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
viyalab_mizu.menu.dbglvl.Wire=Wire
viyalab_mizu.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
viyalab_mizu.menu.dbglvl.Bluetooth=Bluetooth
viyalab_mizu.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
viyalab_mizu.menu.dbglvl.All=All
viyalab_mizu.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
viyalab_mizu.menu.dbglvl.NDEBUG=NDEBUG
viyalab_mizu.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
viyalab_mizu.menu.usbstack.picosdk=Pico SDK
viyalab_mizu.menu.usbstack.picosdk.build.usbstack_flags=
viyalab_mizu.menu.usbstack.tinyusb=Adafruit TinyUSB
viyalab_mizu.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
viyalab_mizu.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
viyalab_mizu.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
viyalab_mizu.menu.usbstack.nousb=No USB
viyalab_mizu.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
viyalab_mizu.menu.ipbtstack.ipv4only=IPv4 Only
viyalab_mizu.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
viyalab_mizu.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
viyalab_mizu.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
viyalab_mizu.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
viyalab_mizu.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
viyalab_mizu.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
viyalab_mizu.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
viyalab_mizu.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
viyalab_mizu.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
viyalab_mizu.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
viyalab_mizu.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
viyalab_mizu.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
viyalab_mizu.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
viyalab_mizu.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
viyalab_mizu.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
viyalab_mizu.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
viyalab_mizu.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
viyalab_mizu.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
viyalab_mizu.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
viyalab_mizu.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
viyalab_mizu.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
viyalab_mizu.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
viyalab_mizu.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
viyalab_mizu.menu.uploadmethod.default=Default (UF2)
viyalab_mizu.menu.uploadmethod.default.build.ram_length=256k
viyalab_mizu.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
viyalab_mizu.menu.uploadmethod.default.upload.maximum_data_size=262144
viyalab_mizu.menu.uploadmethod.default.upload.tool=uf2conv
viyalab_mizu.menu.uploadmethod.default.upload.tool.default=uf2conv
viyalab_mizu.menu.uploadmethod.default.upload.tool.network=uf2conv-network
viyalab_mizu.menu.uploadmethod.picotool=Picotool
viyalab_mizu.menu.uploadmethod.picotool.build.ram_length=256k
viyalab_mizu.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
viyalab_mizu.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
viyalab_mizu.menu.uploadmethod.picotool.upload.maximum_data_size=262144
viyalab_mizu.menu.uploadmethod.picotool.upload.tool=picotool
viyalab_mizu.menu.uploadmethod.picotool.upload.tool.default=picotool
viyalab_mizu.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
viyalab_mizu.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
viyalab_mizu.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
viyalab_mizu.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
viyalab_mizu.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
viyalab_mizu.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
viyalab_mizu.menu.uploadmethod.picodebug=Pico-Debug
viyalab_mizu.menu.uploadmethod.picodebug.build.ram_length=240k
viyalab_mizu.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
viyalab_mizu.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
viyalab_mizu.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
viyalab_mizu.menu.uploadmethod.picodebug.upload.tool=picodebug
viyalab_mizu.menu.uploadmethod.picodebug.upload.tool.default=picodebug

