earlephilhower/arduino-pico/boards.txt
waveshare_rp2040_plus_4mb.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
waveshare_rp2040_plus_4mb.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
waveshare_rp2040_plus_4mb.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
waveshare_rp2040_plus_4mb.menu.usbstack.nousb=No USB
waveshare_rp2040_plus_4mb.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4only=IPv4 Only
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
waveshare_rp2040_plus_4mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_4mb.menu.uploadmethod.default=Default (UF2)
waveshare_rp2040_plus_4mb.menu.uploadmethod.default.build.ram_length=256k
waveshare_rp2040_plus_4mb.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
waveshare_rp2040_plus_4mb.menu.uploadmethod.default.upload.maximum_data_size=262144
waveshare_rp2040_plus_4mb.menu.uploadmethod.default.upload.tool=uf2conv
waveshare_rp2040_plus_4mb.menu.uploadmethod.default.upload.tool.default=uf2conv
waveshare_rp2040_plus_4mb.menu.uploadmethod.default.upload.tool.network=uf2conv-network
waveshare_rp2040_plus_4mb.menu.uploadmethod.picotool=Picotool
waveshare_rp2040_plus_4mb.menu.uploadmethod.picotool.build.ram_length=256k
waveshare_rp2040_plus_4mb.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
waveshare_rp2040_plus_4mb.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
waveshare_rp2040_plus_4mb.menu.uploadmethod.picotool.upload.maximum_data_size=262144
waveshare_rp2040_plus_4mb.menu.uploadmethod.picotool.upload.tool=picotool
waveshare_rp2040_plus_4mb.menu.uploadmethod.picotool.upload.tool.default=picotool
waveshare_rp2040_plus_4mb.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
waveshare_rp2040_plus_4mb.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
waveshare_rp2040_plus_4mb.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
waveshare_rp2040_plus_4mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
waveshare_rp2040_plus_4mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
waveshare_rp2040_plus_4mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
waveshare_rp2040_plus_4mb.menu.uploadmethod.picodebug=Pico-Debug
waveshare_rp2040_plus_4mb.menu.uploadmethod.picodebug.build.ram_length=240k
waveshare_rp2040_plus_4mb.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
waveshare_rp2040_plus_4mb.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
waveshare_rp2040_plus_4mb.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
waveshare_rp2040_plus_4mb.menu.uploadmethod.picodebug.upload.tool=picodebug
waveshare_rp2040_plus_4mb.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# Waveshare RP2040 Plus 16MB
# -----------------------------------
waveshare_rp2040_plus_16mb.name=Waveshare RP2040 Plus 16MB
waveshare_rp2040_plus_16mb.vid.0=0x2e8a
waveshare_rp2040_plus_16mb.pid.0=0x1020
waveshare_rp2040_plus_16mb.vid.1=0x2e8a
waveshare_rp2040_plus_16mb.pid.1=0x1120
waveshare_rp2040_plus_16mb.vid.2=0x2e8a
waveshare_rp2040_plus_16mb.pid.2=0x5020
waveshare_rp2040_plus_16mb.vid.3=0x2e8a
waveshare_rp2040_plus_16mb.pid.3=0x5120
waveshare_rp2040_plus_16mb.vid.4=0x2e8a
waveshare_rp2040_plus_16mb.pid.4=0x9020
waveshare_rp2040_plus_16mb.vid.5=0x2e8a
waveshare_rp2040_plus_16mb.pid.5=0x9120
waveshare_rp2040_plus_16mb.vid.6=0x2e8a
waveshare_rp2040_plus_16mb.pid.6=0xd020
waveshare_rp2040_plus_16mb.vid.7=0x2e8a
waveshare_rp2040_plus_16mb.pid.7=0xd120
waveshare_rp2040_plus_16mb.upload_port.0.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.0.pid=0x1020
waveshare_rp2040_plus_16mb.upload_port.1.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.1.pid=0x1120
waveshare_rp2040_plus_16mb.upload_port.2.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.2.pid=0x5020
waveshare_rp2040_plus_16mb.upload_port.3.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.3.pid=0x5120
waveshare_rp2040_plus_16mb.upload_port.4.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.4.pid=0x9020
waveshare_rp2040_plus_16mb.upload_port.5.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.5.pid=0x9120
waveshare_rp2040_plus_16mb.upload_port.6.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.6.pid=0xd020
waveshare_rp2040_plus_16mb.upload_port.7.vid=0x2e8a
waveshare_rp2040_plus_16mb.upload_port.7.pid=0xd120
waveshare_rp2040_plus_16mb.build.usbvid=-DUSBD_VID=0x2e8a
waveshare_rp2040_plus_16mb.build.usbpid=-DUSBD_PID=0x1020
waveshare_rp2040_plus_16mb.build.usbpwr=-DUSBD_MAX_POWER_MA=500
waveshare_rp2040_plus_16mb.build.board=WAVESHARE_RP2040_PLUS
waveshare_rp2040_plus_16mb.build.mcu=cortex-m0plus
waveshare_rp2040_plus_16mb.build.variant=waveshare_rp2040_plus_16mb
waveshare_rp2040_plus_16mb.upload.maximum_size=16777216
waveshare_rp2040_plus_16mb.upload.wait_for_upload_port=true
waveshare_rp2040_plus_16mb.upload.erase_cmd=
waveshare_rp2040_plus_16mb.serial.disableDTR=false
waveshare_rp2040_plus_16mb.serial.disableRTS=false
waveshare_rp2040_plus_16mb.build.f_cpu=125000000
waveshare_rp2040_plus_16mb.build.led=
waveshare_rp2040_plus_16mb.build.core=rp2040
waveshare_rp2040_plus_16mb.build.ldscript=memmap_default.ld
waveshare_rp2040_plus_16mb.build.boot2=boot2_w25q080_2_padded_checksum
waveshare_rp2040_plus_16mb.build.usb_manufacturer="Waveshare"
waveshare_rp2040_plus_16mb.build.usb_product="RP2040 Plus 16MB"
waveshare_rp2040_plus_16mb.menu.flash.16777216_0=16MB (no FS)
waveshare_rp2040_plus_16mb.menu.flash.16777216_0.upload.maximum_size=16773120
waveshare_rp2040_plus_16mb.menu.flash.16777216_0.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_0.build.flash_length=16773120
waveshare_rp2040_plus_16mb.menu.flash.16777216_0.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_0.build.fs_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_0.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_65536.upload.maximum_size=16707584
waveshare_rp2040_plus_16mb.menu.flash.16777216_65536.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_65536.build.flash_length=16707584
waveshare_rp2040_plus_16mb.menu.flash.16777216_65536.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_65536.build.fs_start=285143040
waveshare_rp2040_plus_16mb.menu.flash.16777216_65536.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_131072.upload.maximum_size=16642048
waveshare_rp2040_plus_16mb.menu.flash.16777216_131072.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_131072.build.flash_length=16642048
waveshare_rp2040_plus_16mb.menu.flash.16777216_131072.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_131072.build.fs_start=285077504
waveshare_rp2040_plus_16mb.menu.flash.16777216_131072.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_262144.upload.maximum_size=16510976
waveshare_rp2040_plus_16mb.menu.flash.16777216_262144.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_262144.build.flash_length=16510976
waveshare_rp2040_plus_16mb.menu.flash.16777216_262144.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_262144.build.fs_start=284946432
waveshare_rp2040_plus_16mb.menu.flash.16777216_262144.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_524288.upload.maximum_size=16248832
waveshare_rp2040_plus_16mb.menu.flash.16777216_524288.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_524288.build.flash_length=16248832
waveshare_rp2040_plus_16mb.menu.flash.16777216_524288.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_524288.build.fs_start=284684288
waveshare_rp2040_plus_16mb.menu.flash.16777216_524288.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_1048576.upload.maximum_size=15724544
waveshare_rp2040_plus_16mb.menu.flash.16777216_1048576.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_1048576.build.flash_length=15724544
waveshare_rp2040_plus_16mb.menu.flash.16777216_1048576.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_1048576.build.fs_start=284160000
waveshare_rp2040_plus_16mb.menu.flash.16777216_1048576.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_2097152.upload.maximum_size=14675968
waveshare_rp2040_plus_16mb.menu.flash.16777216_2097152.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_2097152.build.flash_length=14675968
waveshare_rp2040_plus_16mb.menu.flash.16777216_2097152.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_2097152.build.fs_start=283111424
waveshare_rp2040_plus_16mb.menu.flash.16777216_2097152.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_3145728.upload.maximum_size=13627392
waveshare_rp2040_plus_16mb.menu.flash.16777216_3145728.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_3145728.build.flash_length=13627392
waveshare_rp2040_plus_16mb.menu.flash.16777216_3145728.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_3145728.build.fs_start=282062848
waveshare_rp2040_plus_16mb.menu.flash.16777216_3145728.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_4194304.upload.maximum_size=12578816
waveshare_rp2040_plus_16mb.menu.flash.16777216_4194304.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_4194304.build.flash_length=12578816
waveshare_rp2040_plus_16mb.menu.flash.16777216_4194304.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_4194304.build.fs_start=281014272
waveshare_rp2040_plus_16mb.menu.flash.16777216_4194304.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_5242880.upload.maximum_size=11530240
waveshare_rp2040_plus_16mb.menu.flash.16777216_5242880.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_5242880.build.flash_length=11530240
waveshare_rp2040_plus_16mb.menu.flash.16777216_5242880.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_5242880.build.fs_start=279965696
waveshare_rp2040_plus_16mb.menu.flash.16777216_5242880.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_6291456.upload.maximum_size=10481664
waveshare_rp2040_plus_16mb.menu.flash.16777216_6291456.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_6291456.build.flash_length=10481664
waveshare_rp2040_plus_16mb.menu.flash.16777216_6291456.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_6291456.build.fs_start=278917120
waveshare_rp2040_plus_16mb.menu.flash.16777216_6291456.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_7340032.upload.maximum_size=9433088
waveshare_rp2040_plus_16mb.menu.flash.16777216_7340032.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_7340032.build.flash_length=9433088
waveshare_rp2040_plus_16mb.menu.flash.16777216_7340032.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_7340032.build.fs_start=277868544
waveshare_rp2040_plus_16mb.menu.flash.16777216_7340032.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_8388608.upload.maximum_size=8384512
waveshare_rp2040_plus_16mb.menu.flash.16777216_8388608.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_8388608.build.flash_length=8384512
waveshare_rp2040_plus_16mb.menu.flash.16777216_8388608.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_8388608.build.fs_start=276819968
waveshare_rp2040_plus_16mb.menu.flash.16777216_8388608.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_9437184.upload.maximum_size=7335936
waveshare_rp2040_plus_16mb.menu.flash.16777216_9437184.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_9437184.build.flash_length=7335936
waveshare_rp2040_plus_16mb.menu.flash.16777216_9437184.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_9437184.build.fs_start=275771392
waveshare_rp2040_plus_16mb.menu.flash.16777216_9437184.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_10485760.upload.maximum_size=6287360
waveshare_rp2040_plus_16mb.menu.flash.16777216_10485760.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_10485760.build.flash_length=6287360
waveshare_rp2040_plus_16mb.menu.flash.16777216_10485760.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_10485760.build.fs_start=274722816
waveshare_rp2040_plus_16mb.menu.flash.16777216_10485760.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_11534336.upload.maximum_size=5238784
waveshare_rp2040_plus_16mb.menu.flash.16777216_11534336.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_11534336.build.flash_length=5238784
waveshare_rp2040_plus_16mb.menu.flash.16777216_11534336.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_11534336.build.fs_start=273674240
waveshare_rp2040_plus_16mb.menu.flash.16777216_11534336.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912.upload.maximum_size=4190208
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912.build.flash_length=4190208
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912.build.fs_start=272625664
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.upload.maximum_size=3141632
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.build.flash_total=16777216
